Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xc27 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 35 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xf0eef): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xa71f4): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x2d9c5): /Users/isabellalopiano/STM32CubeIDE/workspace_1.19.0/IS1300Project/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 36 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 6 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0x13e17): unsigned int
 <1><38>: Abbrev Number: 6 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x6fced): long long int

    <41>   DW_AT_encoding    : 4	(float)
    <42>   DW_AT_name        : (indirect string, offset: 0x165fd): long double
 <1><46>: Abbrev Number: 6 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 1
    <48>   DW_AT_encoding    : 6	(signed char)
    <49>   DW_AT_name        : (indirect string, offset: 0x7b40b): signed char
 <1><4d>: Abbrev Number: 3 (DW_TAG_typedef)
    <4e>   DW_AT_name        : (indirect string, offset: 0x46fa5): __uint8_t
    <52>   DW_AT_decl_file   : 2
    <53>   DW_AT_decl_line   : 43
    <54>   DW_AT_decl_column : 24
    <55>   DW_AT_type        : <0x59>
 <1><59>: Abbrev Number: 6 (DW_TAG_base_type)
    <5a>   DW_AT_byte_size   : 1
    <5b>   DW_AT_encoding    : 8	(unsigned char)
    <5c>   DW_AT_name        : (indirect string, offset: 0xec982): unsigned char
 <1><60>: Abbrev Number: 3 (DW_TAG_typedef)
    <61>   DW_AT_name        : (indirect string, offset: 0x2c778): __int16_t
    <65>   DW_AT_decl_file   : 2
    <66>   DW_AT_decl_line   : 55
    <67>   DW_AT_decl_column : 24
    <68>   DW_AT_type        : <0x6c>
 <1><6c>: Abbrev Number: 6 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 2
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (indirect string, offset: 0xb61a6): short int
 <1><73>: Abbrev Number: 3 (DW_TAG_typedef)
    <74>   DW_AT_name        : (indirect string, offset: 0xc864e): __uint16_t
    <78>   DW_AT_decl_file   : 2
    <79>   DW_AT_decl_line   : 57
    <7a>   DW_AT_decl_column : 25
    <7b>   DW_AT_type        : <0x7f>
 <1><7f>: Abbrev Number: 6 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 2
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0xeaf2f): short unsigned int
 <1><86>: Abbrev Number: 6 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : (indirect string, offset: 0x148bc): long int
 <1><8d>: Abbrev Number: 3 (DW_TAG_typedef)
    <8e>   DW_AT_name        : (indirect string, offset: 0x9c93e): __uint32_t
    <92>   DW_AT_decl_file   : 2
    <93>   DW_AT_decl_line   : 79
    <94>   DW_AT_decl_column : 25
    <95>   DW_AT_type        : <0x99>
 <1><99>: Abbrev Number: 6 (DW_TAG_base_type)
    <9a>   DW_AT_byte_size   : 4
    <9b>   DW_AT_encoding    : 7	(unsigned)
    <9c>   DW_AT_name        : (indirect string, offset: 0x5d678): long unsigned int
 <1><a0>: Abbrev Number: 6 (DW_TAG_base_type)
    <a1>   DW_AT_byte_size   : 8
    <a2>   DW_AT_encoding    : 7	(unsigned)
    <a3>   DW_AT_name        : (indirect string, offset: 0x3304f): long long unsigned int
 <1><a7>: Abbrev Number: 3 (DW_TAG_typedef)
    <a8>   DW_AT_name        : (indirect string, offset: 0x46fa7): uint8_t
    <ac>   DW_AT_decl_file   : 3
    <ad>   DW_AT_decl_line   : 24
    <ae>   DW_AT_decl_column : 19
    <af>   DW_AT_type        : <0x4d>
 <1><b3>: Abbrev Number: 15 (DW_TAG_const_type)
    <b4>   DW_AT_type        : <0xa7>
 <1><b8>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9>   DW_AT_name        : (indirect string, offset: 0x2c77a): int16_t
    <bd>   DW_AT_decl_file   : 3
    <be>   DW_AT_decl_line   : 32
    <bf>   DW_AT_decl_column : 19
    <c0>   DW_AT_type        : <0x60>
 <1><c4>: Abbrev Number: 3 (DW_TAG_typedef)
    <c5>   DW_AT_name        : (indirect string, offset: 0xfd65): uint16_t
    <c9>   DW_AT_decl_file   : 3
    <ca>   DW_AT_decl_line   : 36
    <cb>   DW_AT_decl_column : 20
    <cc>   DW_AT_type        : <0x73>
 <1><d0>: Abbrev Number: 3 (DW_TAG_typedef)
    <d1>   DW_AT_name        : (indirect string, offset: 0xb2056): uint32_t
    <d5>   DW_AT_decl_file   : 3
    <d6>   DW_AT_decl_line   : 48
    <d7>   DW_AT_decl_column : 20
    <d8>   DW_AT_type        : <0x8d>
 <1><dc>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <dd>   DW_AT_type        : <0xd0>
 <1><e1>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <e2>   DW_AT_byte_size   : 4
    <e2>   DW_AT_type        : <0xe6>
 <1><e6>: Abbrev Number: 37 (DW_TAG_subroutine_type)
    <e7>   DW_AT_prototyped  : 1
    <e7>   DW_AT_sibling     : <0xf1>
 <2><eb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ec>   DW_AT_type        : <0xf1>
 <2><f0>: Abbrev Number: 0
 <1><f1>: Abbrev Number: 38 (DW_TAG_pointer_type)
    <f2>   DW_AT_byte_size   : 4
 <1><f3>: Abbrev Number: 3 (DW_TAG_typedef)
    <f4>   DW_AT_name        : (indirect string, offset: 0xfbf46): BaseType_t
    <f8>   DW_AT_decl_file   : 4
    <f9>   DW_AT_decl_line   : 56
    <fa>   DW_AT_decl_column : 14
    <fb>   DW_AT_type        : <0x86>
 <1><ff>: Abbrev Number: 15 (DW_TAG_const_type)
    <100>   DW_AT_type        : <0xf3>
 <1><104>: Abbrev Number: 3 (DW_TAG_typedef)
    <105>   DW_AT_name        : (indirect string, offset: 0x8683f): TickType_t
    <109>   DW_AT_decl_file   : 4
    <10a>   DW_AT_decl_line   : 63
    <10b>   DW_AT_decl_column : 19
    <10c>   DW_AT_type        : <0xd0>
 <1><110>: Abbrev Number: 15 (DW_TAG_const_type)
    <111>   DW_AT_type        : <0x104>
 <1><115>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <116>   DW_AT_byte_size   : 4
    <116>   DW_AT_type        : <0xa7>
 <1><11a>: Abbrev Number: 6 (DW_TAG_base_type)
    <11b>   DW_AT_byte_size   : 1
    <11c>   DW_AT_encoding    : 8	(unsigned char)
    <11d>   DW_AT_name        : (indirect string, offset: 0x4edcd): char
 <1><121>: Abbrev Number: 15 (DW_TAG_const_type)
    <122>   DW_AT_type        : <0x11a>
 <1><126>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <127>   DW_AT_byte_size   : 4
    <127>   DW_AT_type        : <0x121>
 <1><12b>: Abbrev Number: 39 (DW_TAG_structure_type)
    <12c>   DW_AT_byte_size   : 48
    <12d>   DW_AT_decl_file   : 5
    <12e>   DW_AT_decl_line   : 531
    <130>   DW_AT_decl_column : 9
    <131>   DW_AT_sibling     : <0x1ba>
 <2><135>: Abbrev Number: 16 (DW_TAG_member)
    <136>   DW_AT_name        : (indirect string, offset: 0x185a): MODER
    <13a>   DW_AT_decl_file   : 5
    <13a>   DW_AT_decl_line   : 533
    <13c>   DW_AT_decl_column : 17
    <13c>   DW_AT_type        : <0xdc>
    <140>   DW_AT_data_member_location: 0
 <2><141>: Abbrev Number: 16 (DW_TAG_member)
    <142>   DW_AT_name        : (indirect string, offset: 0xbdb70): OTYPER
    <146>   DW_AT_decl_file   : 5
    <146>   DW_AT_decl_line   : 534
    <148>   DW_AT_decl_column : 17
    <148>   DW_AT_type        : <0xdc>
    <14c>   DW_AT_data_member_location: 4
 <2><14d>: Abbrev Number: 16 (DW_TAG_member)
    <14e>   DW_AT_name        : (indirect string, offset: 0xd5686): OSPEEDR
    <152>   DW_AT_decl_file   : 5
    <152>   DW_AT_decl_line   : 535
    <154>   DW_AT_decl_column : 17
    <154>   DW_AT_type        : <0xdc>
    <158>   DW_AT_data_member_location: 8
 <2><159>: Abbrev Number: 16 (DW_TAG_member)
    <15a>   DW_AT_name        : (indirect string, offset: 0x9f058): PUPDR
    <15e>   DW_AT_decl_file   : 5
    <15e>   DW_AT_decl_line   : 536
    <160>   DW_AT_decl_column : 17
    <160>   DW_AT_type        : <0xdc>
    <164>   DW_AT_data_member_location: 12
 <2><165>: Abbrev Number: 19 (DW_TAG_member)
    <166>   DW_AT_name        : IDR
    <16a>   DW_AT_decl_file   : 5
    <16a>   DW_AT_decl_line   : 537
    <16c>   DW_AT_decl_column : 17
    <16c>   DW_AT_type        : <0xdc>
    <170>   DW_AT_data_member_location: 16
 <2><171>: Abbrev Number: 19 (DW_TAG_member)
    <172>   DW_AT_name        : ODR
    <176>   DW_AT_decl_file   : 5
    <176>   DW_AT_decl_line   : 538
    <178>   DW_AT_decl_column : 17
    <178>   DW_AT_type        : <0xdc>
    <17c>   DW_AT_data_member_location: 20
 <2><17d>: Abbrev Number: 16 (DW_TAG_member)
    <17e>   DW_AT_name        : (indirect string, offset: 0x9e309): BSRR
    <182>   DW_AT_decl_file   : 5
    <182>   DW_AT_decl_line   : 539
    <184>   DW_AT_decl_column : 17
    <184>   DW_AT_type        : <0xdc>
    <188>   DW_AT_data_member_location: 24
 <2><189>: Abbrev Number: 16 (DW_TAG_member)
    <18a>   DW_AT_name        : (indirect string, offset: 0xd275d): LCKR
    <18e>   DW_AT_decl_file   : 5
    <18e>   DW_AT_decl_line   : 540
    <190>   DW_AT_decl_column : 17
    <190>   DW_AT_type        : <0xdc>
    <194>   DW_AT_data_member_location: 28
 <2><195>: Abbrev Number: 19 (DW_TAG_member)
    <196>   DW_AT_name        : AFR
    <19a>   DW_AT_decl_file   : 5
    <19a>   DW_AT_decl_line   : 541
    <19c>   DW_AT_decl_column : 17
    <19c>   DW_AT_type        : <0x1ca>
    <1a0>   DW_AT_data_member_location: 32
 <2><1a1>: Abbrev Number: 19 (DW_TAG_member)
    <1a2>   DW_AT_name        : BRR
    <1a6>   DW_AT_decl_file   : 5
    <1a6>   DW_AT_decl_line   : 542
    <1a8>   DW_AT_decl_column : 17
    <1a8>   DW_AT_type        : <0xdc>
    <1ac>   DW_AT_data_member_location: 40
 <2><1ad>: Abbrev Number: 16 (DW_TAG_member)
    <1ae>   DW_AT_name        : (indirect string, offset: 0x2a7b): ASCR
    <1b2>   DW_AT_decl_file   : 5
    <1b2>   DW_AT_decl_line   : 543
    <1b4>   DW_AT_decl_column : 17
    <1b4>   DW_AT_type        : <0xdc>
    <1b8>   DW_AT_data_member_location: 44
 <2><1b9>: Abbrev Number: 0
 <1><1ba>: Abbrev Number: 22 (DW_TAG_array_type)
    <1bb>   DW_AT_type        : <0xdc>
    <1bf>   DW_AT_sibling     : <0x1ca>
 <2><1c3>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <1c4>   DW_AT_type        : <0x31>
    <1c8>   DW_AT_upper_bound : 1
 <2><1c9>: Abbrev Number: 0
 <1><1ca>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <1cb>   DW_AT_type        : <0x1ba>
 <1><1cf>: Abbrev Number: 40 (DW_TAG_typedef)
    <1d0>   DW_AT_name        : (indirect string, offset: 0xedf2b): GPIO_TypeDef
    <1d4>   DW_AT_decl_file   : 5
    <1d5>   DW_AT_decl_line   : 545
    <1d7>   DW_AT_decl_column : 3
    <1d8>   DW_AT_type        : <0x12b>
 <1><1dc>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <1dd>   DW_AT_encoding    : 7	(unsigned)
    <1de>   DW_AT_byte_size   : 1
    <1df>   DW_AT_type        : <0x59>
    <1e3>   DW_AT_decl_file   : 6
    <1e4>   DW_AT_decl_line   : 68
    <1e5>   DW_AT_decl_column : 1
    <1e6>   DW_AT_sibling     : <0x1f7>
 <2><1ea>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x32a65): GPIO_PIN_RESET
    <1ef>   DW_AT_const_value : 0
 <2><1f0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1f1>   DW_AT_name        : (indirect string, offset: 0x3d845): GPIO_PIN_SET
    <1f5>   DW_AT_const_value : 1
 <2><1f6>: Abbrev Number: 0
 <1><1f7>: Abbrev Number: 3 (DW_TAG_typedef)
    <1f8>   DW_AT_name        : (indirect string, offset: 0xf0d29): GPIO_PinState
    <1fc>   DW_AT_decl_file   : 6
    <1fd>   DW_AT_decl_line   : 71
    <1fe>   DW_AT_decl_column : 3
    <1ff>   DW_AT_type        : <0x1dc>
 <1><203>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <204>   DW_AT_encoding    : 7	(unsigned)
    <205>   DW_AT_byte_size   : 4
    <206>   DW_AT_type        : <0x31>
    <20a>   DW_AT_decl_file   : 7
    <20b>   DW_AT_decl_line   : 14
    <20c>   DW_AT_decl_column : 14
    <20d>   DW_AT_sibling     : <0x272>
 <2><211>: Abbrev Number: 13 (DW_TAG_enumerator)
    <212>   DW_AT_name        : (indirect string, offset: 0x71939): TL_EW_Red
    <216>   DW_AT_const_value : 0x800080
 <2><21a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <21b>   DW_AT_name        : (indirect string, offset: 0x3d08c): TL_EW_Yellow
    <21f>   DW_AT_const_value : 0x400040
 <2><223>: Abbrev Number: 13 (DW_TAG_enumerator)
    <224>   DW_AT_name        : (indirect string, offset: 0xed00a): TL_EW_Green
    <228>   DW_AT_const_value : 0x200020
 <2><22c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <22d>   DW_AT_name        : (indirect string, offset: 0x1ecec): TL_NS_Red
    <231>   DW_AT_const_value : 32784
 <2><233>: Abbrev Number: 5 (DW_TAG_enumerator)
    <234>   DW_AT_name        : (indirect string, offset: 0x500b6): TL_NS_Yellow
    <238>   DW_AT_const_value : 16392
 <2><23a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <23b>   DW_AT_name        : (indirect string, offset: 0x1d882): TL_NS_Green
    <23f>   DW_AT_const_value : 8196
 <2><241>: Abbrev Number: 13 (DW_TAG_enumerator)
    <242>   DW_AT_name        : (indirect string, offset: 0xe0002): PL1_Red
    <246>   DW_AT_const_value : 0x100000
 <2><24a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <24b>   DW_AT_name        : (indirect string, offset: 0x884fa): PL1_Green
    <24f>   DW_AT_const_value : 0x80000
 <2><253>: Abbrev Number: 13 (DW_TAG_enumerator)
    <254>   DW_AT_name        : (indirect string, offset: 0xf4fc5): PL1_Blue
    <258>   DW_AT_const_value : 0x40000
 <2><25c>: Abbrev Number: 5 (DW_TAG_enumerator)
    <25d>   DW_AT_name        : (indirect string, offset: 0xc6c2b): PL2_Red
    <261>   DW_AT_const_value : 4096
 <2><263>: Abbrev Number: 5 (DW_TAG_enumerator)
    <264>   DW_AT_name        : (indirect string, offset: 0x1eedb): PL2_Green
    <268>   DW_AT_const_value : 2048
 <2><26a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <26b>   DW_AT_name        : (indirect string, offset: 0xda29): PL2_Blue
    <26f>   DW_AT_const_value : 1024
 <2><271>: Abbrev Number: 0
 <1><272>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <273>   DW_AT_encoding    : 7	(unsigned)
    <274>   DW_AT_byte_size   : 1
    <275>   DW_AT_type        : <0x59>
    <279>   DW_AT_decl_file   : 7
    <27a>   DW_AT_decl_line   : 29
    <27b>   DW_AT_decl_column : 14
    <27c>   DW_AT_sibling     : <0x291>
 <2><280>: Abbrev Number: 8 (DW_TAG_enumerator)
    <281>   DW_AT_name        : TL
    <284>   DW_AT_const_value : 0
 <2><285>: Abbrev Number: 8 (DW_TAG_enumerator)
    <286>   DW_AT_name        : PL
    <289>   DW_AT_const_value : 1
 <2><28a>: Abbrev Number: 8 (DW_TAG_enumerator)
    <28b>   DW_AT_name        : PLB
    <28f>   DW_AT_const_value : 2
 <2><290>: Abbrev Number: 0
 <1><291>: Abbrev Number: 3 (DW_TAG_typedef)
    <292>   DW_AT_name        : (indirect string, offset: 0x69c21): ledType
    <296>   DW_AT_decl_file   : 7
    <297>   DW_AT_decl_line   : 33
    <298>   DW_AT_decl_column : 3
    <299>   DW_AT_type        : <0x272>
 <1><29d>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <29e>   DW_AT_encoding    : 7	(unsigned)
    <29f>   DW_AT_byte_size   : 2
    <2a0>   DW_AT_type        : <0x7f>
    <2a4>   DW_AT_decl_file   : 7
    <2a5>   DW_AT_decl_line   : 35
    <2a6>   DW_AT_decl_column : 14
    <2a7>   DW_AT_sibling     : <0x2ea>
 <2><2ab>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x83fc1): Event_PL1
    <2b0>   DW_AT_const_value : 1
 <2><2b1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2b2>   DW_AT_name        : (indirect string, offset: 0x83fcb): Event_PL2
    <2b6>   DW_AT_const_value : 2
 <2><2b7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2b8>   DW_AT_name        : (indirect string, offset: 0x6597): Event_TL1_Switch
    <2bc>   DW_AT_const_value : 4
 <2><2bd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2be>   DW_AT_name        : (indirect string, offset: 0x4cdb9): Event_TL2_Switch
    <2c2>   DW_AT_const_value : 8
 <2><2c3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2c4>   DW_AT_name        : (indirect string, offset: 0x93c37): Event_TL3_Switch
    <2c8>   DW_AT_const_value : 16
 <2><2c9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x90a67): Event_TL4_Switch
    <2ce>   DW_AT_const_value : 32
 <2><2cf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2d0>   DW_AT_name        : (indirect string, offset: 0x6c71a): Event_NS_Safe_Walk
    <2d4>   DW_AT_const_value : 64
 <2><2d5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2d6>   DW_AT_name        : (indirect string, offset: 0x5047c): Event_EW_Safe_Walk
    <2da>   DW_AT_const_value : 128
 <2><2db>: Abbrev Number: 5 (DW_TAG_enumerator)
    <2dc>   DW_AT_name        : (indirect string, offset: 0x72e38): Event_PL1_Pressed_Yellow
    <2e0>   DW_AT_const_value : 256
 <2><2e2>: Abbrev Number: 5 (DW_TAG_enumerator)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x854f9): Event_PL2_Pressed_Yellow
    <2e7>   DW_AT_const_value : 512
 <2><2e9>: Abbrev Number: 0
 <1><2ea>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <2eb>   DW_AT_encoding    : 7	(unsigned)
    <2ec>   DW_AT_byte_size   : 1
    <2ed>   DW_AT_type        : <0x59>
    <2f1>   DW_AT_decl_file   : 7
    <2f2>   DW_AT_decl_line   : 48
    <2f3>   DW_AT_decl_column : 14
    <2f4>   DW_AT_sibling     : <0x311>
 <2><2f8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2f9>   DW_AT_name        : (indirect string, offset: 0x5e6d2): NSG_EWR
    <2fd>   DW_AT_const_value : 0
 <2><2fe>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x247e2): NSY_EWR
    <303>   DW_AT_const_value : 1
 <2><304>: Abbrev Number: 1 (DW_TAG_enumerator)
    <305>   DW_AT_name        : (indirect string, offset: 0xdf5b0): NSR_EWY
    <309>   DW_AT_const_value : 2
 <2><30a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <30b>   DW_AT_name        : (indirect string, offset: 0xdf44d): NSR_EWG
    <30f>   DW_AT_const_value : 3
 <2><310>: Abbrev Number: 0
 <1><311>: Abbrev Number: 3 (DW_TAG_typedef)
    <312>   DW_AT_name        : (indirect string, offset: 0x341e2): states
    <316>   DW_AT_decl_file   : 7
    <317>   DW_AT_decl_line   : 53
    <318>   DW_AT_decl_column : 3
    <319>   DW_AT_type        : <0x2ea>
 <1><31d>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <31e>   DW_AT_encoding    : 7	(unsigned)
    <31f>   DW_AT_byte_size   : 2
    <320>   DW_AT_type        : <0x7f>
    <324>   DW_AT_decl_file   : 7
    <325>   DW_AT_decl_line   : 55
    <326>   DW_AT_decl_column : 14
    <327>   DW_AT_sibling     : <0x356>
 <2><32b>: Abbrev Number: 5 (DW_TAG_enumerator)
    <32c>   DW_AT_name        : (indirect string, offset: 0xda01f): yellowDelay
    <330>   DW_AT_const_value : 2000
 <2><332>: Abbrev Number: 5 (DW_TAG_enumerator)
    <333>   DW_AT_name        : (indirect string, offset: 0x925ea): greenDelay
    <337>   DW_AT_const_value : 10000
 <2><339>: Abbrev Number: 5 (DW_TAG_enumerator)
    <33a>   DW_AT_name        : (indirect string, offset: 0xe98f): redDelayMax
    <33e>   DW_AT_const_value : 1000
 <2><340>: Abbrev Number: 5 (DW_TAG_enumerator)
    <341>   DW_AT_name        : (indirect string, offset: 0x551a0): pedestrianDelay
    <345>   DW_AT_const_value : 7000
 <2><347>: Abbrev Number: 5 (DW_TAG_enumerator)
    <348>   DW_AT_name        : (indirect string, offset: 0x8c091): walkingDelay
    <34c>   DW_AT_const_value : 8000
 <2><34e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <34f>   DW_AT_name        : (indirect string, offset: 0x8be58): toggleFreq
    <353>   DW_AT_const_value : 500
 <2><355>: Abbrev Number: 0
 <1><356>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <357>   DW_AT_encoding    : 7	(unsigned)
    <358>   DW_AT_byte_size   : 1
    <359>   DW_AT_type        : <0x59>
    <35d>   DW_AT_decl_file   : 7
    <35e>   DW_AT_decl_line   : 64
    <35f>   DW_AT_decl_column : 14
    <360>   DW_AT_sibling     : <0x38d>
 <2><364>: Abbrev Number: 8 (DW_TAG_enumerator)
    <365>   DW_AT_name        : P1
    <368>   DW_AT_const_value : 0
 <2><369>: Abbrev Number: 8 (DW_TAG_enumerator)
    <36a>   DW_AT_name        : P2
    <36d>   DW_AT_const_value : 1
 <2><36e>: Abbrev Number: 8 (DW_TAG_enumerator)
    <36f>   DW_AT_name        : W1
    <372>   DW_AT_const_value : 2
 <2><373>: Abbrev Number: 8 (DW_TAG_enumerator)
    <374>   DW_AT_name        : W2
    <377>   DW_AT_const_value : 3
 <2><378>: Abbrev Number: 8 (DW_TAG_enumerator)
    <379>   DW_AT_name        : G1
    <37c>   DW_AT_const_value : 4
 <2><37d>: Abbrev Number: 8 (DW_TAG_enumerator)
    <37e>   DW_AT_name        : G2
    <381>   DW_AT_const_value : 5
 <2><382>: Abbrev Number: 8 (DW_TAG_enumerator)
    <383>   DW_AT_name        : R1
    <386>   DW_AT_const_value : 6
 <2><387>: Abbrev Number: 8 (DW_TAG_enumerator)
    <388>   DW_AT_name        : R2
    <38b>   DW_AT_const_value : 7
 <2><38c>: Abbrev Number: 0
 <1><38d>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <38e>   DW_AT_encoding    : 5	(signed)
    <38f>   DW_AT_byte_size   : 4
    <390>   DW_AT_type        : <0x2a>
    <394>   DW_AT_decl_file   : 8
    <395>   DW_AT_decl_line   : 82
    <396>   DW_AT_decl_column : 14
    <397>   DW_AT_sibling     : <0x4dd>
 <2><39b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <39c>   DW_AT_name        : (indirect string, offset: 0x48759): osPriorityNone
    <3a0>   DW_AT_const_value : 0
 <2><3a1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3a2>   DW_AT_name        : (indirect string, offset: 0xd4fd5): osPriorityIdle
    <3a6>   DW_AT_const_value : 1
 <2><3a7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3a8>   DW_AT_name        : (indirect string, offset: 0xe20a3): osPriorityLow
    <3ac>   DW_AT_const_value : 8
 <2><3ad>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3ae>   DW_AT_name        : (indirect string, offset: 0xc4276): osPriorityLow1
    <3b2>   DW_AT_const_value : 9
 <2><3b3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3b4>   DW_AT_name        : (indirect string, offset: 0xe8ed1): osPriorityLow2
    <3b8>   DW_AT_const_value : 10
 <2><3b9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3ba>   DW_AT_name        : (indirect string, offset: 0xe8ee0): osPriorityLow3
    <3be>   DW_AT_const_value : 11
 <2><3bf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3c0>   DW_AT_name        : (indirect string, offset: 0xe8eef): osPriorityLow4
    <3c4>   DW_AT_const_value : 12
 <2><3c5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3c6>   DW_AT_name        : (indirect string, offset: 0xe8efe): osPriorityLow5
    <3ca>   DW_AT_const_value : 13
 <2><3cb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3cc>   DW_AT_name        : (indirect string, offset: 0xe8f0d): osPriorityLow6
    <3d0>   DW_AT_const_value : 14
 <2><3d1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x5b43e): osPriorityLow7
    <3d6>   DW_AT_const_value : 15
 <2><3d7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3d8>   DW_AT_name        : (indirect string, offset: 0xeb81e): osPriorityBelowNormal
    <3dc>   DW_AT_const_value : 16
 <2><3dd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3de>   DW_AT_name        : (indirect string, offset: 0x92d43): osPriorityBelowNormal1
    <3e2>   DW_AT_const_value : 17
 <2><3e3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3e4>   DW_AT_name        : (indirect string, offset: 0xd0047): osPriorityBelowNormal2
    <3e8>   DW_AT_const_value : 18
 <2><3e9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3ea>   DW_AT_name        : (indirect string, offset: 0xa786e): osPriorityBelowNormal3
    <3ee>   DW_AT_const_value : 19
 <2><3ef>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3f0>   DW_AT_name        : (indirect string, offset: 0xd007c): osPriorityBelowNormal4
    <3f4>   DW_AT_const_value : 20
 <2><3f5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3f6>   DW_AT_name        : (indirect string, offset: 0xd0093): osPriorityBelowNormal5
    <3fa>   DW_AT_const_value : 21
 <2><3fb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3fc>   DW_AT_name        : (indirect string, offset: 0xd00aa): osPriorityBelowNormal6
    <400>   DW_AT_const_value : 22
 <2><401>: Abbrev Number: 1 (DW_TAG_enumerator)
    <402>   DW_AT_name        : (indirect string, offset: 0xbb61d): osPriorityBelowNormal7
    <406>   DW_AT_const_value : 23
 <2><407>: Abbrev Number: 1 (DW_TAG_enumerator)
    <408>   DW_AT_name        : (indirect string, offset: 0xc7da3): osPriorityNormal
    <40c>   DW_AT_const_value : 24
 <2><40d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <40e>   DW_AT_name        : (indirect string, offset: 0x27111): osPriorityNormal1
    <412>   DW_AT_const_value : 25
 <2><413>: Abbrev Number: 1 (DW_TAG_enumerator)
    <414>   DW_AT_name        : (indirect string, offset: 0x27123): osPriorityNormal2
    <418>   DW_AT_const_value : 26
 <2><419>: Abbrev Number: 1 (DW_TAG_enumerator)
    <41a>   DW_AT_name        : (indirect string, offset: 0x27135): osPriorityNormal3
    <41e>   DW_AT_const_value : 27
 <2><41f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <420>   DW_AT_name        : (indirect string, offset: 0x55dfe): osPriorityNormal4
    <424>   DW_AT_const_value : 28
 <2><425>: Abbrev Number: 1 (DW_TAG_enumerator)
    <426>   DW_AT_name        : (indirect string, offset: 0x27176): osPriorityNormal5
    <42a>   DW_AT_const_value : 29
 <2><42b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <42c>   DW_AT_name        : (indirect string, offset: 0x27188): osPriorityNormal6
    <430>   DW_AT_const_value : 30
 <2><431>: Abbrev Number: 1 (DW_TAG_enumerator)
    <432>   DW_AT_name        : (indirect string, offset: 0x2719a): osPriorityNormal7
    <436>   DW_AT_const_value : 31
 <2><437>: Abbrev Number: 1 (DW_TAG_enumerator)
    <438>   DW_AT_name        : (indirect string, offset: 0x9d9ef): osPriorityAboveNormal
    <43c>   DW_AT_const_value : 32
 <2><43d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <43e>   DW_AT_name        : (indirect string, offset: 0xf4924): osPriorityAboveNormal1
    <442>   DW_AT_const_value : 33
 <2><443>: Abbrev Number: 1 (DW_TAG_enumerator)
    <444>   DW_AT_name        : (indirect string, offset: 0xe6ecd): osPriorityAboveNormal2
    <448>   DW_AT_const_value : 34
 <2><449>: Abbrev Number: 1 (DW_TAG_enumerator)
    <44a>   DW_AT_name        : (indirect string, offset: 0xf495b): osPriorityAboveNormal3
    <44e>   DW_AT_const_value : 35
 <2><44f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <450>   DW_AT_name        : (indirect string, offset: 0xf4972): osPriorityAboveNormal4
    <454>   DW_AT_const_value : 36
 <2><455>: Abbrev Number: 1 (DW_TAG_enumerator)
    <456>   DW_AT_name        : (indirect string, offset: 0xe6f69): osPriorityAboveNormal5
    <45a>   DW_AT_const_value : 37
 <2><45b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <45c>   DW_AT_name        : (indirect string, offset: 0xf499f): osPriorityAboveNormal6
    <460>   DW_AT_const_value : 38
 <2><461>: Abbrev Number: 1 (DW_TAG_enumerator)
    <462>   DW_AT_name        : (indirect string, offset: 0xf49b6): osPriorityAboveNormal7
    <466>   DW_AT_const_value : 39
 <2><467>: Abbrev Number: 1 (DW_TAG_enumerator)
    <468>   DW_AT_name        : (indirect string, offset: 0x56fb9): osPriorityHigh
    <46c>   DW_AT_const_value : 40
 <2><46d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <46e>   DW_AT_name        : (indirect string, offset: 0xa2cc2): osPriorityHigh1
    <472>   DW_AT_const_value : 41
 <2><473>: Abbrev Number: 1 (DW_TAG_enumerator)
    <474>   DW_AT_name        : (indirect string, offset: 0xa2cd2): osPriorityHigh2
    <478>   DW_AT_const_value : 42
 <2><479>: Abbrev Number: 1 (DW_TAG_enumerator)
    <47a>   DW_AT_name        : (indirect string, offset: 0xa2ce2): osPriorityHigh3
    <47e>   DW_AT_const_value : 43
 <2><47f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <480>   DW_AT_name        : (indirect string, offset: 0xa2cf2): osPriorityHigh4
    <484>   DW_AT_const_value : 44
 <2><485>: Abbrev Number: 1 (DW_TAG_enumerator)
    <486>   DW_AT_name        : (indirect string, offset: 0x5c05d): osPriorityHigh5
    <48a>   DW_AT_const_value : 45
 <2><48b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <48c>   DW_AT_name        : (indirect string, offset: 0xa2d2e): osPriorityHigh6
    <490>   DW_AT_const_value : 46
 <2><491>: Abbrev Number: 1 (DW_TAG_enumerator)
    <492>   DW_AT_name        : (indirect string, offset: 0xa2d3e): osPriorityHigh7
    <496>   DW_AT_const_value : 47
 <2><497>: Abbrev Number: 1 (DW_TAG_enumerator)
    <498>   DW_AT_name        : (indirect string, offset: 0xde3ec): osPriorityRealtime
    <49c>   DW_AT_const_value : 48
 <2><49d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <49e>   DW_AT_name        : (indirect string, offset: 0x9a0c9): osPriorityRealtime1
    <4a2>   DW_AT_const_value : 49
 <2><4a3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <4a4>   DW_AT_name        : (indirect string, offset: 0x9a0dd): osPriorityRealtime2
    <4a8>   DW_AT_const_value : 50
 <2><4a9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <4aa>   DW_AT_name        : (indirect string, offset: 0x9a0f1): osPriorityRealtime3
    <4ae>   DW_AT_const_value : 51
 <2><4af>: Abbrev Number: 1 (DW_TAG_enumerator)
    <4b0>   DW_AT_name        : (indirect string, offset: 0x9a105): osPriorityRealtime4
    <4b4>   DW_AT_const_value : 52
 <2><4b5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <4b6>   DW_AT_name        : (indirect string, offset: 0x9a119): osPriorityRealtime5
    <4ba>   DW_AT_const_value : 53
 <2><4bb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <4bc>   DW_AT_name        : (indirect string, offset: 0x9a12d): osPriorityRealtime6
    <4c0>   DW_AT_const_value : 54
 <2><4c1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x9a141): osPriorityRealtime7
    <4c6>   DW_AT_const_value : 55
 <2><4c7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <4c8>   DW_AT_name        : (indirect string, offset: 0xe4d): osPriorityISR
    <4cc>   DW_AT_const_value : 56
 <2><4cd>: Abbrev Number: 17 (DW_TAG_enumerator)
    <4ce>   DW_AT_name        : (indirect string, offset: 0xd881f): osPriorityError
    <4d2>   DW_AT_const_value : -1
 <2><4d3>: Abbrev Number: 13 (DW_TAG_enumerator)
    <4d4>   DW_AT_name        : (indirect string, offset: 0xe94ca): osPriorityReserved
    <4d8>   DW_AT_const_value : 0x7fffffff
 <2><4dc>: Abbrev Number: 0
 <1><4dd>: Abbrev Number: 3 (DW_TAG_typedef)
    <4de>   DW_AT_name        : (indirect string, offset: 0xce8be): osPriority_t
    <4e2>   DW_AT_decl_file   : 8
    <4e3>   DW_AT_decl_line   : 136
    <4e4>   DW_AT_decl_column : 3
    <4e5>   DW_AT_type        : <0x38d>
 <1><4e9>: Abbrev Number: 3 (DW_TAG_typedef)
    <4ea>   DW_AT_name        : (indirect string, offset: 0x848a9): osThreadFunc_t
    <4ee>   DW_AT_decl_file   : 8
    <4ef>   DW_AT_decl_line   : 139
    <4f0>   DW_AT_decl_column : 16
    <4f1>   DW_AT_type        : <0xe1>
 <1><4f5>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <4f6>   DW_AT_encoding    : 5	(signed)
    <4f7>   DW_AT_byte_size   : 4
    <4f8>   DW_AT_type        : <0x2a>
    <4fc>   DW_AT_decl_file   : 8
    <4fd>   DW_AT_decl_line   : 176
    <4fe>   DW_AT_decl_column : 14
    <4ff>   DW_AT_sibling     : <0x537>
 <2><503>: Abbrev Number: 1 (DW_TAG_enumerator)
    <504>   DW_AT_name        : (indirect string, offset: 0xbccb1): osOK
    <508>   DW_AT_const_value : 0
 <2><509>: Abbrev Number: 17 (DW_TAG_enumerator)
    <50a>   DW_AT_name        : (indirect string, offset: 0x737af): osError
    <50e>   DW_AT_const_value : -1
 <2><50f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <510>   DW_AT_name        : (indirect string, offset: 0xdd10b): osErrorTimeout
    <514>   DW_AT_const_value : -2
 <2><515>: Abbrev Number: 17 (DW_TAG_enumerator)
    <516>   DW_AT_name        : (indirect string, offset: 0xa0c54): osErrorResource
    <51a>   DW_AT_const_value : -3
 <2><51b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <51c>   DW_AT_name        : (indirect string, offset: 0x3f87b): osErrorParameter
    <520>   DW_AT_const_value : -4
 <2><521>: Abbrev Number: 17 (DW_TAG_enumerator)
    <522>   DW_AT_name        : (indirect string, offset: 0x2a7a4): osErrorNoMemory
    <526>   DW_AT_const_value : -5
 <2><527>: Abbrev Number: 17 (DW_TAG_enumerator)
    <528>   DW_AT_name        : (indirect string, offset: 0x42155): osErrorISR
    <52c>   DW_AT_const_value : -6
 <2><52d>: Abbrev Number: 13 (DW_TAG_enumerator)
    <52e>   DW_AT_name        : (indirect string, offset: 0x7c078): osStatusReserved
    <532>   DW_AT_const_value : 0x7fffffff
 <2><536>: Abbrev Number: 0
 <1><537>: Abbrev Number: 3 (DW_TAG_typedef)
    <538>   DW_AT_name        : (indirect string, offset: 0x53156): osStatus_t
    <53c>   DW_AT_decl_file   : 8
    <53d>   DW_AT_decl_line   : 185
    <53e>   DW_AT_decl_column : 3
    <53f>   DW_AT_type        : <0x4f5>
 <1><543>: Abbrev Number: 3 (DW_TAG_typedef)
    <544>   DW_AT_name        : (indirect string, offset: 0x2c96d): osThreadId_t
    <548>   DW_AT_decl_file   : 8
    <549>   DW_AT_decl_line   : 189
    <54a>   DW_AT_decl_column : 15
    <54b>   DW_AT_type        : <0xf1>
 <1><54f>: Abbrev Number: 3 (DW_TAG_typedef)
    <550>   DW_AT_name        : (indirect string, offset: 0xa50a6): TZ_ModuleId_t
    <554>   DW_AT_decl_file   : 8
    <555>   DW_AT_decl_line   : 213
    <556>   DW_AT_decl_column : 18
    <557>   DW_AT_type        : <0xd0>
 <1><55b>: Abbrev Number: 26 (DW_TAG_structure_type)
    <55c>   DW_AT_byte_size   : 36
    <55d>   DW_AT_decl_file   : 8
    <55e>   DW_AT_decl_line   : 218
    <55f>   DW_AT_decl_column : 9
    <55f>   DW_AT_sibling     : <0x5d9>
 <2><563>: Abbrev Number: 7 (DW_TAG_member)
    <564>   DW_AT_name        : (indirect string, offset: 0xdb5b8): name
    <568>   DW_AT_decl_file   : 8
    <569>   DW_AT_decl_line   : 219
    <56a>   DW_AT_decl_column : 33
    <56b>   DW_AT_type        : <0x126>
    <56f>   DW_AT_data_member_location: 0
 <2><570>: Abbrev Number: 7 (DW_TAG_member)
    <571>   DW_AT_name        : (indirect string, offset: 0xa095e): attr_bits
    <575>   DW_AT_decl_file   : 8
    <576>   DW_AT_decl_line   : 220
    <577>   DW_AT_decl_column : 28
    <578>   DW_AT_type        : <0xd0>
    <57c>   DW_AT_data_member_location: 4
 <2><57d>: Abbrev Number: 7 (DW_TAG_member)
    <57e>   DW_AT_name        : (indirect string, offset: 0x2f6ff): cb_mem
    <582>   DW_AT_decl_file   : 8
    <583>   DW_AT_decl_line   : 221
    <584>   DW_AT_decl_column : 30
    <585>   DW_AT_type        : <0xf1>
    <589>   DW_AT_data_member_location: 8
 <2><58a>: Abbrev Number: 7 (DW_TAG_member)
    <58b>   DW_AT_name        : (indirect string, offset: 0x6bc3f): cb_size
    <58f>   DW_AT_decl_file   : 8
    <590>   DW_AT_decl_line   : 222
    <591>   DW_AT_decl_column : 30
    <592>   DW_AT_type        : <0xd0>
    <596>   DW_AT_data_member_location: 12
 <2><597>: Abbrev Number: 7 (DW_TAG_member)
    <598>   DW_AT_name        : (indirect string, offset: 0xdef95): stack_mem
    <59c>   DW_AT_decl_file   : 8
    <59d>   DW_AT_decl_line   : 223
    <59e>   DW_AT_decl_column : 27
    <59f>   DW_AT_type        : <0xf1>
    <5a3>   DW_AT_data_member_location: 16
 <2><5a4>: Abbrev Number: 7 (DW_TAG_member)
    <5a5>   DW_AT_name        : (indirect string, offset: 0x9a1a6): stack_size
    <5a9>   DW_AT_decl_file   : 8
    <5aa>   DW_AT_decl_line   : 224
    <5ab>   DW_AT_decl_column : 27
    <5ac>   DW_AT_type        : <0xd0>
    <5b0>   DW_AT_data_member_location: 20
 <2><5b1>: Abbrev Number: 7 (DW_TAG_member)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x60f42): priority
    <5b6>   DW_AT_decl_file   : 8
    <5b7>   DW_AT_decl_line   : 225
    <5b8>   DW_AT_decl_column : 29
    <5b9>   DW_AT_type        : <0x4dd>
    <5bd>   DW_AT_data_member_location: 24
 <2><5be>: Abbrev Number: 7 (DW_TAG_member)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x68772): tz_module
    <5c3>   DW_AT_decl_file   : 8
    <5c4>   DW_AT_decl_line   : 226
    <5c5>   DW_AT_decl_column : 28
    <5c6>   DW_AT_type        : <0x54f>
    <5ca>   DW_AT_data_member_location: 28
 <2><5cb>: Abbrev Number: 7 (DW_TAG_member)
    <5cc>   DW_AT_name        : (indirect string, offset: 0xdc06b): reserved
    <5d0>   DW_AT_decl_file   : 8
    <5d1>   DW_AT_decl_line   : 227
    <5d2>   DW_AT_decl_column : 29
    <5d3>   DW_AT_type        : <0xd0>
    <5d7>   DW_AT_data_member_location: 32
 <2><5d8>: Abbrev Number: 0
 <1><5d9>: Abbrev Number: 3 (DW_TAG_typedef)
    <5da>   DW_AT_name        : (indirect string, offset: 0x26edc): osThreadAttr_t
    <5de>   DW_AT_decl_file   : 8
    <5df>   DW_AT_decl_line   : 228
    <5e0>   DW_AT_decl_column : 3
    <5e1>   DW_AT_type        : <0x55b>
 <1><5e5>: Abbrev Number: 15 (DW_TAG_const_type)
    <5e6>   DW_AT_type        : <0x5d9>
 <1><5ea>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <5eb>   DW_AT_byte_size   : 4
    <5eb>   DW_AT_type        : <0x5f4>
 <1><5ef>: Abbrev Number: 15 (DW_TAG_const_type)
    <5f0>   DW_AT_type        : <0x5ea>
 <1><5f4>: Abbrev Number: 41 (DW_TAG_const_type)
 <1><5f5>: Abbrev Number: 3 (DW_TAG_typedef)
    <5f6>   DW_AT_name        : (indirect string, offset: 0x72513): EventGroupHandle_t
    <5fa>   DW_AT_decl_file   : 9
    <5fb>   DW_AT_decl_line   : 82
    <5fc>   DW_AT_decl_column : 34
    <5fd>   DW_AT_type        : <0x601>
 <1><601>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <602>   DW_AT_byte_size   : 4
    <602>   DW_AT_type        : <0x606>
 <1><606>: Abbrev Number: 27 (DW_TAG_structure_type)
    <607>   DW_AT_name        : (indirect string, offset: 0xd93ff): EventGroupDef_t
    <60b>   DW_AT_declaration : 1
 <1><60b>: Abbrev Number: 3 (DW_TAG_typedef)
    <60c>   DW_AT_name        : (indirect string, offset: 0xf156a): EventBits_t
    <610>   DW_AT_decl_file   : 9
    <611>   DW_AT_decl_line   : 92
    <612>   DW_AT_decl_column : 20
    <613>   DW_AT_type        : <0x104>
 <1><617>: Abbrev Number: 15 (DW_TAG_const_type)
    <618>   DW_AT_type        : <0x60b>
 <1><61c>: Abbrev Number: 3 (DW_TAG_typedef)
    <61d>   DW_AT_name        : (indirect string, offset: 0x576c1): QueueHandle_t
    <621>   DW_AT_decl_file   : 10
    <622>   DW_AT_decl_line   : 48
    <623>   DW_AT_decl_column : 34
    <624>   DW_AT_type        : <0x628>
 <1><628>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <629>   DW_AT_byte_size   : 4
    <629>   DW_AT_type        : <0x62d>
 <1><62d>: Abbrev Number: 27 (DW_TAG_structure_type)
    <62e>   DW_AT_name        : (indirect string, offset: 0xa3020): QueueDefinition
    <632>   DW_AT_declaration : 1
 <1><632>: Abbrev Number: 3 (DW_TAG_typedef)
    <633>   DW_AT_name        : (indirect string, offset: 0x38198): SemaphoreHandle_t
    <637>   DW_AT_decl_file   : 11
    <638>   DW_AT_decl_line   : 37
    <639>   DW_AT_decl_column : 23
    <63a>   DW_AT_type        : <0x61c>
 <1><63e>: Abbrev Number: 28 (DW_TAG_variable)
    <63f>   DW_AT_name        : (indirect string, offset: 0x6c224): oledMutex
    <643>   DW_AT_decl_file   : 12
    <643>   DW_AT_decl_line   : 13
    <644>   DW_AT_decl_column : 26
    <645>   DW_AT_type        : <0x632>
    <649>   DW_AT_external    : 1
    <649>   DW_AT_declaration : 1
 <1><649>: Abbrev Number: 26 (DW_TAG_structure_type)
    <64a>   DW_AT_byte_size   : 12
    <64b>   DW_AT_decl_file   : 12
    <64c>   DW_AT_decl_line   : 15
    <64d>   DW_AT_decl_column : 9
    <64d>   DW_AT_sibling     : <0x679>
 <2><651>: Abbrev Number: 7 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0xc13a6): startTick
    <656>   DW_AT_decl_file   : 12
    <657>   DW_AT_decl_line   : 16
    <658>   DW_AT_decl_column : 16
    <659>   DW_AT_type        : <0x104>
    <65d>   DW_AT_data_member_location: 0
 <2><65e>: Abbrev Number: 7 (DW_TAG_member)
    <65f>   DW_AT_name        : (indirect string, offset: 0xe522a): durationTick
    <663>   DW_AT_decl_file   : 12
    <664>   DW_AT_decl_line   : 17
    <665>   DW_AT_decl_column : 16
    <666>   DW_AT_type        : <0x104>
    <66a>   DW_AT_data_member_location: 4
 <2><66b>: Abbrev Number: 7 (DW_TAG_member)
    <66c>   DW_AT_name        : (indirect string, offset: 0xfd03e): active
    <670>   DW_AT_decl_file   : 12
    <671>   DW_AT_decl_line   : 18
    <672>   DW_AT_decl_column : 13
    <673>   DW_AT_type        : <0xa7>
    <677>   DW_AT_data_member_location: 8
 <2><678>: Abbrev Number: 0
 <1><679>: Abbrev Number: 3 (DW_TAG_typedef)
    <67a>   DW_AT_name        : (indirect string, offset: 0xd0f0a): oledBarStruct
    <67e>   DW_AT_decl_file   : 12
    <67f>   DW_AT_decl_line   : 19
    <680>   DW_AT_decl_column : 3
    <681>   DW_AT_type        : <0x649>
 <1><685>: Abbrev Number: 22 (DW_TAG_array_type)
    <686>   DW_AT_type        : <0x679>
    <68a>   DW_AT_sibling     : <0x695>
 <2><68e>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <68f>   DW_AT_type        : <0x31>
    <693>   DW_AT_upper_bound : 7
 <2><694>: Abbrev Number: 0
 <1><695>: Abbrev Number: 28 (DW_TAG_variable)
    <696>   DW_AT_name        : (indirect string, offset: 0xaf3e6): oledBars
    <69a>   DW_AT_decl_file   : 12
    <69a>   DW_AT_decl_line   : 22
    <69b>   DW_AT_decl_column : 22
    <69c>   DW_AT_type        : <0x685>
    <6a0>   DW_AT_external    : 1
    <6a0>   DW_AT_declaration : 1
 <1><6a0>: Abbrev Number: 4 (DW_TAG_variable)
    <6a1>   DW_AT_name        : (indirect string, offset: 0xe38cd): eventGroup
    <6a5>   DW_AT_decl_file   : 1
    <6a5>   DW_AT_decl_line   : 55
    <6a6>   DW_AT_decl_column : 20
    <6a7>   DW_AT_type        : <0x5f5>
    <6ab>   DW_AT_external    : 1
    <6ab>   DW_AT_location    : 5 byte block: 3 7c 0 0 20 	(DW_OP_addr: 2000007c)
 <1><6b1>: Abbrev Number: 4 (DW_TAG_variable)
    <6b2>   DW_AT_name        : (indirect string, offset: 0x8bab3): oledEventGroup
    <6b6>   DW_AT_decl_file   : 1
    <6b6>   DW_AT_decl_line   : 56
    <6b7>   DW_AT_decl_column : 20
    <6b8>   DW_AT_type        : <0x5f5>
    <6bc>   DW_AT_external    : 1
    <6bc>   DW_AT_location    : 5 byte block: 3 80 0 0 20 	(DW_OP_addr: 20000080)
 <1><6c2>: Abbrev Number: 4 (DW_TAG_variable)
    <6c3>   DW_AT_name        : (indirect string, offset: 0x212a): current_instruction
    <6c7>   DW_AT_decl_file   : 1
    <6c7>   DW_AT_decl_line   : 57
    <6c8>   DW_AT_decl_column : 10
    <6c9>   DW_AT_type        : <0xd0>
    <6cd>   DW_AT_external    : 1
    <6cd>   DW_AT_location    : 5 byte block: 3 84 0 0 20 	(DW_OP_addr: 20000084)
 <1><6d3>: Abbrev Number: 4 (DW_TAG_variable)
    <6d4>   DW_AT_name        : (indirect string, offset: 0x47674): doBlink1
    <6d8>   DW_AT_decl_file   : 1
    <6d8>   DW_AT_decl_line   : 58
    <6d9>   DW_AT_decl_column : 6
    <6da>   DW_AT_type        : <0x6e4>
    <6de>   DW_AT_external    : 1
    <6de>   DW_AT_location    : 5 byte block: 3 88 0 0 20 	(DW_OP_addr: 20000088)
 <1><6e4>: Abbrev Number: 6 (DW_TAG_base_type)
    <6e5>   DW_AT_byte_size   : 1
    <6e6>   DW_AT_encoding    : 2	(boolean)
    <6e7>   DW_AT_name        : (indirect string, offset: 0x6f762): _Bool
 <1><6eb>: Abbrev Number: 4 (DW_TAG_variable)
    <6ec>   DW_AT_name        : (indirect string, offset: 0x4767d): doBlink2
    <6f0>   DW_AT_decl_file   : 1
    <6f0>   DW_AT_decl_line   : 58
    <6f1>   DW_AT_decl_column : 16
    <6f2>   DW_AT_type        : <0x6e4>
    <6f6>   DW_AT_external    : 1
    <6f6>   DW_AT_location    : 5 byte block: 3 89 0 0 20 	(DW_OP_addr: 20000089)
 <1><6fc>: Abbrev Number: 4 (DW_TAG_variable)
    <6fd>   DW_AT_name        : (indirect string, offset: 0x7a53d): blinkState
    <701>   DW_AT_decl_file   : 1
    <701>   DW_AT_decl_line   : 59
    <702>   DW_AT_decl_column : 6
    <703>   DW_AT_type        : <0x6e4>
    <707>   DW_AT_external    : 1
    <707>   DW_AT_location    : 5 byte block: 3 8a 0 0 20 	(DW_OP_addr: 2000008a)
 <1><70d>: Abbrev Number: 4 (DW_TAG_variable)
    <70e>   DW_AT_name        : (indirect string, offset: 0x4302c): lightMutex
    <712>   DW_AT_decl_file   : 1
    <712>   DW_AT_decl_line   : 60
    <713>   DW_AT_decl_column : 19
    <714>   DW_AT_type        : <0x632>
    <718>   DW_AT_external    : 1
    <718>   DW_AT_location    : 5 byte block: 3 8c 0 0 20 	(DW_OP_addr: 2000008c)
 <1><71e>: Abbrev Number: 29 (DW_TAG_variable)
    <71f>   DW_AT_specification: <0x63e>
    <723>   DW_AT_decl_file   : 1
    <723>   DW_AT_decl_line   : 61
    <724>   DW_AT_decl_column : 19
    <725>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><72b>: Abbrev Number: 29 (DW_TAG_variable)
    <72c>   DW_AT_specification: <0x695>
    <730>   DW_AT_decl_file   : 1
    <730>   DW_AT_decl_line   : 62
    <731>   DW_AT_decl_column : 15
    <732>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><738>: Abbrev Number: 4 (DW_TAG_variable)
    <739>   DW_AT_name        : (indirect string, offset: 0x614df): defaultTaskHandle
    <73d>   DW_AT_decl_file   : 1
    <73d>   DW_AT_decl_line   : 66
    <73e>   DW_AT_decl_column : 14
    <73f>   DW_AT_type        : <0x543>
    <743>   DW_AT_external    : 1
    <743>   DW_AT_location    : 5 byte block: 3 f4 0 0 20 	(DW_OP_addr: 200000f4)
 <1><749>: Abbrev Number: 4 (DW_TAG_variable)
    <74a>   DW_AT_name        : (indirect string, offset: 0x6c99b): defaultTask_attributes
    <74e>   DW_AT_decl_file   : 1
    <74e>   DW_AT_decl_line   : 67
    <74f>   DW_AT_decl_column : 22
    <750>   DW_AT_type        : <0x5e5>
    <754>   DW_AT_external    : 1
    <754>   DW_AT_location    : 5 byte block: 3 14 8e 0 8 	(DW_OP_addr: 8008e14)
 <1><75a>: Abbrev Number: 4 (DW_TAG_variable)
    <75b>   DW_AT_name        : (indirect string, offset: 0xa0251): TLHandlerTaskHandle
    <75f>   DW_AT_decl_file   : 1
    <75f>   DW_AT_decl_line   : 73
    <760>   DW_AT_decl_column : 14
    <761>   DW_AT_type        : <0x543>
    <765>   DW_AT_external    : 1
    <765>   DW_AT_location    : 5 byte block: 3 f8 0 0 20 	(DW_OP_addr: 200000f8)
 <1><76b>: Abbrev Number: 4 (DW_TAG_variable)
    <76c>   DW_AT_name        : (indirect string, offset: 0x8de0): TLHandlerTask_attributes
    <770>   DW_AT_decl_file   : 1
    <770>   DW_AT_decl_line   : 74
    <771>   DW_AT_decl_column : 22
    <772>   DW_AT_type        : <0x5e5>
    <776>   DW_AT_external    : 1
    <776>   DW_AT_location    : 5 byte block: 3 38 8e 0 8 	(DW_OP_addr: 8008e38)
 <1><77c>: Abbrev Number: 4 (DW_TAG_variable)
    <77d>   DW_AT_name        : (indirect string, offset: 0xeddf9): PLHandlerTaskHandle
    <781>   DW_AT_decl_file   : 1
    <781>   DW_AT_decl_line   : 80
    <782>   DW_AT_decl_column : 14
    <783>   DW_AT_type        : <0x543>
    <787>   DW_AT_external    : 1
    <787>   DW_AT_location    : 5 byte block: 3 fc 0 0 20 	(DW_OP_addr: 200000fc)
 <1><78d>: Abbrev Number: 4 (DW_TAG_variable)
    <78e>   DW_AT_name        : (indirect string, offset: 0xd531d): PLHandlerTask_attributes
    <792>   DW_AT_decl_file   : 1
    <792>   DW_AT_decl_line   : 81
    <793>   DW_AT_decl_column : 22
    <794>   DW_AT_type        : <0x5e5>
    <798>   DW_AT_external    : 1
    <798>   DW_AT_location    : 5 byte block: 3 5c 8e 0 8 	(DW_OP_addr: 8008e5c)
 <1><79e>: Abbrev Number: 4 (DW_TAG_variable)
    <79f>   DW_AT_name        : (indirect string, offset: 0x1d219): InHandlerTaskHandle
    <7a3>   DW_AT_decl_file   : 1
    <7a3>   DW_AT_decl_line   : 87
    <7a4>   DW_AT_decl_column : 14
    <7a5>   DW_AT_type        : <0x543>
    <7a9>   DW_AT_external    : 1
    <7a9>   DW_AT_location    : 5 byte block: 3 0 1 0 20 	(DW_OP_addr: 20000100)
 <1><7af>: Abbrev Number: 4 (DW_TAG_variable)
    <7b0>   DW_AT_name        : (indirect string, offset: 0x8a825): InHandlerTask_attributes
    <7b4>   DW_AT_decl_file   : 1
    <7b4>   DW_AT_decl_line   : 88
    <7b5>   DW_AT_decl_column : 22
    <7b6>   DW_AT_type        : <0x5e5>
    <7ba>   DW_AT_external    : 1
    <7ba>   DW_AT_location    : 5 byte block: 3 80 8e 0 8 	(DW_OP_addr: 8008e80)
 <1><7c0>: Abbrev Number: 4 (DW_TAG_variable)
    <7c1>   DW_AT_name        : (indirect string, offset: 0xd49e9): blinkTaskHandleHandle
    <7c5>   DW_AT_decl_file   : 1
    <7c5>   DW_AT_decl_line   : 94
    <7c6>   DW_AT_decl_column : 14
    <7c7>   DW_AT_type        : <0x543>
    <7cb>   DW_AT_external    : 1
    <7cb>   DW_AT_location    : 5 byte block: 3 4 1 0 20 	(DW_OP_addr: 20000104)
 <1><7d1>: Abbrev Number: 4 (DW_TAG_variable)
    <7d2>   DW_AT_name        : (indirect string, offset: 0xd986c): blinkTaskHandle_attributes
    <7d6>   DW_AT_decl_file   : 1
    <7d6>   DW_AT_decl_line   : 95
    <7d7>   DW_AT_decl_column : 22
    <7d8>   DW_AT_type        : <0x5e5>
    <7dc>   DW_AT_external    : 1
    <7dc>   DW_AT_location    : 5 byte block: 3 a4 8e 0 8 	(DW_OP_addr: 8008ea4)
 <1><7e2>: Abbrev Number: 4 (DW_TAG_variable)
    <7e3>   DW_AT_name        : (indirect string, offset: 0x273cd): OLHandlerTaskHandle
    <7e7>   DW_AT_decl_file   : 1
    <7e7>   DW_AT_decl_line   : 101
    <7e8>   DW_AT_decl_column : 14
    <7e9>   DW_AT_type        : <0x543>
    <7ed>   DW_AT_external    : 1
    <7ed>   DW_AT_location    : 5 byte block: 3 8 1 0 20 	(DW_OP_addr: 20000108)
 <1><7f3>: Abbrev Number: 4 (DW_TAG_variable)
    <7f4>   DW_AT_name        : (indirect string, offset: 0xf424a): OLHandlerTask_attributes
    <7f8>   DW_AT_decl_file   : 1
    <7f8>   DW_AT_decl_line   : 102
    <7f9>   DW_AT_decl_column : 22
    <7fa>   DW_AT_type        : <0x5e5>
    <7fe>   DW_AT_external    : 1
    <7fe>   DW_AT_location    : 5 byte block: 3 c8 8e 0 8 	(DW_OP_addr: 8008ec8)
 <1><804>: Abbrev Number: 24 (DW_TAG_subprogram)
    <805>   DW_AT_external    : 1
    <805>   DW_AT_name        : (indirect string, offset: 0xb529c): drawBars
    <809>   DW_AT_decl_file   : 12
    <809>   DW_AT_decl_line   : 36
    <80a>   DW_AT_decl_column : 6
    <80a>   DW_AT_prototyped  : 1
    <80a>   DW_AT_declaration : 1
    <80a>   DW_AT_sibling     : <0x814>
 <2><80e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <80f>   DW_AT_type        : <0x115>
 <2><813>: Abbrev Number: 0
 <1><814>: Abbrev Number: 10 (DW_TAG_subprogram)
    <815>   DW_AT_external    : 1
    <815>   DW_AT_name        : (indirect string, offset: 0xc4a21): xQueueGenericSend
    <819>   DW_AT_decl_file   : 10
    <81a>   DW_AT_decl_line   : 650
    <81c>   DW_AT_decl_column : 12
    <81d>   DW_AT_prototyped  : 1
    <81d>   DW_AT_type        : <0xf3>
    <821>   DW_AT_declaration : 1
    <821>   DW_AT_sibling     : <0x83a>
 <2><825>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <826>   DW_AT_type        : <0x61c>
 <2><82a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <82b>   DW_AT_type        : <0x5ef>
 <2><82f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <830>   DW_AT_type        : <0x104>
 <2><834>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <835>   DW_AT_type        : <0xff>
 <2><839>: Abbrev Number: 0
 <1><83a>: Abbrev Number: 10 (DW_TAG_subprogram)
    <83b>   DW_AT_external    : 1
    <83b>   DW_AT_name        : (indirect string, offset: 0x7aaca): xQueueSemaphoreTake
    <83f>   DW_AT_decl_file   : 10
    <840>   DW_AT_decl_line   : 1418
    <842>   DW_AT_decl_column : 12
    <843>   DW_AT_prototyped  : 1
    <843>   DW_AT_type        : <0xf3>
    <847>   DW_AT_declaration : 1
    <847>   DW_AT_sibling     : <0x856>
 <2><84b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <84c>   DW_AT_type        : <0x61c>
 <2><850>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <851>   DW_AT_type        : <0x104>
 <2><855>: Abbrev Number: 0
 <1><856>: Abbrev Number: 30 (DW_TAG_subprogram)
    <857>   DW_AT_external    : 1
    <857>   DW_AT_name        : (indirect string, offset: 0x7642e): drawBarOutlines
    <85b>   DW_AT_decl_file   : 12
    <85b>   DW_AT_decl_line   : 35
    <85c>   DW_AT_decl_column : 6
    <85c>   DW_AT_prototyped  : 1
    <85c>   DW_AT_declaration : 1
 <1><85c>: Abbrev Number: 30 (DW_TAG_subprogram)
    <85d>   DW_AT_external    : 1
    <85d>   DW_AT_name        : (indirect string, offset: 0x6c28e): drawTitles
    <861>   DW_AT_decl_file   : 12
    <861>   DW_AT_decl_line   : 34
    <862>   DW_AT_decl_column : 6
    <862>   DW_AT_prototyped  : 1
    <862>   DW_AT_declaration : 1
 <1><862>: Abbrev Number: 10 (DW_TAG_subprogram)
    <863>   DW_AT_external    : 1
    <863>   DW_AT_name        : (indirect string, offset: 0x393a0): xEventGroupClearBits
    <867>   DW_AT_decl_file   : 9
    <868>   DW_AT_decl_line   : 352
    <86a>   DW_AT_decl_column : 13
    <86b>   DW_AT_prototyped  : 1
    <86b>   DW_AT_type        : <0x60b>
    <86f>   DW_AT_declaration : 1
    <86f>   DW_AT_sibling     : <0x87e>
 <2><873>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <874>   DW_AT_type        : <0x5f5>
 <2><878>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <879>   DW_AT_type        : <0x617>
 <2><87d>: Abbrev Number: 0
 <1><87e>: Abbrev Number: 10 (DW_TAG_subprogram)
    <87f>   DW_AT_external    : 1
    <87f>   DW_AT_name        : (indirect string, offset: 0xa9f8d): HAL_GPIO_ReadPin
    <883>   DW_AT_decl_file   : 6
    <884>   DW_AT_decl_line   : 295
    <886>   DW_AT_decl_column : 19
    <887>   DW_AT_prototyped  : 1
    <887>   DW_AT_type        : <0x1f7>
    <88b>   DW_AT_declaration : 1
    <88b>   DW_AT_sibling     : <0x89a>
 <2><88f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <890>   DW_AT_type        : <0x89a>
 <2><894>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <895>   DW_AT_type        : <0xc4>
 <2><899>: Abbrev Number: 0
 <1><89a>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <89b>   DW_AT_byte_size   : 4
    <89b>   DW_AT_type        : <0x1cf>
 <1><89f>: Abbrev Number: 10 (DW_TAG_subprogram)
    <8a0>   DW_AT_external    : 1
    <8a0>   DW_AT_name        : (indirect string, offset: 0xa3b53): xEventGroupSetBits
    <8a4>   DW_AT_decl_file   : 9
    <8a5>   DW_AT_decl_line   : 485
    <8a7>   DW_AT_decl_column : 13
    <8a8>   DW_AT_prototyped  : 1
    <8a8>   DW_AT_type        : <0x60b>
    <8ac>   DW_AT_declaration : 1
    <8ac>   DW_AT_sibling     : <0x8bb>
 <2><8b0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8b1>   DW_AT_type        : <0x5f5>
 <2><8b5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8b6>   DW_AT_type        : <0x617>
 <2><8ba>: Abbrev Number: 0
 <1><8bb>: Abbrev Number: 31 (DW_TAG_subprogram)
    <8bc>   DW_AT_external    : 1
    <8bc>   DW_AT_name        : (indirect string, offset: 0x9056d): vTaskDelay
    <8c0>   DW_AT_decl_file   : 13
    <8c1>   DW_AT_decl_line   : 758
    <8c3>   DW_AT_decl_column : 6
    <8c4>   DW_AT_prototyped  : 1
    <8c4>   DW_AT_declaration : 1
    <8c4>   DW_AT_sibling     : <0x8ce>
 <2><8c8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c9>   DW_AT_type        : <0x110>
 <2><8cd>: Abbrev Number: 0
 <1><8ce>: Abbrev Number: 10 (DW_TAG_subprogram)
    <8cf>   DW_AT_external    : 1
    <8cf>   DW_AT_name        : (indirect string, offset: 0x66ea6): xEventGroupWaitBits
    <8d3>   DW_AT_decl_file   : 9
    <8d4>   DW_AT_decl_line   : 295
    <8d6>   DW_AT_decl_column : 13
    <8d7>   DW_AT_prototyped  : 1
    <8d7>   DW_AT_type        : <0x60b>
    <8db>   DW_AT_declaration : 1
    <8db>   DW_AT_sibling     : <0x8f9>
 <2><8df>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8e0>   DW_AT_type        : <0x5f5>
 <2><8e4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8e5>   DW_AT_type        : <0x617>
 <2><8e9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8ea>   DW_AT_type        : <0xff>
 <2><8ee>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8ef>   DW_AT_type        : <0xff>
 <2><8f3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8f4>   DW_AT_type        : <0x104>
 <2><8f8>: Abbrev Number: 0
 <1><8f9>: Abbrev Number: 42 (DW_TAG_subprogram)
    <8fa>   DW_AT_external    : 1
    <8fa>   DW_AT_name        : (indirect string, offset: 0x7e97): xTaskGetTickCount
    <8fe>   DW_AT_decl_file   : 13
    <8ff>   DW_AT_decl_line   : 1356
    <901>   DW_AT_decl_column : 12
    <902>   DW_AT_prototyped  : 1
    <902>   DW_AT_type        : <0x104>
    <906>   DW_AT_declaration : 1
 <1><906>: Abbrev Number: 24 (DW_TAG_subprogram)
    <907>   DW_AT_external    : 1
    <907>   DW_AT_name        : (indirect string, offset: 0xd2349): stopBar
    <90b>   DW_AT_decl_file   : 12
    <90b>   DW_AT_decl_line   : 11
    <90c>   DW_AT_decl_column : 6
    <90c>   DW_AT_prototyped  : 1
    <90c>   DW_AT_declaration : 1
    <90c>   DW_AT_sibling     : <0x916>
 <2><910>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <911>   DW_AT_type        : <0xa7>
 <2><915>: Abbrev Number: 0
 <1><916>: Abbrev Number: 24 (DW_TAG_subprogram)
    <917>   DW_AT_external    : 1
    <917>   DW_AT_name        : (indirect string, offset: 0x947af): startBar
    <91b>   DW_AT_decl_file   : 12
    <91b>   DW_AT_decl_line   : 9
    <91c>   DW_AT_decl_column : 6
    <91c>   DW_AT_prototyped  : 1
    <91c>   DW_AT_declaration : 1
    <91c>   DW_AT_sibling     : <0x92b>
 <2><920>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <921>   DW_AT_type        : <0xa7>
 <2><925>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <926>   DW_AT_type        : <0x104>
 <2><92a>: Abbrev Number: 0
 <1><92b>: Abbrev Number: 43 (DW_TAG_subprogram)
    <92c>   DW_AT_external    : 1
    <92c>   DW_AT_name        : (indirect string, offset: 0x723d0): update_instruction
    <930>   DW_AT_decl_file   : 14
    <931>   DW_AT_decl_line   : 9
    <932>   DW_AT_decl_column : 10
    <933>   DW_AT_prototyped  : 1
    <933>   DW_AT_type        : <0xd0>
    <937>   DW_AT_declaration : 1
    <937>   DW_AT_sibling     : <0x94b>
 <2><93b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <93c>   DW_AT_type        : <0xd0>
 <2><940>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <941>   DW_AT_type        : <0xd0>
 <2><945>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <946>   DW_AT_type        : <0x291>
 <2><94a>: Abbrev Number: 0
 <1><94b>: Abbrev Number: 10 (DW_TAG_subprogram)
    <94c>   DW_AT_external    : 1
    <94c>   DW_AT_name        : (indirect string, offset: 0xf28f5): osDelay
    <950>   DW_AT_decl_file   : 8
    <951>   DW_AT_decl_line   : 459
    <953>   DW_AT_decl_column : 12
    <954>   DW_AT_prototyped  : 1
    <954>   DW_AT_type        : <0x537>
    <958>   DW_AT_declaration : 1
    <958>   DW_AT_sibling     : <0x962>
 <2><95c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <95d>   DW_AT_type        : <0xd0>
 <2><961>: Abbrev Number: 0
 <1><962>: Abbrev Number: 10 (DW_TAG_subprogram)
    <963>   DW_AT_external    : 1
    <963>   DW_AT_name        : (indirect string, offset: 0x87ef6): osThreadNew
    <967>   DW_AT_decl_file   : 8
    <968>   DW_AT_decl_line   : 349
    <96a>   DW_AT_decl_column : 14
    <96b>   DW_AT_prototyped  : 1
    <96b>   DW_AT_type        : <0x543>
    <96f>   DW_AT_declaration : 1
    <96f>   DW_AT_sibling     : <0x983>
 <2><973>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <974>   DW_AT_type        : <0x4e9>
 <2><978>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <979>   DW_AT_type        : <0xf1>
 <2><97d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <97e>   DW_AT_type        : <0x983>
 <2><982>: Abbrev Number: 0
 <1><983>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <984>   DW_AT_byte_size   : 4
    <984>   DW_AT_type        : <0x5e5>
 <1><988>: Abbrev Number: 10 (DW_TAG_subprogram)
    <989>   DW_AT_external    : 1
    <989>   DW_AT_name        : (indirect string, offset: 0xbe520): xQueueCreateMutex
    <98d>   DW_AT_decl_file   : 10
    <98e>   DW_AT_decl_line   : 1414
    <990>   DW_AT_decl_column : 15
    <991>   DW_AT_prototyped  : 1
    <991>   DW_AT_type        : <0x61c>
    <995>   DW_AT_declaration : 1
    <995>   DW_AT_sibling     : <0x99f>
 <2><999>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <99a>   DW_AT_type        : <0xb3>
 <2><99e>: Abbrev Number: 0
 <1><99f>: Abbrev Number: 31 (DW_TAG_subprogram)
    <9a0>   DW_AT_external    : 1
    <9a0>   DW_AT_name        : (indirect string, offset: 0x2b833): HAL_GPIO_WritePin
    <9a4>   DW_AT_decl_file   : 6
    <9a5>   DW_AT_decl_line   : 296
    <9a7>   DW_AT_decl_column : 19
    <9a8>   DW_AT_prototyped  : 1
    <9a8>   DW_AT_declaration : 1
    <9a8>   DW_AT_sibling     : <0x9bc>
 <2><9ac>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9ad>   DW_AT_type        : <0x89a>
 <2><9b1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9b2>   DW_AT_type        : <0xc4>
 <2><9b6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9b7>   DW_AT_type        : <0x1f7>
 <2><9bb>: Abbrev Number: 0
 <1><9bc>: Abbrev Number: 44 (DW_TAG_subprogram)
    <9bd>   DW_AT_external    : 1
    <9bd>   DW_AT_name        : (indirect string, offset: 0x15959): xEventGroupCreate
    <9c1>   DW_AT_decl_file   : 9
    <9c2>   DW_AT_decl_line   : 147
    <9c3>   DW_AT_decl_column : 21
    <9c4>   DW_AT_prototyped  : 1
    <9c4>   DW_AT_type        : <0x5f5>
    <9c8>   DW_AT_declaration : 1
 <1><9c8>: Abbrev Number: 20 (DW_TAG_subprogram)
    <9c9>   DW_AT_external    : 1
    <9c9>   DW_AT_name        : (indirect string, offset: 0xa52ca): OLHandler
    <9cd>   DW_AT_decl_file   : 1
    <9cd>   DW_AT_decl_line   : 455
    <9cf>   DW_AT_decl_column : 6
    <9cf>   DW_AT_prototyped  : 1
    <9cf>   DW_AT_low_pc      : 0x8000cec
    <9d3>   DW_AT_high_pc     : 0x178
    <9d7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9d9>   DW_AT_call_all_tail_calls: 1
    <9d9>   DW_AT_sibling     : <0xa80>
 <2><9dd>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <9de>   DW_AT_name        : (indirect string, offset: 0x34ba7): argument
    <9e2>   DW_AT_decl_file   : 1
    <9e2>   DW_AT_decl_line   : 455
    <9e4>   DW_AT_decl_column : 22
    <9e4>   DW_AT_type        : <0xf1>
    <9e8>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><9eb>: Abbrev Number: 11 (DW_TAG_variable)
    <9ec>   DW_AT_name        : (indirect string, offset: 0xc0a3): screenArray
    <9f0>   DW_AT_decl_file   : 1
    <9f0>   DW_AT_decl_line   : 459
    <9f2>   DW_AT_decl_column : 11
    <9f3>   DW_AT_type        : <0xa80>
    <9f7>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><9fa>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <9fb>   DW_AT_low_pc      : 0x8000cfc
    <9ff>   DW_AT_high_pc     : 0x15a
 <3><a03>: Abbrev Number: 11 (DW_TAG_variable)
    <a04>   DW_AT_name        : (indirect string, offset: 0xf900b): current
    <a08>   DW_AT_decl_file   : 1
    <a08>   DW_AT_decl_line   : 465
    <a0a>   DW_AT_decl_column : 16
    <a0b>   DW_AT_type        : <0x104>
    <a0f>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><a12>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <a13>   DW_AT_low_pc      : 0x8000d10
    <a17>   DW_AT_high_pc     : 0x128
 <4><a1b>: Abbrev Number: 32 (DW_TAG_variable)
    <a1c>   DW_AT_name        : i
    <a1e>   DW_AT_decl_file   : 1
    <a1e>   DW_AT_decl_line   : 467
    <a20>   DW_AT_decl_column : 13
    <a21>   DW_AT_type        : <0x2a>
    <a25>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <4><a28>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <a29>   DW_AT_low_pc      : 0x8000d16
    <a2d>   DW_AT_high_pc     : 0x114
 <5><a31>: Abbrev Number: 11 (DW_TAG_variable)
    <a32>   DW_AT_name        : (indirect string, offset: 0xe5a9d): start
    <a36>   DW_AT_decl_file   : 1
    <a36>   DW_AT_decl_line   : 473
    <a38>   DW_AT_decl_column : 18
    <a39>   DW_AT_type        : <0x104>
    <a3d>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <5><a40>: Abbrev Number: 11 (DW_TAG_variable)
    <a41>   DW_AT_name        : (indirect string, offset: 0xd57c): total
    <a45>   DW_AT_decl_file   : 1
    <a45>   DW_AT_decl_line   : 474
    <a47>   DW_AT_decl_column : 18
    <a48>   DW_AT_type        : <0x104>
    <a4c>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <5><a4f>: Abbrev Number: 11 (DW_TAG_variable)
    <a50>   DW_AT_name        : (indirect string, offset: 0xbbc65): elapsed
    <a54>   DW_AT_decl_file   : 1
    <a54>   DW_AT_decl_line   : 475
    <a56>   DW_AT_decl_column : 18
    <a57>   DW_AT_type        : <0x104>
    <a5b>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <5><a5e>: Abbrev Number: 11 (DW_TAG_variable)
    <a5f>   DW_AT_name        : (indirect string, offset: 0x8ebdf): barRatio
    <a63>   DW_AT_decl_file   : 1
    <a63>   DW_AT_decl_line   : 483
    <a65>   DW_AT_decl_column : 13
    <a66>   DW_AT_type        : <0xa90>
    <a6a>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <5><a6d>: Abbrev Number: 32 (DW_TAG_variable)
    <a6e>   DW_AT_name        : top
    <a72>   DW_AT_decl_file   : 1
    <a72>   DW_AT_decl_line   : 487
    <a74>   DW_AT_decl_column : 15
    <a75>   DW_AT_type        : <0xb8>
    <a79>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <5><a7c>: Abbrev Number: 0
 <4><a7d>: Abbrev Number: 0
 <3><a7e>: Abbrev Number: 0
 <2><a7f>: Abbrev Number: 0
 <1><a80>: Abbrev Number: 22 (DW_TAG_array_type)
    <a81>   DW_AT_type        : <0xa7>
    <a85>   DW_AT_sibling     : <0xa90>
 <2><a89>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <a8a>   DW_AT_type        : <0x31>
    <a8e>   DW_AT_upper_bound : 7
 <2><a8f>: Abbrev Number: 0
 <1><a90>: Abbrev Number: 6 (DW_TAG_base_type)
    <a91>   DW_AT_byte_size   : 4
    <a92>   DW_AT_encoding    : 4	(float)
    <a93>   DW_AT_name        : (indirect string, offset: 0xd2c37): float
 <1><a97>: Abbrev Number: 20 (DW_TAG_subprogram)
    <a98>   DW_AT_external    : 1
    <a98>   DW_AT_name        : (indirect string, offset: 0x61454): blinkTask
    <a9c>   DW_AT_decl_file   : 1
    <a9c>   DW_AT_decl_line   : 430
    <a9e>   DW_AT_decl_column : 6
    <a9e>   DW_AT_prototyped  : 1
    <a9e>   DW_AT_low_pc      : 0x8000c48
    <aa2>   DW_AT_high_pc     : 0xa4
    <aa6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <aa8>   DW_AT_call_all_tail_calls: 1
    <aa8>   DW_AT_sibling     : <0xad4>
 <2><aac>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <aad>   DW_AT_name        : (indirect string, offset: 0x34ba7): argument
    <ab1>   DW_AT_decl_file   : 1
    <ab1>   DW_AT_decl_line   : 430
    <ab3>   DW_AT_decl_column : 22
    <ab3>   DW_AT_type        : <0xf1>
    <ab7>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><aba>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <abb>   DW_AT_low_pc      : 0x8000c60
    <abf>   DW_AT_high_pc     : 0x54
 <3><ac3>: Abbrev Number: 11 (DW_TAG_variable)
    <ac4>   DW_AT_name        : (indirect string, offset: 0x723d7): instruction
    <ac8>   DW_AT_decl_file   : 1
    <ac8>   DW_AT_decl_line   : 437
    <aca>   DW_AT_decl_column : 16
    <acb>   DW_AT_type        : <0xd0>
    <acf>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><ad2>: Abbrev Number: 0
 <2><ad3>: Abbrev Number: 0
 <1><ad4>: Abbrev Number: 20 (DW_TAG_subprogram)
    <ad5>   DW_AT_external    : 1
    <ad5>   DW_AT_name        : (indirect string, offset: 0xc9b76): InHandler
    <ad9>   DW_AT_decl_file   : 1
    <ad9>   DW_AT_decl_line   : 380
    <adb>   DW_AT_decl_column : 6
    <adb>   DW_AT_prototyped  : 1
    <adb>   DW_AT_low_pc      : 0x8000b1c
    <adf>   DW_AT_high_pc     : 0x12c
    <ae3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ae5>   DW_AT_call_all_tail_calls: 1
    <ae5>   DW_AT_sibling     : <0xaf8>
 <2><ae9>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <aea>   DW_AT_name        : (indirect string, offset: 0x34ba7): argument
    <aee>   DW_AT_decl_file   : 1
    <aee>   DW_AT_decl_line   : 380
    <af0>   DW_AT_decl_column : 22
    <af0>   DW_AT_type        : <0xf1>
    <af4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><af7>: Abbrev Number: 0
 <1><af8>: Abbrev Number: 20 (DW_TAG_subprogram)
    <af9>   DW_AT_external    : 1
    <af9>   DW_AT_name        : (indirect string, offset: 0xd5e34): PLHandler
    <afd>   DW_AT_decl_file   : 1
    <afd>   DW_AT_decl_line   : 347
    <aff>   DW_AT_decl_column : 6
    <aff>   DW_AT_prototyped  : 1
    <aff>   DW_AT_low_pc      : 0x8000a9c
    <b03>   DW_AT_high_pc     : 0x80
    <b07>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b09>   DW_AT_call_all_tail_calls: 1
    <b09>   DW_AT_sibling     : <0xb3a>
 <2><b0d>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <b0e>   DW_AT_name        : (indirect string, offset: 0x34ba7): argument
    <b12>   DW_AT_decl_file   : 1
    <b12>   DW_AT_decl_line   : 347
    <b14>   DW_AT_decl_column : 22
    <b14>   DW_AT_type        : <0xf1>
    <b18>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b1b>: Abbrev Number: 11 (DW_TAG_variable)
    <b1c>   DW_AT_name        : (indirect string, offset: 0xdd9c4): receivedBits
    <b20>   DW_AT_decl_file   : 1
    <b20>   DW_AT_decl_line   : 352
    <b22>   DW_AT_decl_column : 15
    <b23>   DW_AT_type        : <0x60b>
    <b27>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><b2a>: Abbrev Number: 11 (DW_TAG_variable)
    <b2b>   DW_AT_name        : (indirect string, offset: 0x723d7): instruction
    <b2f>   DW_AT_decl_file   : 1
    <b2f>   DW_AT_decl_line   : 353
    <b31>   DW_AT_decl_column : 12
    <b32>   DW_AT_type        : <0xd0>
    <b36>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><b39>: Abbrev Number: 0
 <1><b3a>: Abbrev Number: 33 (DW_TAG_subprogram)
    <b3b>   DW_AT_external    : 1
    <b3b>   DW_AT_name        : (indirect string, offset: 0xeef92): TLHandler
    <b3f>   DW_AT_decl_file   : 1
    <b3f>   DW_AT_decl_line   : 221
    <b40>   DW_AT_decl_column : 6
    <b40>   DW_AT_prototyped  : 1
    <b40>   DW_AT_low_pc      : 0x8000688
    <b44>   DW_AT_high_pc     : 0x414
    <b48>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b4a>   DW_AT_call_all_tail_calls: 1
    <b4a>   DW_AT_sibling     : <0xbdd>
 <2><b4e>: Abbrev Number: 34 (DW_TAG_formal_parameter)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x34ba7): argument
    <b53>   DW_AT_decl_file   : 1
    <b53>   DW_AT_decl_line   : 221
    <b54>   DW_AT_decl_column : 22
    <b55>   DW_AT_type        : <0xf1>
    <b59>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><b5c>: Abbrev Number: 14 (DW_TAG_variable)
    <b5d>   DW_AT_name        : (indirect string, offset: 0xfb238): State
    <b61>   DW_AT_decl_file   : 1
    <b61>   DW_AT_decl_line   : 225
    <b62>   DW_AT_decl_column : 16
    <b63>   DW_AT_type        : <0x311>
    <b67>   DW_AT_location    : 5 byte block: 3 c 1 0 20 	(DW_OP_addr: 2000010c)
 <2><b6d>: Abbrev Number: 14 (DW_TAG_variable)
    <b6e>   DW_AT_name        : (indirect string, offset: 0xd35b1): NextState
    <b72>   DW_AT_decl_file   : 1
    <b72>   DW_AT_decl_line   : 225
    <b73>   DW_AT_decl_column : 23
    <b74>   DW_AT_type        : <0x311>
    <b78>   DW_AT_location    : 5 byte block: 3 d 1 0 20 	(DW_OP_addr: 2000010d)
 <2><b7e>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <b7f>   DW_AT_low_pc      : 0x8000690
    <b83>   DW_AT_high_pc     : 0x40c
 <3><b87>: Abbrev Number: 14 (DW_TAG_variable)
    <b88>   DW_AT_name        : (indirect string, offset: 0x723d7): instruction
    <b8c>   DW_AT_decl_file   : 1
    <b8c>   DW_AT_decl_line   : 230
    <b8d>   DW_AT_decl_column : 14
    <b8e>   DW_AT_type        : <0xd0>
    <b92>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><b95>: Abbrev Number: 14 (DW_TAG_variable)
    <b96>   DW_AT_name        : (indirect string, offset: 0x4f0a8): elapsedTime
    <b9a>   DW_AT_decl_file   : 1
    <b9a>   DW_AT_decl_line   : 230
    <b9b>   DW_AT_decl_column : 27
    <b9c>   DW_AT_type        : <0xd0>
    <ba0>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><ba3>: Abbrev Number: 14 (DW_TAG_variable)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x726eb): toGreen
    <ba8>   DW_AT_decl_file   : 1
    <ba8>   DW_AT_decl_line   : 231
    <ba9>   DW_AT_decl_column : 10
    <baa>   DW_AT_type        : <0x6e4>
    <bae>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <3><bb1>: Abbrev Number: 14 (DW_TAG_variable)
    <bb2>   DW_AT_name        : (indirect string, offset: 0xdd9c4): receivedBits
    <bb6>   DW_AT_decl_file   : 1
    <bb6>   DW_AT_decl_line   : 232
    <bb7>   DW_AT_decl_column : 17
    <bb8>   DW_AT_type        : <0x60b>
    <bbc>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><bbf>: Abbrev Number: 14 (DW_TAG_variable)
    <bc0>   DW_AT_name        : (indirect string, offset: 0xdf634): xStartTimer
    <bc4>   DW_AT_decl_file   : 1
    <bc4>   DW_AT_decl_line   : 233
    <bc5>   DW_AT_decl_column : 16
    <bc6>   DW_AT_type        : <0x104>
    <bca>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><bcd>: Abbrev Number: 14 (DW_TAG_variable)
    <bce>   DW_AT_name        : (indirect string, offset: 0x8dc37): xEndTimer
    <bd2>   DW_AT_decl_file   : 1
    <bd2>   DW_AT_decl_line   : 233
    <bd3>   DW_AT_decl_column : 29
    <bd4>   DW_AT_type        : <0x104>
    <bd8>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><bdb>: Abbrev Number: 0
 <2><bdc>: Abbrev Number: 0
 <1><bdd>: Abbrev Number: 33 (DW_TAG_subprogram)
    <bde>   DW_AT_external    : 1
    <bde>   DW_AT_name        : (indirect string, offset: 0x3672c): StartDefaultTask
    <be2>   DW_AT_decl_file   : 1
    <be2>   DW_AT_decl_line   : 203
    <be3>   DW_AT_decl_column : 6
    <be3>   DW_AT_prototyped  : 1
    <be3>   DW_AT_low_pc      : 0x8000678
    <be7>   DW_AT_high_pc     : 0x10
    <beb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bed>   DW_AT_call_all_tail_calls: 1
    <bed>   DW_AT_sibling     : <0xc00>
 <2><bf1>: Abbrev Number: 34 (DW_TAG_formal_parameter)
    <bf2>   DW_AT_name        : (indirect string, offset: 0x34ba7): argument
    <bf6>   DW_AT_decl_file   : 1
    <bf6>   DW_AT_decl_line   : 203
    <bf7>   DW_AT_decl_column : 29
    <bf8>   DW_AT_type        : <0xf1>
    <bfc>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><bff>: Abbrev Number: 0
 <1><c00>: Abbrev Number: 45 (DW_TAG_subprogram)
    <c01>   DW_AT_external    : 1
    <c01>   DW_AT_name        : (indirect string, offset: 0xc56a0): MX_FREERTOS_Init
    <c05>   DW_AT_decl_file   : 1
    <c06>   DW_AT_decl_line   : 127
    <c07>   DW_AT_decl_column : 6
    <c08>   DW_AT_prototyped  : 1
    <c08>   DW_AT_low_pc      : 0x80004fc
    <c0c>   DW_AT_high_pc     : 0x17c
    <c10>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c12>   DW_AT_call_all_tail_calls: 1
 <2><c12>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <c13>   DW_AT_low_pc      : 0x8000540
    <c17>   DW_AT_high_pc     : 0x4c
 <3><c1b>: Abbrev Number: 46 (DW_TAG_variable)
    <c1c>   DW_AT_name        : i
    <c1e>   DW_AT_decl_file   : 1
    <c1f>   DW_AT_decl_line   : 140
    <c20>   DW_AT_decl_column : 11
    <c21>   DW_AT_type        : <0x2a>
    <c25>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><c28>: Abbrev Number: 0
 <2><c29>: Abbrev Number: 0
 <1><c2a>: Abbrev Number: 0
  Compilation Unit @ offset 0xc2b:
   Length:        0x46f (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x2c8
   Pointer Size:  4
 <0><c37>: Abbrev Number: 15 (DW_TAG_compile_unit)
    <c38>   DW_AT_producer    : (indirect string, offset: 0xf0eef): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <c3c>   DW_AT_language    : 29	(C11)
    <c3d>   DW_AT_name        : (indirect string, offset: 0xf60c7): ../Core/Src/gpio.c
    <c41>   DW_AT_comp_dir    : (indirect string, offset: 0x2d9c5): /Users/isabellalopiano/STM32CubeIDE/workspace_1.19.0/IS1300Project/Debug
    <c45>   DW_AT_ranges      : 0x49
    <c49>   DW_AT_low_pc      : 0
    <c4d>   DW_AT_stmt_list   : 0xecf
    <c51>   DW_AT_macros      : 0x262dd
 <1><c55>: Abbrev Number: 2 (DW_TAG_base_type)
    <c56>   DW_AT_byte_size   : 1
    <c57>   DW_AT_encoding    : 6	(signed char)
    <c58>   DW_AT_name        : (indirect string, offset: 0x7b40b): signed char
 <1><c5c>: Abbrev Number: 2 (DW_TAG_base_type)
    <c5d>   DW_AT_byte_size   : 1
    <c5e>   DW_AT_encoding    : 8	(unsigned char)
    <c5f>   DW_AT_name        : (indirect string, offset: 0xec982): unsigned char
 <1><c63>: Abbrev Number: 2 (DW_TAG_base_type)
    <c64>   DW_AT_byte_size   : 2
    <c65>   DW_AT_encoding    : 5	(signed)
    <c66>   DW_AT_name        : (indirect string, offset: 0xb61a6): short int
 <1><c6a>: Abbrev Number: 3 (DW_TAG_typedef)
    <c6b>   DW_AT_name        : (indirect string, offset: 0xc864e): __uint16_t
    <c6f>   DW_AT_decl_file   : 2
    <c70>   DW_AT_decl_line   : 57
    <c71>   DW_AT_decl_column : 25
    <c72>   DW_AT_type        : <0xc76>
 <1><c76>: Abbrev Number: 2 (DW_TAG_base_type)
    <c77>   DW_AT_byte_size   : 2
    <c78>   DW_AT_encoding    : 7	(unsigned)
    <c79>   DW_AT_name        : (indirect string, offset: 0xeaf2f): short unsigned int
 <1><c7d>: Abbrev Number: 2 (DW_TAG_base_type)
    <c7e>   DW_AT_byte_size   : 4
    <c7f>   DW_AT_encoding    : 5	(signed)
    <c80>   DW_AT_name        : (indirect string, offset: 0x148bc): long int
 <1><c84>: Abbrev Number: 3 (DW_TAG_typedef)
    <c85>   DW_AT_name        : (indirect string, offset: 0x9c93e): __uint32_t
    <c89>   DW_AT_decl_file   : 2
    <c8a>   DW_AT_decl_line   : 79
    <c8b>   DW_AT_decl_column : 25
    <c8c>   DW_AT_type        : <0xc90>
 <1><c90>: Abbrev Number: 2 (DW_TAG_base_type)
    <c91>   DW_AT_byte_size   : 4
    <c92>   DW_AT_encoding    : 7	(unsigned)
    <c93>   DW_AT_name        : (indirect string, offset: 0x5d678): long unsigned int
 <1><c97>: Abbrev Number: 2 (DW_TAG_base_type)
    <c98>   DW_AT_byte_size   : 8
    <c99>   DW_AT_encoding    : 5	(signed)
    <c9a>   DW_AT_name        : (indirect string, offset: 0x6fced): long long int
 <1><c9e>: Abbrev Number: 2 (DW_TAG_base_type)
    <c9f>   DW_AT_byte_size   : 8
    <ca0>   DW_AT_encoding    : 7	(unsigned)
    <ca1>   DW_AT_name        : (indirect string, offset: 0x3304f): long long unsigned int
 <1><ca5>: Abbrev Number: 16 (DW_TAG_base_type)
    <ca6>   DW_AT_byte_size   : 4
    <ca7>   DW_AT_encoding    : 5	(signed)
    <ca8>   DW_AT_name        : int
 <1><cac>: Abbrev Number: 2 (DW_TAG_base_type)
    <cad>   DW_AT_byte_size   : 4
    <cae>   DW_AT_encoding    : 7	(unsigned)
    <caf>   DW_AT_name        : (indirect string, offset: 0x13e17): unsigned int
 <1><cb3>: Abbrev Number: 3 (DW_TAG_typedef)
    <cb4>   DW_AT_name        : (indirect string, offset: 0xfd65): uint16_t
    <cb8>   DW_AT_decl_file   : 3
    <cb9>   DW_AT_decl_line   : 36
    <cba>   DW_AT_decl_column : 20
    <cbb>   DW_AT_type        : <0xc6a>
 <1><cbf>: Abbrev Number: 3 (DW_TAG_typedef)
    <cc0>   DW_AT_name        : (indirect string, offset: 0xb2056): uint32_t
    <cc4>   DW_AT_decl_file   : 3
    <cc5>   DW_AT_decl_line   : 48
    <cc6>   DW_AT_decl_column : 20
    <cc7>   DW_AT_type        : <0xc84>
 <1><ccb>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <ccc>   DW_AT_type        : <0xcbf>
 <1><cd0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cd1>   DW_AT_byte_size   : 48
    <cd2>   DW_AT_decl_file   : 4
    <cd2>   DW_AT_decl_line   : 531
    <cd4>   DW_AT_decl_column : 9
    <cd4>   DW_AT_sibling     : <0xd5d>
 <2><cd8>: Abbrev Number: 1 (DW_TAG_member)
    <cd9>   DW_AT_name        : (indirect string, offset: 0x185a): MODER
    <cdd>   DW_AT_decl_file   : 4
    <cdd>   DW_AT_decl_line   : 533
    <cdf>   DW_AT_decl_column : 17
    <cdf>   DW_AT_type        : <0xccb>
    <ce3>   DW_AT_data_member_location: 0
 <2><ce4>: Abbrev Number: 1 (DW_TAG_member)
    <ce5>   DW_AT_name        : (indirect string, offset: 0xbdb70): OTYPER
    <ce9>   DW_AT_decl_file   : 4
    <ce9>   DW_AT_decl_line   : 534
    <ceb>   DW_AT_decl_column : 17
    <ceb>   DW_AT_type        : <0xccb>
    <cef>   DW_AT_data_member_location: 4
 <2><cf0>: Abbrev Number: 1 (DW_TAG_member)
    <cf1>   DW_AT_name        : (indirect string, offset: 0xd5686): OSPEEDR
    <cf5>   DW_AT_decl_file   : 4
    <cf5>   DW_AT_decl_line   : 535
    <cf7>   DW_AT_decl_column : 17
    <cf7>   DW_AT_type        : <0xccb>
    <cfb>   DW_AT_data_member_location: 8
 <2><cfc>: Abbrev Number: 1 (DW_TAG_member)
    <cfd>   DW_AT_name        : (indirect string, offset: 0x9f058): PUPDR
    <d01>   DW_AT_decl_file   : 4
    <d01>   DW_AT_decl_line   : 536
    <d03>   DW_AT_decl_column : 17
    <d03>   DW_AT_type        : <0xccb>
    <d07>   DW_AT_data_member_location: 12
 <2><d08>: Abbrev Number: 4 (DW_TAG_member)
    <d09>   DW_AT_name        : IDR
    <d0d>   DW_AT_decl_file   : 4
    <d0d>   DW_AT_decl_line   : 537
    <d0f>   DW_AT_decl_column : 17
    <d0f>   DW_AT_type        : <0xccb>
    <d13>   DW_AT_data_member_location: 16
 <2><d14>: Abbrev Number: 4 (DW_TAG_member)
    <d15>   DW_AT_name        : ODR
    <d19>   DW_AT_decl_file   : 4
    <d19>   DW_AT_decl_line   : 538
    <d1b>   DW_AT_decl_column : 17
    <d1b>   DW_AT_type        : <0xccb>
    <d1f>   DW_AT_data_member_location: 20
 <2><d20>: Abbrev Number: 1 (DW_TAG_member)
    <d21>   DW_AT_name        : (indirect string, offset: 0x9e309): BSRR
    <d25>   DW_AT_decl_file   : 4
    <d25>   DW_AT_decl_line   : 539
    <d27>   DW_AT_decl_column : 17
    <d27>   DW_AT_type        : <0xccb>
    <d2b>   DW_AT_data_member_location: 24
 <2><d2c>: Abbrev Number: 1 (DW_TAG_member)
    <d2d>   DW_AT_name        : (indirect string, offset: 0xd275d): LCKR
    <d31>   DW_AT_decl_file   : 4
    <d31>   DW_AT_decl_line   : 540
    <d33>   DW_AT_decl_column : 17
    <d33>   DW_AT_type        : <0xccb>
    <d37>   DW_AT_data_member_location: 28
 <2><d38>: Abbrev Number: 4 (DW_TAG_member)
    <d39>   DW_AT_name        : AFR
    <d3d>   DW_AT_decl_file   : 4
    <d3d>   DW_AT_decl_line   : 541
    <d3f>   DW_AT_decl_column : 17
    <d3f>   DW_AT_type        : <0xd6d>
    <d43>   DW_AT_data_member_location: 32
 <2><d44>: Abbrev Number: 4 (DW_TAG_member)
    <d45>   DW_AT_name        : BRR
    <d49>   DW_AT_decl_file   : 4
    <d49>   DW_AT_decl_line   : 542
    <d4b>   DW_AT_decl_column : 17
    <d4b>   DW_AT_type        : <0xccb>
    <d4f>   DW_AT_data_member_location: 40
 <2><d50>: Abbrev Number: 1 (DW_TAG_member)
    <d51>   DW_AT_name        : (indirect string, offset: 0x2a7b): ASCR
    <d55>   DW_AT_decl_file   : 4
    <d55>   DW_AT_decl_line   : 543
    <d57>   DW_AT_decl_column : 17
    <d57>   DW_AT_type        : <0xccb>
    <d5b>   DW_AT_data_member_location: 44
 <2><d5c>: Abbrev Number: 0
 <1><d5d>: Abbrev Number: 17 (DW_TAG_array_type)
    <d5e>   DW_AT_type        : <0xccb>
    <d62>   DW_AT_sibling     : <0xd6d>
 <2><d66>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <d67>   DW_AT_type        : <0xcac>
    <d6b>   DW_AT_upper_bound : 1
 <2><d6c>: Abbrev Number: 0
 <1><d6d>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <d6e>   DW_AT_type        : <0xd5d>
 <1><d72>: Abbrev Number: 11 (DW_TAG_typedef)
    <d73>   DW_AT_name        : (indirect string, offset: 0xedf2b): GPIO_TypeDef
    <d77>   DW_AT_decl_file   : 4
    <d77>   DW_AT_decl_line   : 545
    <d79>   DW_AT_decl_column : 3
    <d79>   DW_AT_type        : <0xcd0>
 <1><d7d>: Abbrev Number: 10 (DW_TAG_structure_type)
    <d7e>   DW_AT_byte_size   : 152
    <d7f>   DW_AT_decl_file   : 4
    <d7f>   DW_AT_decl_line   : 685
    <d81>   DW_AT_decl_column : 9
    <d81>   DW_AT_sibling     : <0xf4d>
 <2><d85>: Abbrev Number: 4 (DW_TAG_member)
    <d86>   DW_AT_name        : CR
    <d89>   DW_AT_decl_file   : 4
    <d89>   DW_AT_decl_line   : 687
    <d8b>   DW_AT_decl_column : 17
    <d8b>   DW_AT_type        : <0xccb>
    <d8f>   DW_AT_data_member_location: 0
 <2><d90>: Abbrev Number: 1 (DW_TAG_member)
    <d91>   DW_AT_name        : (indirect string, offset: 0xf618d): ICSCR
    <d95>   DW_AT_decl_file   : 4
    <d95>   DW_AT_decl_line   : 688
    <d97>   DW_AT_decl_column : 17
    <d97>   DW_AT_type        : <0xccb>
    <d9b>   DW_AT_data_member_location: 4
 <2><d9c>: Abbrev Number: 1 (DW_TAG_member)
    <d9d>   DW_AT_name        : (indirect string, offset: 0xf6111): CFGR
    <da1>   DW_AT_decl_file   : 4
    <da1>   DW_AT_decl_line   : 689
    <da3>   DW_AT_decl_column : 17
    <da3>   DW_AT_type        : <0xccb>
    <da7>   DW_AT_data_member_location: 8
 <2><da8>: Abbrev Number: 1 (DW_TAG_member)
    <da9>   DW_AT_name        : (indirect string, offset: 0xf6193): PLLCFGR
    <dad>   DW_AT_decl_file   : 4
    <dad>   DW_AT_decl_line   : 690
    <daf>   DW_AT_decl_column : 17
    <daf>   DW_AT_type        : <0xccb>
    <db3>   DW_AT_data_member_location: 12
 <2><db4>: Abbrev Number: 1 (DW_TAG_member)
    <db5>   DW_AT_name        : (indirect string, offset: 0xf610a): PLLSAI1CFGR
    <db9>   DW_AT_decl_file   : 4
    <db9>   DW_AT_decl_line   : 691
    <dbb>   DW_AT_decl_column : 17
    <dbb>   DW_AT_type        : <0xccb>
    <dbf>   DW_AT_data_member_location: 16
 <2><dc0>: Abbrev Number: 1 (DW_TAG_member)
    <dc1>   DW_AT_name        : (indirect string, offset: 0xf6174): PLLSAI2CFGR
    <dc5>   DW_AT_decl_file   : 4
    <dc5>   DW_AT_decl_line   : 692
    <dc7>   DW_AT_decl_column : 17
    <dc7>   DW_AT_type        : <0xccb>
    <dcb>   DW_AT_data_member_location: 20
 <2><dcc>: Abbrev Number: 1 (DW_TAG_member)
    <dcd>   DW_AT_name        : (indirect string, offset: 0xf607c): CIER
    <dd1>   DW_AT_decl_file   : 4
    <dd1>   DW_AT_decl_line   : 693
    <dd3>   DW_AT_decl_column : 17
    <dd3>   DW_AT_type        : <0xccb>
    <dd7>   DW_AT_data_member_location: 24
 <2><dd8>: Abbrev Number: 1 (DW_TAG_member)
    <dd9>   DW_AT_name        : (indirect string, offset: 0xf6081): CIFR
    <ddd>   DW_AT_decl_file   : 4
    <ddd>   DW_AT_decl_line   : 694
    <ddf>   DW_AT_decl_column : 17
    <ddf>   DW_AT_type        : <0xccb>
    <de3>   DW_AT_data_member_location: 28
 <2><de4>: Abbrev Number: 1 (DW_TAG_member)
    <de5>   DW_AT_name        : (indirect string, offset: 0xf6077): CICR
    <de9>   DW_AT_decl_file   : 4
    <de9>   DW_AT_decl_line   : 695
    <deb>   DW_AT_decl_column : 17
    <deb>   DW_AT_type        : <0xccb>
    <def>   DW_AT_data_member_location: 32
 <2><df0>: Abbrev Number: 1 (DW_TAG_member)
    <df1>   DW_AT_name        : (indirect string, offset: 0xf61ec): RESERVED0
    <df5>   DW_AT_decl_file   : 4
    <df5>   DW_AT_decl_line   : 696
    <df7>   DW_AT_decl_column : 17
    <df7>   DW_AT_type        : <0xcbf>
    <dfb>   DW_AT_data_member_location: 36
 <2><dfc>: Abbrev Number: 1 (DW_TAG_member)
    <dfd>   DW_AT_name        : (indirect string, offset: 0xf61ac): AHB1RSTR
    <e01>   DW_AT_decl_file   : 4
    <e01>   DW_AT_decl_line   : 697
    <e03>   DW_AT_decl_column : 17
    <e03>   DW_AT_type        : <0xccb>
    <e07>   DW_AT_data_member_location: 40
 <2><e08>: Abbrev Number: 1 (DW_TAG_member)
    <e09>   DW_AT_name        : (indirect string, offset: 0xf60be): AHB2RSTR
    <e0d>   DW_AT_decl_file   : 4
    <e0d>   DW_AT_decl_line   : 698
    <e0f>   DW_AT_decl_column : 17
    <e0f>   DW_AT_type        : <0xccb>
    <e13>   DW_AT_data_member_location: 44
 <2><e14>: Abbrev Number: 1 (DW_TAG_member)
    <e15>   DW_AT_name        : (indirect string, offset: 0xf6101): AHB3RSTR
    <e19>   DW_AT_decl_file   : 4
    <e19>   DW_AT_decl_line   : 699
    <e1b>   DW_AT_decl_column : 17
    <e1b>   DW_AT_type        : <0xccb>
    <e1f>   DW_AT_data_member_location: 48
 <2><e20>: Abbrev Number: 1 (DW_TAG_member)
    <e21>   DW_AT_name        : (indirect string, offset: 0xf61f6): RESERVED1
    <e25>   DW_AT_decl_file   : 4
    <e25>   DW_AT_decl_line   : 700
    <e27>   DW_AT_decl_column : 17
    <e27>   DW_AT_type        : <0xcbf>
    <e2b>   DW_AT_data_member_location: 52
 <2><e2c>: Abbrev Number: 1 (DW_TAG_member)
    <e2d>   DW_AT_name        : (indirect string, offset: 0xf60da): APB1RSTR1
    <e31>   DW_AT_decl_file   : 4
    <e31>   DW_AT_decl_line   : 701
    <e33>   DW_AT_decl_column : 17
    <e33>   DW_AT_type        : <0xccb>
    <e37>   DW_AT_data_member_location: 56
 <2><e38>: Abbrev Number: 1 (DW_TAG_member)
    <e39>   DW_AT_name        : (indirect string, offset: 0xf60e4): APB1RSTR2
    <e3d>   DW_AT_decl_file   : 4
    <e3d>   DW_AT_decl_line   : 702
    <e3f>   DW_AT_decl_column : 17
    <e3f>   DW_AT_type        : <0xccb>
    <e43>   DW_AT_data_member_location: 60
 <2><e44>: Abbrev Number: 1 (DW_TAG_member)
    <e45>   DW_AT_name        : (indirect string, offset: 0xf6120): APB2RSTR
    <e49>   DW_AT_decl_file   : 4
    <e49>   DW_AT_decl_line   : 703
    <e4b>   DW_AT_decl_column : 17
    <e4b>   DW_AT_type        : <0xccb>
    <e4f>   DW_AT_data_member_location: 64
 <2><e50>: Abbrev Number: 1 (DW_TAG_member)
    <e51>   DW_AT_name        : (indirect string, offset: 0xf6200): RESERVED2
    <e55>   DW_AT_decl_file   : 4
    <e55>   DW_AT_decl_line   : 704
    <e57>   DW_AT_decl_column : 17
    <e57>   DW_AT_type        : <0xcbf>
    <e5b>   DW_AT_data_member_location: 68
 <2><e5c>: Abbrev Number: 1 (DW_TAG_member)
    <e5d>   DW_AT_name        : (indirect string, offset: 0xf60ae): AHB1ENR
    <e61>   DW_AT_decl_file   : 4
    <e61>   DW_AT_decl_line   : 705
    <e63>   DW_AT_decl_column : 17
    <e63>   DW_AT_type        : <0xccb>
    <e67>   DW_AT_data_member_location: 72
 <2><e68>: Abbrev Number: 1 (DW_TAG_member)
    <e69>   DW_AT_name        : (indirect string, offset: 0xf60f3): AHB2ENR
    <e6d>   DW_AT_decl_file   : 4
    <e6d>   DW_AT_decl_line   : 706
    <e6f>   DW_AT_decl_column : 17
    <e6f>   DW_AT_type        : <0xccb>
    <e73>   DW_AT_data_member_location: 76
 <2><e74>: Abbrev Number: 1 (DW_TAG_member)
    <e75>   DW_AT_name        : (indirect string, offset: 0xf6129): AHB3ENR
    <e79>   DW_AT_decl_file   : 4
    <e79>   DW_AT_decl_line   : 707
    <e7b>   DW_AT_decl_column : 17
    <e7b>   DW_AT_type        : <0xccb>
    <e7f>   DW_AT_data_member_location: 80
 <2><e80>: Abbrev Number: 1 (DW_TAG_member)
    <e81>   DW_AT_name        : (indirect string, offset: 0xf620a): RESERVED3
    <e85>   DW_AT_decl_file   : 4
    <e85>   DW_AT_decl_line   : 708
    <e87>   DW_AT_decl_column : 17
    <e87>   DW_AT_type        : <0xcbf>
    <e8b>   DW_AT_data_member_location: 84
 <2><e8c>: Abbrev Number: 1 (DW_TAG_member)
    <e8d>   DW_AT_name        : (indirect string, offset: 0xf6086): APB1ENR1
    <e91>   DW_AT_decl_file   : 4
    <e91>   DW_AT_decl_line   : 709
    <e93>   DW_AT_decl_column : 17
    <e93>   DW_AT_type        : <0xccb>
    <e97>   DW_AT_data_member_location: 88
 <2><e98>: Abbrev Number: 1 (DW_TAG_member)
    <e99>   DW_AT_name        : (indirect string, offset: 0xf608f): APB1ENR2
    <e9d>   DW_AT_decl_file   : 4
    <e9d>   DW_AT_decl_line   : 710
    <e9f>   DW_AT_decl_column : 17
    <e9f>   DW_AT_type        : <0xccb>
    <ea3>   DW_AT_data_member_location: 92
 <2><ea4>: Abbrev Number: 1 (DW_TAG_member)
    <ea5>   DW_AT_name        : (indirect string, offset: 0xf60b6): APB2ENR
    <ea9>   DW_AT_decl_file   : 4
    <ea9>   DW_AT_decl_line   : 711
    <eab>   DW_AT_decl_column : 17
    <eab>   DW_AT_type        : <0xccb>
    <eaf>   DW_AT_data_member_location: 96
 <2><eb0>: Abbrev Number: 1 (DW_TAG_member)
    <eb1>   DW_AT_name        : (indirect string, offset: 0xf6156): RESERVED4
    <eb5>   DW_AT_decl_file   : 4
    <eb5>   DW_AT_decl_line   : 712
    <eb7>   DW_AT_decl_column : 17
    <eb7>   DW_AT_type        : <0xcbf>
    <ebb>   DW_AT_data_member_location: 100
 <2><ebc>: Abbrev Number: 1 (DW_TAG_member)
    <ebd>   DW_AT_name        : (indirect string, offset: 0xf613b): AHB1SMENR
    <ec1>   DW_AT_decl_file   : 4
    <ec1>   DW_AT_decl_line   : 713
    <ec3>   DW_AT_decl_column : 17
    <ec3>   DW_AT_type        : <0xccb>
    <ec7>   DW_AT_data_member_location: 104
 <2><ec8>: Abbrev Number: 1 (DW_TAG_member)
    <ec9>   DW_AT_name        : (indirect string, offset: 0xf61d6): AHB2SMENR
    <ecd>   DW_AT_decl_file   : 4
    <ecd>   DW_AT_decl_line   : 714
    <ecf>   DW_AT_decl_column : 17
    <ecf>   DW_AT_type        : <0xccb>
    <ed3>   DW_AT_data_member_location: 108
 <2><ed4>: Abbrev Number: 1 (DW_TAG_member)
    <ed5>   DW_AT_name        : (indirect string, offset: 0xf6116): AHB3SMENR
    <ed9>   DW_AT_decl_file   : 4
    <ed9>   DW_AT_decl_line   : 715
    <edb>   DW_AT_decl_column : 17
    <edb>   DW_AT_type        : <0xccb>
    <edf>   DW_AT_data_member_location: 112
 <2><ee0>: Abbrev Number: 1 (DW_TAG_member)
    <ee1>   DW_AT_name        : (indirect string, offset: 0xf6214): RESERVED5
    <ee5>   DW_AT_decl_file   : 4
    <ee5>   DW_AT_decl_line   : 716
    <ee7>   DW_AT_decl_column : 17
    <ee7>   DW_AT_type        : <0xcbf>
    <eeb>   DW_AT_data_member_location: 116
 <2><eec>: Abbrev Number: 1 (DW_TAG_member)
    <eed>   DW_AT_name        : (indirect string, offset: 0xf6098): APB1SMENR1
    <ef1>   DW_AT_decl_file   : 4
    <ef1>   DW_AT_decl_line   : 717
    <ef3>   DW_AT_decl_column : 17
    <ef3>   DW_AT_type        : <0xccb>
    <ef7>   DW_AT_data_member_location: 120
 <2><ef8>: Abbrev Number: 1 (DW_TAG_member)
    <ef9>   DW_AT_name        : (indirect string, offset: 0xf60a3): APB1SMENR2
    <efd>   DW_AT_decl_file   : 4
    <efd>   DW_AT_decl_line   : 718
    <eff>   DW_AT_decl_column : 17
    <eff>   DW_AT_type        : <0xccb>
    <f03>   DW_AT_data_member_location: 124
 <2><f04>: Abbrev Number: 1 (DW_TAG_member)
    <f05>   DW_AT_name        : (indirect string, offset: 0xf61c5): APB2SMENR
    <f09>   DW_AT_decl_file   : 4
    <f09>   DW_AT_decl_line   : 719
    <f0b>   DW_AT_decl_column : 17
    <f0b>   DW_AT_type        : <0xccb>
    <f0f>   DW_AT_data_member_location: 128
 <2><f10>: Abbrev Number: 1 (DW_TAG_member)
    <f11>   DW_AT_name        : (indirect string, offset: 0xf621e): RESERVED6
    <f15>   DW_AT_decl_file   : 4
    <f15>   DW_AT_decl_line   : 720
    <f17>   DW_AT_decl_column : 17
    <f17>   DW_AT_type        : <0xcbf>
    <f1b>   DW_AT_data_member_location: 132
 <2><f1c>: Abbrev Number: 1 (DW_TAG_member)
    <f1d>   DW_AT_name        : (indirect string, offset: 0xf60fb): CCIPR
    <f21>   DW_AT_decl_file   : 4
    <f21>   DW_AT_decl_line   : 721
    <f23>   DW_AT_decl_column : 17
    <f23>   DW_AT_type        : <0xccb>
    <f27>   DW_AT_data_member_location: 136
 <2><f28>: Abbrev Number: 1 (DW_TAG_member)
    <f29>   DW_AT_name        : (indirect string, offset: 0xf6228): RESERVED7
    <f2d>   DW_AT_decl_file   : 4
    <f2d>   DW_AT_decl_line   : 722
    <f2f>   DW_AT_decl_column : 17
    <f2f>   DW_AT_type        : <0xcbf>
    <f33>   DW_AT_data_member_location: 140
 <2><f34>: Abbrev Number: 1 (DW_TAG_member)
    <f35>   DW_AT_name        : (indirect string, offset: 0xf60ee): BDCR
    <f39>   DW_AT_decl_file   : 4
    <f39>   DW_AT_decl_line   : 723
    <f3b>   DW_AT_decl_column : 17
    <f3b>   DW_AT_type        : <0xccb>
    <f3f>   DW_AT_data_member_location: 144
 <2><f40>: Abbrev Number: 4 (DW_TAG_member)
    <f41>   DW_AT_name        : CSR
    <f45>   DW_AT_decl_file   : 4
    <f45>   DW_AT_decl_line   : 724
    <f47>   DW_AT_decl_column : 17
    <f47>   DW_AT_type        : <0xccb>
    <f4b>   DW_AT_data_member_location: 148
 <2><f4c>: Abbrev Number: 0
 <1><f4d>: Abbrev Number: 11 (DW_TAG_typedef)
    <f4e>   DW_AT_name        : (indirect string, offset: 0xf6145): RCC_TypeDef
    <f52>   DW_AT_decl_file   : 4
    <f52>   DW_AT_decl_line   : 725
    <f54>   DW_AT_decl_column : 3
    <f54>   DW_AT_type        : <0xd7d>
 <1><f58>: Abbrev Number: 2 (DW_TAG_base_type)
    <f59>   DW_AT_byte_size   : 8
    <f5a>   DW_AT_encoding    : 4	(float)
    <f5b>   DW_AT_name        : (indirect string, offset: 0x165fd): long double
 <1><f5f>: Abbrev Number: 19 (DW_TAG_structure_type)
    <f60>   DW_AT_byte_size   : 20
    <f61>   DW_AT_decl_file   : 5
    <f62>   DW_AT_decl_line   : 46
    <f63>   DW_AT_decl_column : 9
    <f64>   DW_AT_sibling     : <0xfa2>
 <2><f68>: Abbrev Number: 20 (DW_TAG_member)
    <f69>   DW_AT_name        : Pin
    <f6d>   DW_AT_decl_file   : 5
    <f6e>   DW_AT_decl_line   : 48
    <f6f>   DW_AT_decl_column : 12
    <f70>   DW_AT_type        : <0xcbf>
    <f74>   DW_AT_data_member_location: 0
 <2><f75>: Abbrev Number: 7 (DW_TAG_member)
    <f76>   DW_AT_name        : (indirect string, offset: 0xf94c9): Mode
    <f7a>   DW_AT_decl_file   : 5
    <f7a>   DW_AT_decl_line   : 51
    <f7b>   DW_AT_decl_column : 12
    <f7b>   DW_AT_type        : <0xcbf>
    <f7f>   DW_AT_data_member_location: 4
 <2><f80>: Abbrev Number: 7 (DW_TAG_member)
    <f81>   DW_AT_name        : (indirect string, offset: 0xf6151): Pull
    <f85>   DW_AT_decl_file   : 5
    <f85>   DW_AT_decl_line   : 54
    <f86>   DW_AT_decl_column : 12
    <f86>   DW_AT_type        : <0xcbf>
    <f8a>   DW_AT_data_member_location: 8
 <2><f8b>: Abbrev Number: 7 (DW_TAG_member)
    <f8c>   DW_AT_name        : (indirect string, offset: 0xf6160): Speed
    <f90>   DW_AT_decl_file   : 5
    <f90>   DW_AT_decl_line   : 57
    <f91>   DW_AT_decl_column : 12
    <f91>   DW_AT_type        : <0xcbf>
    <f95>   DW_AT_data_member_location: 12
 <2><f96>: Abbrev Number: 7 (DW_TAG_member)
    <f97>   DW_AT_name        : (indirect string, offset: 0xf6131): Alternate
    <f9b>   DW_AT_decl_file   : 5
    <f9b>   DW_AT_decl_line   : 60
    <f9c>   DW_AT_decl_column : 12
    <f9c>   DW_AT_type        : <0xcbf>
    <fa0>   DW_AT_data_member_location: 16
 <2><fa1>: Abbrev Number: 0
 <1><fa2>: Abbrev Number: 3 (DW_TAG_typedef)
    <fa3>   DW_AT_name        : (indirect string, offset: 0xf619b): GPIO_InitTypeDef
    <fa7>   DW_AT_decl_file   : 5
    <fa8>   DW_AT_decl_line   : 62
    <fa9>   DW_AT_decl_column : 3
    <faa>   DW_AT_type        : <0xf5f>
 <1><fae>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <faf>   DW_AT_encoding    : 7	(unsigned)
    <fb0>   DW_AT_byte_size   : 1
    <fb1>   DW_AT_type        : <0xc5c>
    <fb5>   DW_AT_decl_file   : 5
    <fb6>   DW_AT_decl_line   : 68
    <fb7>   DW_AT_decl_column : 1
    <fb8>   DW_AT_sibling     : <0xfc9>
 <2><fbc>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fbd>   DW_AT_name        : (indirect string, offset: 0x32a65): GPIO_PIN_RESET
    <fc1>   DW_AT_const_value : 0
 <2><fc2>: Abbrev Number: 12 (DW_TAG_enumerator)
    <fc3>   DW_AT_name        : (indirect string, offset: 0x3d845): GPIO_PIN_SET
    <fc7>   DW_AT_const_value : 1
 <2><fc8>: Abbrev Number: 0
 <1><fc9>: Abbrev Number: 3 (DW_TAG_typedef)
    <fca>   DW_AT_name        : (indirect string, offset: 0xf0d29): GPIO_PinState
    <fce>   DW_AT_decl_file   : 5
    <fcf>   DW_AT_decl_line   : 71
    <fd0>   DW_AT_decl_column : 3
    <fd1>   DW_AT_type        : <0xfae>
 <1><fd5>: Abbrev Number: 13 (DW_TAG_subprogram)
    <fd6>   DW_AT_external    : 1
    <fd6>   DW_AT_name        : (indirect string, offset: 0xf6166): HAL_GPIO_Init
    <fda>   DW_AT_decl_file   : 5
    <fda>   DW_AT_decl_line   : 283
    <fdc>   DW_AT_decl_column : 19
    <fdc>   DW_AT_prototyped  : 1
    <fdc>   DW_AT_declaration : 1
    <fdc>   DW_AT_sibling     : <0xfeb>
 <2><fe0>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <fe1>   DW_AT_type        : <0xfeb>
 <2><fe5>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <fe6>   DW_AT_type        : <0xff0>
 <2><fea>: Abbrev Number: 0
 <1><feb>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <fec>   DW_AT_byte_size   : 4
    <fec>   DW_AT_type        : <0xd72>
 <1><ff0>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <ff1>   DW_AT_byte_size   : 4
    <ff1>   DW_AT_type        : <0xfa2>
 <1><ff5>: Abbrev Number: 13 (DW_TAG_subprogram)
    <ff6>   DW_AT_external    : 1
    <ff6>   DW_AT_name        : (indirect string, offset: 0x2b833): HAL_GPIO_WritePin
    <ffa>   DW_AT_decl_file   : 5
    <ffa>   DW_AT_decl_line   : 296
    <ffc>   DW_AT_decl_column : 19
    <ffc>   DW_AT_prototyped  : 1
    <ffc>   DW_AT_declaration : 1
    <ffc>   DW_AT_sibling     : <0x1010>
 <2><1000>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1001>   DW_AT_type        : <0xfeb>
