Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x974 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 25 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xefb47): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xa6147): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x2d503): /Users/isabellalopiano/STM32CubeIDE/workspace_1.19.0/IS1300Project/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 26 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 5 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0x13cd7): unsigned int
 <1><38>: Abbrev Number: 5 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x6f1bd): long long int
 <1><3f>: Abbrev Number: 5 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 8
    <41>   DW_AT_encoding    : 4	(float)
    <42>   DW_AT_name        : (indirect string, offset: 0x16408): long double
 <1><46>: Abbrev Number: 5 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 1
    <48>   DW_AT_encoding    : 6	(signed char)
    <49>   DW_AT_name        : (indirect string, offset: 0x7a840): signed char
 <1><4d>: Abbrev Number: 5 (DW_TAG_base_type)
    <4e>   DW_AT_byte_size   : 1
    <4f>   DW_AT_encoding    : 8	(unsigned char)
    <50>   DW_AT_name        : (indirect string, offset: 0xeb588): unsigned char
 <1><54>: Abbrev Number: 5 (DW_TAG_base_type)
    <55>   DW_AT_byte_size   : 2
    <56>   DW_AT_encoding    : 5	(signed)
    <57>   DW_AT_name        : (indirect string, offset: 0xb50ea): short int
 <1><5b>: Abbrev Number: 2 (DW_TAG_typedef)
    <5c>   DW_AT_name        : (indirect string, offset: 0xc736f): __uint16_t
    <60>   DW_AT_decl_file   : 2
    <61>   DW_AT_decl_line   : 57
    <62>   DW_AT_decl_column : 25
    <63>   DW_AT_type        : <0x67>
 <1><67>: Abbrev Number: 5 (DW_TAG_base_type)
    <68>   DW_AT_byte_size   : 2
    <69>   DW_AT_encoding    : 7	(unsigned)
    <6a>   DW_AT_name        : (indirect string, offset: 0xe9b0f): short unsigned int
 <1><6e>: Abbrev Number: 5 (DW_TAG_base_type)
    <6f>   DW_AT_byte_size   : 4
    <70>   DW_AT_encoding    : 5	(signed)
    <71>   DW_AT_name        : (indirect string, offset: 0x14780): long int
 <1><75>: Abbrev Number: 2 (DW_TAG_typedef)
    <76>   DW_AT_name        : (indirect string, offset: 0x9b9ae): __uint32_t
    <7a>   DW_AT_decl_file   : 2
    <7b>   DW_AT_decl_line   : 79
    <7c>   DW_AT_decl_column : 25
    <7d>   DW_AT_type        : <0x81>
 <1><81>: Abbrev Number: 5 (DW_TAG_base_type)
    <82>   DW_AT_byte_size   : 4
    <83>   DW_AT_encoding    : 7	(unsigned)
    <84>   DW_AT_name        : (indirect string, offset: 0x5cccb): long unsigned int
 <1><88>: Abbrev Number: 5 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 7	(unsigned)
    <8b>   DW_AT_name        : (indirect string, offset: 0x32a4c): long long unsigned int
 <1><8f>: Abbrev Number: 2 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0xfcd2): uint16_t
    <94>   DW_AT_decl_file   : 3
    <95>   DW_AT_decl_line   : 36
    <96>   DW_AT_decl_column : 20
    <97>   DW_AT_type        : <0x5b>
 <1><9b>: Abbrev Number: 2 (DW_TAG_typedef)
    <9c>   DW_AT_name        : (indirect string, offset: 0xb0ff0): uint32_t
    <a0>   DW_AT_decl_file   : 3
    <a1>   DW_AT_decl_line   : 48
    <a2>   DW_AT_decl_column : 20
    <a3>   DW_AT_type        : <0x75>
 <1><a7>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <a8>   DW_AT_type        : <0x9b>
 <1><ac>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <ad>   DW_AT_byte_size   : 4
    <ad>   DW_AT_type        : <0xb1>
 <1><b1>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <b2>   DW_AT_prototyped  : 1
    <b2>   DW_AT_sibling     : <0xbc>
 <2><b6>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <b7>   DW_AT_type        : <0xbc>
 <2><bb>: Abbrev Number: 0
 <1><bc>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <bd>   DW_AT_byte_size   : 4
 <1><be>: Abbrev Number: 2 (DW_TAG_typedef)
    <bf>   DW_AT_name        : (indirect string, offset: 0xf9c87): BaseType_t
    <c3>   DW_AT_decl_file   : 4
    <c4>   DW_AT_decl_line   : 56
    <c5>   DW_AT_decl_column : 14
    <c6>   DW_AT_type        : <0x6e>
 <1><ca>: Abbrev Number: 14 (DW_TAG_const_type)
    <cb>   DW_AT_type        : <0xbe>
 <1><cf>: Abbrev Number: 2 (DW_TAG_typedef)
    <d0>   DW_AT_name        : (indirect string, offset: 0x85b9e): TickType_t
    <d4>   DW_AT_decl_file   : 4
    <d5>   DW_AT_decl_line   : 63
    <d6>   DW_AT_decl_column : 19
    <d7>   DW_AT_type        : <0x9b>
 <1><db>: Abbrev Number: 14 (DW_TAG_const_type)
    <dc>   DW_AT_type        : <0xcf>
 <1><e0>: Abbrev Number: 5 (DW_TAG_base_type)
    <e1>   DW_AT_byte_size   : 1
    <e2>   DW_AT_encoding    : 8	(unsigned char)
    <e3>   DW_AT_name        : (indirect string, offset: 0x4e649): char
 <1><e7>: Abbrev Number: 14 (DW_TAG_const_type)
    <e8>   DW_AT_type        : <0xe0>
 <1><ec>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <ed>   DW_AT_byte_size   : 4
    <ed>   DW_AT_type        : <0xe7>
 <1><f1>: Abbrev Number: 29 (DW_TAG_structure_type)
    <f2>   DW_AT_byte_size   : 48
    <f3>   DW_AT_decl_file   : 5
    <f4>   DW_AT_decl_line   : 531
    <f6>   DW_AT_decl_column : 9
    <f7>   DW_AT_sibling     : <0x180>
 <2><fb>: Abbrev Number: 11 (DW_TAG_member)
    <fc>   DW_AT_name        : (indirect string, offset: 0x1851): MODER
    <100>   DW_AT_decl_file   : 5
    <100>   DW_AT_decl_line   : 533
    <102>   DW_AT_decl_column : 17
    <102>   DW_AT_type        : <0xa7>
    <106>   DW_AT_data_member_location: 0
 <2><107>: Abbrev Number: 11 (DW_TAG_member)
    <108>   DW_AT_name        : (indirect string, offset: 0xbc9fe): OTYPER
    <10c>   DW_AT_decl_file   : 5
    <10c>   DW_AT_decl_line   : 534
    <10e>   DW_AT_decl_column : 17
    <10e>   DW_AT_type        : <0xa7>
    <112>   DW_AT_data_member_location: 4
 <2><113>: Abbrev Number: 11 (DW_TAG_member)
    <114>   DW_AT_name        : (indirect string, offset: 0xd42e5): OSPEEDR
    <118>   DW_AT_decl_file   : 5
    <118>   DW_AT_decl_line   : 535
    <11a>   DW_AT_decl_column : 17
    <11a>   DW_AT_type        : <0xa7>
    <11e>   DW_AT_data_member_location: 8
 <2><11f>: Abbrev Number: 11 (DW_TAG_member)
    <120>   DW_AT_name        : (indirect string, offset: 0x9e107): PUPDR
    <124>   DW_AT_decl_file   : 5
    <124>   DW_AT_decl_line   : 536
    <126>   DW_AT_decl_column : 17
    <126>   DW_AT_type        : <0xa7>
    <12a>   DW_AT_data_member_location: 12
 <2><12b>: Abbrev Number: 18 (DW_TAG_member)
    <12c>   DW_AT_name        : IDR
    <130>   DW_AT_decl_file   : 5
    <130>   DW_AT_decl_line   : 537
    <132>   DW_AT_decl_column : 17
    <132>   DW_AT_type        : <0xa7>
    <136>   DW_AT_data_member_location: 16
 <2><137>: Abbrev Number: 18 (DW_TAG_member)
    <138>   DW_AT_name        : ODR
    <13c>   DW_AT_decl_file   : 5
    <13c>   DW_AT_decl_line   : 538
    <13e>   DW_AT_decl_column : 17
    <13e>   DW_AT_type        : <0xa7>
    <142>   DW_AT_data_member_location: 20
 <2><143>: Abbrev Number: 11 (DW_TAG_member)
    <144>   DW_AT_name        : (indirect string, offset: 0x9d3ba): BSRR
    <148>   DW_AT_decl_file   : 5
    <148>   DW_AT_decl_line   : 539
    <14a>   DW_AT_decl_column : 17
    <14a>   DW_AT_type        : <0xa7>
    <14e>   DW_AT_data_member_location: 24
 <2><14f>: Abbrev Number: 11 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0xd13dc): LCKR
    <154>   DW_AT_decl_file   : 5
    <154>   DW_AT_decl_line   : 540
    <156>   DW_AT_decl_column : 17
    <156>   DW_AT_type        : <0xa7>
    <15a>   DW_AT_data_member_location: 28
 <2><15b>: Abbrev Number: 18 (DW_TAG_member)
    <15c>   DW_AT_name        : AFR
    <160>   DW_AT_decl_file   : 5
    <160>   DW_AT_decl_line   : 541
    <162>   DW_AT_decl_column : 17
    <162>   DW_AT_type        : <0x190>
    <166>   DW_AT_data_member_location: 32
 <2><167>: Abbrev Number: 18 (DW_TAG_member)
    <168>   DW_AT_name        : BRR
    <16c>   DW_AT_decl_file   : 5
    <16c>   DW_AT_decl_line   : 542
    <16e>   DW_AT_decl_column : 17
    <16e>   DW_AT_type        : <0xa7>
    <172>   DW_AT_data_member_location: 40
 <2><173>: Abbrev Number: 11 (DW_TAG_member)
    <174>   DW_AT_name        : (indirect string, offset: 0x2a58): ASCR
    <178>   DW_AT_decl_file   : 5
    <178>   DW_AT_decl_line   : 543
    <17a>   DW_AT_decl_column : 17
    <17a>   DW_AT_type        : <0xa7>
    <17e>   DW_AT_data_member_location: 44
 <2><17f>: Abbrev Number: 0
 <1><180>: Abbrev Number: 30 (DW_TAG_array_type)
    <181>   DW_AT_type        : <0xa7>
    <185>   DW_AT_sibling     : <0x190>
 <2><189>: Abbrev Number: 31 (DW_TAG_subrange_type)
    <18a>   DW_AT_type        : <0x31>
    <18e>   DW_AT_upper_bound : 1
 <2><18f>: Abbrev Number: 0
 <1><190>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <191>   DW_AT_type        : <0x180>
 <1><195>: Abbrev Number: 32 (DW_TAG_typedef)
    <196>   DW_AT_name        : (indirect string, offset: 0xecb85): GPIO_TypeDef
    <19a>   DW_AT_decl_file   : 5
    <19b>   DW_AT_decl_line   : 545
    <19d>   DW_AT_decl_column : 3
    <19e>   DW_AT_type        : <0xf1>
 <1><1a2>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <1a3>   DW_AT_encoding    : 7	(unsigned)
    <1a4>   DW_AT_byte_size   : 1
    <1a5>   DW_AT_type        : <0x4d>
    <1a9>   DW_AT_decl_file   : 6
    <1aa>   DW_AT_decl_line   : 68
    <1ab>   DW_AT_decl_column : 1
    <1ac>   DW_AT_sibling     : <0x1bd>
 <2><1b0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1b1>   DW_AT_name        : (indirect string, offset: 0x324d5): GPIO_PIN_RESET
    <1b5>   DW_AT_const_value : 0
 <2><1b6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1b7>   DW_AT_name        : (indirect string, offset: 0x3d1ce): GPIO_PIN_SET
    <1bb>   DW_AT_const_value : 1
 <2><1bc>: Abbrev Number: 0
 <1><1bd>: Abbrev Number: 2 (DW_TAG_typedef)
    <1be>   DW_AT_name        : (indirect string, offset: 0xef981): GPIO_PinState
    <1c2>   DW_AT_decl_file   : 6
    <1c3>   DW_AT_decl_line   : 71
    <1c4>   DW_AT_decl_column : 3
    <1c5>   DW_AT_type        : <0x1a2>
 <1><1c9>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <1ca>   DW_AT_encoding    : 7	(unsigned)
    <1cb>   DW_AT_byte_size   : 4
    <1cc>   DW_AT_type        : <0x31>
    <1d0>   DW_AT_decl_file   : 7
    <1d1>   DW_AT_decl_line   : 13
    <1d2>   DW_AT_decl_column : 14
    <1d3>   DW_AT_sibling     : <0x25c>
 <2><1d7>: Abbrev Number: 9 (DW_TAG_enumerator)
    <1d8>   DW_AT_name        : (indirect string, offset: 0x90596): TL1_Red
    <1dc>   DW_AT_const_value : 0x800000
 <2><1e0>: Abbrev Number: 9 (DW_TAG_enumerator)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x9cd24): TL1_Yellow
    <1e5>   DW_AT_const_value : 0x400000
 <2><1e9>: Abbrev Number: 9 (DW_TAG_enumerator)
    <1ea>   DW_AT_name        : (indirect string, offset: 0xa109e): TL1_Green
    <1ee>   DW_AT_const_value : 0x200000
 <2><1f2>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1f3>   DW_AT_name        : (indirect string, offset: 0xdf173): TL2_Red
    <1f7>   DW_AT_const_value : 32768
 <2><1f9>: Abbrev Number: 6 (DW_TAG_enumerator)
    <1fa>   DW_AT_name        : (indirect string, offset: 0x998c7): TL2_Yellow
    <1fe>   DW_AT_const_value : 16384
 <2><200>: Abbrev Number: 6 (DW_TAG_enumerator)
    <201>   DW_AT_name        : (indirect string, offset: 0x13048): TL2_Green
    <205>   DW_AT_const_value : 8192
 <2><207>: Abbrev Number: 1 (DW_TAG_enumerator)
    <208>   DW_AT_name        : (indirect string, offset: 0x389cc): TL3_Red
    <20c>   DW_AT_const_value : 128
 <2><20d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <20e>   DW_AT_name        : (indirect string, offset: 0x96427): TL3_Yellow
    <212>   DW_AT_const_value : 64
 <2><213>: Abbrev Number: 1 (DW_TAG_enumerator)
    <214>   DW_AT_name        : (indirect string, offset: 0xb7421): TL3_Green
    <218>   DW_AT_const_value : 32
 <2><219>: Abbrev Number: 1 (DW_TAG_enumerator)
    <21a>   DW_AT_name        : (indirect string, offset: 0x86fbd): TL4_Red
    <21e>   DW_AT_const_value : 16
 <2><21f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <220>   DW_AT_name        : (indirect string, offset: 0x926a7): TL4_Yellow
    <224>   DW_AT_const_value : 8
 <2><225>: Abbrev Number: 1 (DW_TAG_enumerator)
    <226>   DW_AT_name        : (indirect string, offset: 0xd5fb3): TL4_Green
    <22a>   DW_AT_const_value : 4
 <2><22b>: Abbrev Number: 9 (DW_TAG_enumerator)
    <22c>   DW_AT_name        : (indirect string, offset: 0xdeb8c): PL1_Red
    <230>   DW_AT_const_value : 0x100000
 <2><234>: Abbrev Number: 9 (DW_TAG_enumerator)
    <235>   DW_AT_name        : (indirect string, offset: 0x87824): PL1_Green
    <239>   DW_AT_const_value : 0x80000
 <2><23d>: Abbrev Number: 9 (DW_TAG_enumerator)
    <23e>   DW_AT_name        : (indirect string, offset: 0xf3bb6): PL1_Blue
    <242>   DW_AT_const_value : 0x40000
 <2><246>: Abbrev Number: 6 (DW_TAG_enumerator)
    <247>   DW_AT_name        : (indirect string, offset: 0xc59b6): PL2_Red
    <24b>   DW_AT_const_value : 4096
 <2><24d>: Abbrev Number: 6 (DW_TAG_enumerator)
    <24e>   DW_AT_name        : (indirect string, offset: 0x1eca5): PL2_Green
    <252>   DW_AT_const_value : 2048
 <2><254>: Abbrev Number: 6 (DW_TAG_enumerator)
    <255>   DW_AT_name        : (indirect string, offset: 0xd9e4): PL2_Blue
    <259>   DW_AT_const_value : 1024
 <2><25b>: Abbrev Number: 0
 <1><25c>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <25d>   DW_AT_encoding    : 7	(unsigned)
    <25e>   DW_AT_byte_size   : 1
    <25f>   DW_AT_type        : <0x4d>
    <263>   DW_AT_decl_file   : 7
    <264>   DW_AT_decl_line   : 34
    <265>   DW_AT_decl_column : 14
    <266>   DW_AT_sibling     : <0x27b>
 <2><26a>: Abbrev Number: 15 (DW_TAG_enumerator)
    <26b>   DW_AT_name        : TL
    <26e>   DW_AT_const_value : 0
 <2><26f>: Abbrev Number: 15 (DW_TAG_enumerator)
    <270>   DW_AT_name        : PL
    <273>   DW_AT_const_value : 1
 <2><274>: Abbrev Number: 15 (DW_TAG_enumerator)
    <275>   DW_AT_name        : PLB
    <279>   DW_AT_const_value : 2
 <2><27a>: Abbrev Number: 0
 <1><27b>: Abbrev Number: 2 (DW_TAG_typedef)
    <27c>   DW_AT_name        : (indirect string, offset: 0x6919a): ledType
    <280>   DW_AT_decl_file   : 7
    <281>   DW_AT_decl_line   : 41
    <282>   DW_AT_decl_column : 3
    <283>   DW_AT_type        : <0x25c>
 <1><287>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <288>   DW_AT_encoding    : 7	(unsigned)
    <289>   DW_AT_byte_size   : 1
    <28a>   DW_AT_type        : <0x4d>
    <28e>   DW_AT_decl_file   : 7
    <28f>   DW_AT_decl_line   : 43
    <290>   DW_AT_decl_column : 14
    <291>   DW_AT_sibling     : <0x2c6>
 <2><295>: Abbrev Number: 1 (DW_TAG_enumerator)
    <296>   DW_AT_name        : (indirect string, offset: 0x83335): Event_PL1
    <29a>   DW_AT_const_value : 1
 <2><29b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <29c>   DW_AT_name        : (indirect string, offset: 0x8333f): Event_PL2
    <2a0>   DW_AT_const_value : 2
 <2><2a1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2a2>   DW_AT_name        : (indirect string, offset: 0x6577): Event_TL1_Switch
    <2a6>   DW_AT_const_value : 4
 <2><2a7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2a8>   DW_AT_name        : (indirect string, offset: 0x4c635): Event_TL2_Switch
    <2ac>   DW_AT_const_value : 8
 <2><2ad>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2ae>   DW_AT_name        : (indirect string, offset: 0x92d27): Event_TL3_Switch
    <2b2>   DW_AT_const_value : 16
 <2><2b3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x8fbab): Event_TL4_Switch
    <2b8>   DW_AT_const_value : 32
 <2><2b9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2ba>   DW_AT_name        : (indirect string, offset: 0x6bc84): Event_NS_Safe_Walk
    <2be>   DW_AT_const_value : 64
 <2><2bf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x4fbff): Event_EW_Safe_Walk
    <2c4>   DW_AT_const_value : 128
 <2><2c5>: Abbrev Number: 0
 <1><2c6>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <2c7>   DW_AT_encoding    : 7	(unsigned)
    <2c8>   DW_AT_byte_size   : 1
    <2c9>   DW_AT_type        : <0x4d>
    <2cd>   DW_AT_decl_file   : 7
    <2ce>   DW_AT_decl_line   : 54
    <2cf>   DW_AT_decl_column : 14
    <2d0>   DW_AT_sibling     : <0x2ed>
 <2><2d4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2d5>   DW_AT_name        : (indirect string, offset: 0x5dd22): NSG_EWR
    <2d9>   DW_AT_const_value : 0
 <2><2da>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2db>   DW_AT_name        : (indirect string, offset: 0x24499): NSY_EWR
    <2df>   DW_AT_const_value : 1
 <2><2e0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2e1>   DW_AT_name        : (indirect string, offset: 0xde13a): NSR_EWY
    <2e5>   DW_AT_const_value : 2
 <2><2e6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2e7>   DW_AT_name        : (indirect string, offset: 0xddfd7): NSR_EWG
    <2eb>   DW_AT_const_value : 3
 <2><2ec>: Abbrev Number: 0
 <1><2ed>: Abbrev Number: 2 (DW_TAG_typedef)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x33b9f): states
    <2f2>   DW_AT_decl_file   : 7
    <2f3>   DW_AT_decl_line   : 59
    <2f4>   DW_AT_decl_column : 3
    <2f5>   DW_AT_type        : <0x2c6>
 <1><2f9>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <2fa>   DW_AT_encoding    : 7	(unsigned)
    <2fb>   DW_AT_byte_size   : 1
    <2fc>   DW_AT_type        : <0x4d>
    <300>   DW_AT_decl_file   : 7
    <301>   DW_AT_decl_line   : 61
    <302>   DW_AT_decl_column : 14
    <303>   DW_AT_sibling     : <0x314>
 <2><307>: Abbrev Number: 15 (DW_TAG_enumerator)
    <308>   DW_AT_name        : P1G
    <30c>   DW_AT_const_value : 0
 <2><30d>: Abbrev Number: 15 (DW_TAG_enumerator)
    <30e>   DW_AT_name        : P2G
    <312>   DW_AT_const_value : 1
 <2><313>: Abbrev Number: 0
 <1><314>: Abbrev Number: 2 (DW_TAG_typedef)
    <315>   DW_AT_name        : (indirect string, offset: 0x3fb96): pedStates
    <319>   DW_AT_decl_file   : 7
    <31a>   DW_AT_decl_line   : 65
    <31b>   DW_AT_decl_column : 3
    <31c>   DW_AT_type        : <0x2f9>
 <1><320>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <321>   DW_AT_encoding    : 7	(unsigned)
    <322>   DW_AT_byte_size   : 2
    <323>   DW_AT_type        : <0x67>
    <327>   DW_AT_decl_file   : 7
    <328>   DW_AT_decl_line   : 67
    <329>   DW_AT_decl_column : 14
    <32a>   DW_AT_sibling     : <0x359>
 <2><32e>: Abbrev Number: 6 (DW_TAG_enumerator)
    <32f>   DW_AT_name        : (indirect string, offset: 0xd8ce4): yellowDelay
    <333>   DW_AT_const_value : 2000
 <2><335>: Abbrev Number: 6 (DW_TAG_enumerator)
    <336>   DW_AT_name        : (indirect string, offset: 0x916cf): greenDelay
    <33a>   DW_AT_const_value : 20000
 <2><33c>: Abbrev Number: 6 (DW_TAG_enumerator)
    <33d>   DW_AT_name        : (indirect string, offset: 0xe94a): redDelayMax
    <341>   DW_AT_const_value : 1000
 <2><343>: Abbrev Number: 6 (DW_TAG_enumerator)
    <344>   DW_AT_name        : (indirect string, offset: 0x548e4): pedestrianDelay
    <348>   DW_AT_const_value : 4000
 <2><34a>: Abbrev Number: 6 (DW_TAG_enumerator)
    <34b>   DW_AT_name        : (indirect string, offset: 0x8b25c): walkingDelay
    <34f>   DW_AT_const_value : 8000
 <2><351>: Abbrev Number: 6 (DW_TAG_enumerator)
    <352>   DW_AT_name        : (indirect string, offset: 0x8b023): toggleFreq
    <356>   DW_AT_const_value : 500
 <2><358>: Abbrev Number: 0
 <1><359>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <35a>   DW_AT_encoding    : 5	(signed)
    <35b>   DW_AT_byte_size   : 4
    <35c>   DW_AT_type        : <0x2a>
    <360>   DW_AT_decl_file   : 8
    <361>   DW_AT_decl_line   : 82
    <362>   DW_AT_decl_column : 14
    <363>   DW_AT_sibling     : <0x4a9>
 <2><367>: Abbrev Number: 1 (DW_TAG_enumerator)
    <368>   DW_AT_name        : (indirect string, offset: 0x4803b): osPriorityNone
    <36c>   DW_AT_const_value : 0
 <2><36d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <36e>   DW_AT_name        : (indirect string, offset: 0xd3c3f): osPriorityIdle
    <372>   DW_AT_const_value : 1
 <2><373>: Abbrev Number: 1 (DW_TAG_enumerator)
    <374>   DW_AT_name        : (indirect string, offset: 0xe0c11): osPriorityLow
    <378>   DW_AT_const_value : 8
 <2><379>: Abbrev Number: 1 (DW_TAG_enumerator)
    <37a>   DW_AT_name        : (indirect string, offset: 0xc2fe8): osPriorityLow1
    <37e>   DW_AT_const_value : 9
 <2><37f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <380>   DW_AT_name        : (indirect string, offset: 0xe7b06): osPriorityLow2
    <384>   DW_AT_const_value : 10
 <2><385>: Abbrev Number: 1 (DW_TAG_enumerator)
    <386>   DW_AT_name        : (indirect string, offset: 0xe7b15): osPriorityLow3
    <38a>   DW_AT_const_value : 11
 <2><38b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <38c>   DW_AT_name        : (indirect string, offset: 0xe7b24): osPriorityLow4
    <390>   DW_AT_const_value : 12
 <2><391>: Abbrev Number: 1 (DW_TAG_enumerator)
    <392>   DW_AT_name        : (indirect string, offset: 0xe7b33): osPriorityLow5
    <396>   DW_AT_const_value : 13
 <2><397>: Abbrev Number: 1 (DW_TAG_enumerator)
    <398>   DW_AT_name        : (indirect string, offset: 0xe7b42): osPriorityLow6
    <39c>   DW_AT_const_value : 14
 <2><39d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <39e>   DW_AT_name        : (indirect string, offset: 0x5aac5): osPriorityLow7
    <3a2>   DW_AT_const_value : 15
 <2><3a3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3a4>   DW_AT_name        : (indirect string, offset: 0xea411): osPriorityBelowNormal
    <3a8>   DW_AT_const_value : 16
 <2><3a9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x91e28): osPriorityBelowNormal1
    <3ae>   DW_AT_const_value : 17
 <2><3af>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3b0>   DW_AT_name        : (indirect string, offset: 0xcecfa): osPriorityBelowNormal2
    <3b4>   DW_AT_const_value : 18
 <2><3b5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3b6>   DW_AT_name        : (indirect string, offset: 0xa67c1): osPriorityBelowNormal3
    <3ba>   DW_AT_const_value : 19
 <2><3bb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3bc>   DW_AT_name        : (indirect string, offset: 0xced2f): osPriorityBelowNormal4
    <3c0>   DW_AT_const_value : 20
 <2><3c1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3c2>   DW_AT_name        : (indirect string, offset: 0xced46): osPriorityBelowNormal5
    <3c6>   DW_AT_const_value : 21
 <2><3c7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3c8>   DW_AT_name        : (indirect string, offset: 0xced5d): osPriorityBelowNormal6
    <3cc>   DW_AT_const_value : 22
 <2><3cd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3ce>   DW_AT_name        : (indirect string, offset: 0xba49b): osPriorityBelowNormal7
    <3d2>   DW_AT_const_value : 23
 <2><3d3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3d4>   DW_AT_name        : (indirect string, offset: 0xc6a8f): osPriorityNormal
    <3d8>   DW_AT_const_value : 24
 <2><3d9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3da>   DW_AT_name        : (indirect string, offset: 0x26d79): osPriorityNormal1
    <3de>   DW_AT_const_value : 25
 <2><3df>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3e0>   DW_AT_name        : (indirect string, offset: 0x26d8b): osPriorityNormal2
    <3e4>   DW_AT_const_value : 26
 <2><3e5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3e6>   DW_AT_name        : (indirect string, offset: 0x26d9d): osPriorityNormal3
    <3ea>   DW_AT_const_value : 27
 <2><3eb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3ec>   DW_AT_name        : (indirect string, offset: 0x55542): osPriorityNormal4
    <3f0>   DW_AT_const_value : 28
 <2><3f1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x26dde): osPriorityNormal5
    <3f6>   DW_AT_const_value : 29
 <2><3f7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3f8>   DW_AT_name        : (indirect string, offset: 0x26df0): osPriorityNormal6
    <3fc>   DW_AT_const_value : 30
 <2><3fd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3fe>   DW_AT_name        : (indirect string, offset: 0x26e02): osPriorityNormal7
    <402>   DW_AT_const_value : 31
 <2><403>: Abbrev Number: 1 (DW_TAG_enumerator)
    <404>   DW_AT_name        : (indirect string, offset: 0x9cac0): osPriorityAboveNormal
    <408>   DW_AT_const_value : 32
 <2><409>: Abbrev Number: 1 (DW_TAG_enumerator)
    <40a>   DW_AT_name        : (indirect string, offset: 0xf3515): osPriorityAboveNormal1
    <40e>   DW_AT_const_value : 33
 <2><40f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <410>   DW_AT_name        : (indirect string, offset: 0xe5aef): osPriorityAboveNormal2
    <414>   DW_AT_const_value : 34
 <2><415>: Abbrev Number: 1 (DW_TAG_enumerator)
    <416>   DW_AT_name        : (indirect string, offset: 0xf354c): osPriorityAboveNormal3
    <41a>   DW_AT_const_value : 35
 <2><41b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <41c>   DW_AT_name        : (indirect string, offset: 0xf3563): osPriorityAboveNormal4
    <420>   DW_AT_const_value : 36
 <2><421>: Abbrev Number: 1 (DW_TAG_enumerator)
    <422>   DW_AT_name        : (indirect string, offset: 0xe5b8b): osPriorityAboveNormal5
    <426>   DW_AT_const_value : 37
 <2><427>: Abbrev Number: 1 (DW_TAG_enumerator)
    <428>   DW_AT_name        : (indirect string, offset: 0xf3590): osPriorityAboveNormal6
    <42c>   DW_AT_const_value : 38
 <2><42d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <42e>   DW_AT_name        : (indirect string, offset: 0xf35a7): osPriorityAboveNormal7
    <432>   DW_AT_const_value : 39
 <2><433>: Abbrev Number: 1 (DW_TAG_enumerator)
    <434>   DW_AT_name        : (indirect string, offset: 0x566fd): osPriorityHigh
    <438>   DW_AT_const_value : 40
 <2><439>: Abbrev Number: 1 (DW_TAG_enumerator)
    <43a>   DW_AT_name        : (indirect string, offset: 0xa1c78): osPriorityHigh1
    <43e>   DW_AT_const_value : 41
 <2><43f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <440>   DW_AT_name        : (indirect string, offset: 0xa1c88): osPriorityHigh2
    <444>   DW_AT_const_value : 42
 <2><445>: Abbrev Number: 1 (DW_TAG_enumerator)
    <446>   DW_AT_name        : (indirect string, offset: 0xa1c98): osPriorityHigh3
    <44a>   DW_AT_const_value : 43
 <2><44b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <44c>   DW_AT_name        : (indirect string, offset: 0xa1ca8): osPriorityHigh4
    <450>   DW_AT_const_value : 44
 <2><451>: Abbrev Number: 1 (DW_TAG_enumerator)
    <452>   DW_AT_name        : (indirect string, offset: 0x5b6e4): osPriorityHigh5
    <456>   DW_AT_const_value : 45
 <2><457>: Abbrev Number: 1 (DW_TAG_enumerator)
    <458>   DW_AT_name        : (indirect string, offset: 0xa1ce4): osPriorityHigh6
    <45c>   DW_AT_const_value : 46
 <2><45d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <45e>   DW_AT_name        : (indirect string, offset: 0xa1cf4): osPriorityHigh7
    <462>   DW_AT_const_value : 47
 <2><463>: Abbrev Number: 1 (DW_TAG_enumerator)
    <464>   DW_AT_name        : (indirect string, offset: 0xdcf93): osPriorityRealtime
    <468>   DW_AT_const_value : 48
 <2><469>: Abbrev Number: 1 (DW_TAG_enumerator)
    <46a>   DW_AT_name        : (indirect string, offset: 0x99222): osPriorityRealtime1
    <46e>   DW_AT_const_value : 49
 <2><46f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <470>   DW_AT_name        : (indirect string, offset: 0x99236): osPriorityRealtime2
    <474>   DW_AT_const_value : 50
 <2><475>: Abbrev Number: 1 (DW_TAG_enumerator)
    <476>   DW_AT_name        : (indirect string, offset: 0x9924a): osPriorityRealtime3
    <47a>   DW_AT_const_value : 51
 <2><47b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <47c>   DW_AT_name        : (indirect string, offset: 0x9925e): osPriorityRealtime4
    <480>   DW_AT_const_value : 52
 <2><481>: Abbrev Number: 1 (DW_TAG_enumerator)
    <482>   DW_AT_name        : (indirect string, offset: 0x99272): osPriorityRealtime5
    <486>   DW_AT_const_value : 53
 <2><487>: Abbrev Number: 1 (DW_TAG_enumerator)
    <488>   DW_AT_name        : (indirect string, offset: 0x99286): osPriorityRealtime6
    <48c>   DW_AT_const_value : 54
 <2><48d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <48e>   DW_AT_name        : (indirect string, offset: 0x9929a): osPriorityRealtime7
    <492>   DW_AT_const_value : 55
 <2><493>: Abbrev Number: 1 (DW_TAG_enumerator)
    <494>   DW_AT_name        : (indirect string, offset: 0xe44): osPriorityISR
    <498>   DW_AT_const_value : 56
 <2><499>: Abbrev Number: 12 (DW_TAG_enumerator)
    <49a>   DW_AT_name        : (indirect string, offset: 0xd74e4): osPriorityError
    <49e>   DW_AT_const_value : -1
 <2><49f>: Abbrev Number: 9 (DW_TAG_enumerator)
    <4a0>   DW_AT_name        : (indirect string, offset: 0xe80c1): osPriorityReserved
    <4a4>   DW_AT_const_value : 0x7fffffff
 <2><4a8>: Abbrev Number: 0
 <1><4a9>: Abbrev Number: 2 (DW_TAG_typedef)
    <4aa>   DW_AT_name        : (indirect string, offset: 0xcd5bc): osPriority_t
    <4ae>   DW_AT_decl_file   : 8
    <4af>   DW_AT_decl_line   : 136
    <4b0>   DW_AT_decl_column : 3
    <4b1>   DW_AT_type        : <0x359>
 <1><4b5>: Abbrev Number: 2 (DW_TAG_typedef)
    <4b6>   DW_AT_name        : (indirect string, offset: 0x83c46): osThreadFunc_t
    <4ba>   DW_AT_decl_file   : 8
    <4bb>   DW_AT_decl_line   : 139
    <4bc>   DW_AT_decl_column : 16
    <4bd>   DW_AT_type        : <0xac>
 <1><4c1>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <4c2>   DW_AT_encoding    : 5	(signed)
    <4c3>   DW_AT_byte_size   : 4
    <4c4>   DW_AT_type        : <0x2a>
    <4c8>   DW_AT_decl_file   : 8
    <4c9>   DW_AT_decl_line   : 176
    <4ca>   DW_AT_decl_column : 14
    <4cb>   DW_AT_sibling     : <0x503>
 <2><4cf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <4d0>   DW_AT_name        : (indirect string, offset: 0xbbb3f): osOK
    <4d4>   DW_AT_const_value : 0
 <2><4d5>: Abbrev Number: 12 (DW_TAG_enumerator)
    <4d6>   DW_AT_name        : (indirect string, offset: 0x72cac): osError
    <4da>   DW_AT_const_value : -1
 <2><4db>: Abbrev Number: 12 (DW_TAG_enumerator)
    <4dc>   DW_AT_name        : (indirect string, offset: 0xdbcbf): osErrorTimeout
    <4e0>   DW_AT_const_value : -2
 <2><4e1>: Abbrev Number: 12 (DW_TAG_enumerator)
    <4e2>   DW_AT_name        : (indirect string, offset: 0x9fc4c): osErrorResource
    <4e6>   DW_AT_const_value : -3
 <2><4e7>: Abbrev Number: 12 (DW_TAG_enumerator)
    <4e8>   DW_AT_name        : (indirect string, offset: 0x3f1d0): osErrorParameter
    <4ec>   DW_AT_const_value : -4
 <2><4ed>: Abbrev Number: 12 (DW_TAG_enumerator)
    <4ee>   DW_AT_name        : (indirect string, offset: 0x2a352): osErrorNoMemory
    <4f2>   DW_AT_const_value : -5
 <2><4f3>: Abbrev Number: 12 (DW_TAG_enumerator)
    <4f4>   DW_AT_name        : (indirect string, offset: 0x419e1): osErrorISR
    <4f8>   DW_AT_const_value : -6
 <2><4f9>: Abbrev Number: 9 (DW_TAG_enumerator)
    <4fa>   DW_AT_name        : (indirect string, offset: 0x7b479): osStatusReserved
    <4fe>   DW_AT_const_value : 0x7fffffff
 <2><502>: Abbrev Number: 0
 <1><503>: Abbrev Number: 2 (DW_TAG_typedef)
    <504>   DW_AT_name        : (indirect string, offset: 0x528af): osStatus_t
    <508>   DW_AT_decl_file   : 8
    <509>   DW_AT_decl_line   : 185
    <50a>   DW_AT_decl_column : 3
    <50b>   DW_AT_type        : <0x4c1>
 <1><50f>: Abbrev Number: 2 (DW_TAG_typedef)
    <510>   DW_AT_name        : (indirect string, offset: 0x2c4ab): osThreadId_t
    <514>   DW_AT_decl_file   : 8
    <515>   DW_AT_decl_line   : 189
    <516>   DW_AT_decl_column : 15
    <517>   DW_AT_type        : <0xbc>
 <1><51b>: Abbrev Number: 2 (DW_TAG_typedef)
    <51c>   DW_AT_name        : (indirect string, offset: 0xa403b): TZ_ModuleId_t
    <520>   DW_AT_decl_file   : 8
    <521>   DW_AT_decl_line   : 213
    <522>   DW_AT_decl_column : 18
    <523>   DW_AT_type        : <0x9b>
 <1><527>: Abbrev Number: 33 (DW_TAG_structure_type)
    <528>   DW_AT_byte_size   : 36
    <529>   DW_AT_decl_file   : 8
    <52a>   DW_AT_decl_line   : 218
    <52b>   DW_AT_decl_column : 9
    <52c>   DW_AT_sibling     : <0x59d>
 <2><530>: Abbrev Number: 8 (DW_TAG_member)
    <531>   DW_AT_name        : (indirect string, offset: 0xda27d): name
    <535>   DW_AT_decl_file   : 8
    <535>   DW_AT_decl_line   : 219
    <536>   DW_AT_decl_column : 33
    <537>   DW_AT_type        : <0xec>
    <53b>   DW_AT_data_member_location: 0
 <2><53c>: Abbrev Number: 8 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0x9f956): attr_bits
    <541>   DW_AT_decl_file   : 8
    <541>   DW_AT_decl_line   : 220
    <542>   DW_AT_decl_column : 28
    <543>   DW_AT_type        : <0x9b>
    <547>   DW_AT_data_member_location: 4
 <2><548>: Abbrev Number: 8 (DW_TAG_member)
    <549>   DW_AT_name        : (indirect string, offset: 0x2f224): cb_mem
    <54d>   DW_AT_decl_file   : 8
    <54d>   DW_AT_decl_line   : 221
    <54e>   DW_AT_decl_column : 30
    <54f>   DW_AT_type        : <0xbc>
    <553>   DW_AT_data_member_location: 8
 <2><554>: Abbrev Number: 8 (DW_TAG_member)
    <555>   DW_AT_name        : (indirect string, offset: 0x6b157): cb_size
    <559>   DW_AT_decl_file   : 8
    <559>   DW_AT_decl_line   : 222
    <55a>   DW_AT_decl_column : 30
    <55b>   DW_AT_type        : <0x9b>
    <55f>   DW_AT_data_member_location: 12
 <2><560>: Abbrev Number: 8 (DW_TAG_member)
    <561>   DW_AT_name        : (indirect string, offset: 0xddb3c): stack_mem
    <565>   DW_AT_decl_file   : 8
    <565>   DW_AT_decl_line   : 223
    <566>   DW_AT_decl_column : 27
    <567>   DW_AT_type        : <0xbc>
    <56b>   DW_AT_data_member_location: 16
 <2><56c>: Abbrev Number: 8 (DW_TAG_member)
    <56d>   DW_AT_name        : (indirect string, offset: 0x992ff): stack_size
    <571>   DW_AT_decl_file   : 8
    <571>   DW_AT_decl_line   : 224
    <572>   DW_AT_decl_column : 27
    <573>   DW_AT_type        : <0x9b>
    <577>   DW_AT_data_member_location: 20
 <2><578>: Abbrev Number: 8 (DW_TAG_member)
    <579>   DW_AT_name        : (indirect string, offset: 0x60565): priority
    <57d>   DW_AT_decl_file   : 8
    <57d>   DW_AT_decl_line   : 225
    <57e>   DW_AT_decl_column : 29
    <57f>   DW_AT_type        : <0x4a9>
    <583>   DW_AT_data_member_location: 24
 <2><584>: Abbrev Number: 8 (DW_TAG_member)
    <585>   DW_AT_name        : (indirect string, offset: 0x67d6b): tz_module
    <589>   DW_AT_decl_file   : 8
    <589>   DW_AT_decl_line   : 226
    <58a>   DW_AT_decl_column : 28
    <58b>   DW_AT_type        : <0x51b>
    <58f>   DW_AT_data_member_location: 28
 <2><590>: Abbrev Number: 8 (DW_TAG_member)
    <591>   DW_AT_name        : (indirect string, offset: 0xdac7c): reserved
    <595>   DW_AT_decl_file   : 8
    <595>   DW_AT_decl_line   : 227
    <596>   DW_AT_decl_column : 29
    <597>   DW_AT_type        : <0x9b>
    <59b>   DW_AT_data_member_location: 32
 <2><59c>: Abbrev Number: 0
 <1><59d>: Abbrev Number: 2 (DW_TAG_typedef)
    <59e>   DW_AT_name        : (indirect string, offset: 0x26b44): osThreadAttr_t
    <5a2>   DW_AT_decl_file   : 8
    <5a3>   DW_AT_decl_line   : 228
    <5a4>   DW_AT_decl_column : 3
    <5a5>   DW_AT_type        : <0x527>
 <1><5a9>: Abbrev Number: 14 (DW_TAG_const_type)
    <5aa>   DW_AT_type        : <0x59d>
 <1><5ae>: Abbrev Number: 2 (DW_TAG_typedef)
    <5af>   DW_AT_name        : (indirect string, offset: 0x71975): EventGroupHandle_t
    <5b3>   DW_AT_decl_file   : 9
    <5b4>   DW_AT_decl_line   : 82
    <5b5>   DW_AT_decl_column : 34
    <5b6>   DW_AT_type        : <0x5ba>
 <1><5ba>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <5bb>   DW_AT_byte_size   : 4
    <5bb>   DW_AT_type        : <0x5bf>
 <1><5bf>: Abbrev Number: 34 (DW_TAG_structure_type)
    <5c0>   DW_AT_name        : (indirect string, offset: 0xd80c4): EventGroupDef_t
    <5c4>   DW_AT_declaration : 1
 <1><5c4>: Abbrev Number: 2 (DW_TAG_typedef)
    <5c5>   DW_AT_name        : (indirect string, offset: 0xf01c2): EventBits_t
    <5c9>   DW_AT_decl_file   : 9
    <5ca>   DW_AT_decl_line   : 92
    <5cb>   DW_AT_decl_column : 20
    <5cc>   DW_AT_type        : <0xcf>
 <1><5d0>: Abbrev Number: 14 (DW_TAG_const_type)
    <5d1>   DW_AT_type        : <0x5c4>
 <1><5d5>: Abbrev Number: 4 (DW_TAG_variable)
    <5d6>   DW_AT_name        : (indirect string, offset: 0xe245d): eventGroup
    <5da>   DW_AT_decl_file   : 1
    <5da>   DW_AT_decl_line   : 52
    <5db>   DW_AT_decl_column : 20
    <5dc>   DW_AT_type        : <0x5ae>
    <5e0>   DW_AT_external    : 1
    <5e0>   DW_AT_location    : 5 byte block: 3 7c 0 0 20 	(DW_OP_addr: 2000007c)
 <1><5e6>: Abbrev Number: 4 (DW_TAG_variable)
    <5e7>   DW_AT_name        : (indirect string, offset: 0x2107): current_instruction
    <5eb>   DW_AT_decl_file   : 1
    <5eb>   DW_AT_decl_line   : 53
    <5ec>   DW_AT_decl_column : 10
    <5ed>   DW_AT_type        : <0x9b>
    <5f1>   DW_AT_external    : 1
    <5f1>   DW_AT_location    : 5 byte block: 3 80 0 0 20 	(DW_OP_addr: 20000080)
 <1><5f7>: Abbrev Number: 4 (DW_TAG_variable)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x46ef1): doBlink1
    <5fc>   DW_AT_decl_file   : 1
    <5fc>   DW_AT_decl_line   : 54
    <5fd>   DW_AT_decl_column : 6
    <5fe>   DW_AT_type        : <0x608>
    <602>   DW_AT_external    : 1
    <602>   DW_AT_location    : 5 byte block: 3 84 0 0 20 	(DW_OP_addr: 20000084)
 <1><608>: Abbrev Number: 5 (DW_TAG_base_type)
    <609>   DW_AT_byte_size   : 1
    <60a>   DW_AT_encoding    : 2	(boolean)
    <60b>   DW_AT_name        : (indirect string, offset: 0x6ecac): _Bool
 <1><60f>: Abbrev Number: 4 (DW_TAG_variable)
    <610>   DW_AT_name        : (indirect string, offset: 0x46efa): doBlink2
    <614>   DW_AT_decl_file   : 1
    <614>   DW_AT_decl_line   : 54
    <615>   DW_AT_decl_column : 16
    <616>   DW_AT_type        : <0x608>
    <61a>   DW_AT_external    : 1
    <61a>   DW_AT_location    : 5 byte block: 3 85 0 0 20 	(DW_OP_addr: 20000085)
 <1><620>: Abbrev Number: 4 (DW_TAG_variable)
    <621>   DW_AT_name        : (indirect string, offset: 0x799ac): blinkState
    <625>   DW_AT_decl_file   : 1
    <625>   DW_AT_decl_line   : 55
    <626>   DW_AT_decl_column : 6
    <627>   DW_AT_type        : <0x608>
    <62b>   DW_AT_external    : 1
    <62b>   DW_AT_location    : 5 byte block: 3 86 0 0 20 	(DW_OP_addr: 20000086)
 <1><631>: Abbrev Number: 4 (DW_TAG_variable)
    <632>   DW_AT_name        : (indirect string, offset: 0x60b02): defaultTaskHandle
    <636>   DW_AT_decl_file   : 1
    <636>   DW_AT_decl_line   : 58
    <637>   DW_AT_decl_column : 14
    <638>   DW_AT_type        : <0x50f>
    <63c>   DW_AT_external    : 1
    <63c>   DW_AT_location    : 5 byte block: 3 88 0 0 20 	(DW_OP_addr: 20000088)
 <1><642>: Abbrev Number: 4 (DW_TAG_variable)
    <643>   DW_AT_name        : (indirect string, offset: 0x6bf05): defaultTask_attributes
    <647>   DW_AT_decl_file   : 1
    <647>   DW_AT_decl_line   : 59
    <648>   DW_AT_decl_column : 22
    <649>   DW_AT_type        : <0x5a9>
    <64d>   DW_AT_external    : 1
    <64d>   DW_AT_location    : 5 byte block: 3 f4 72 0 8 	(DW_OP_addr: 80072f4)
 <1><653>: Abbrev Number: 4 (DW_TAG_variable)
    <654>   DW_AT_name        : (indirect string, offset: 0x9f265): TLHandlerTaskHandle
    <658>   DW_AT_decl_file   : 1
    <658>   DW_AT_decl_line   : 65
    <659>   DW_AT_decl_column : 14
    <65a>   DW_AT_type        : <0x50f>
    <65e>   DW_AT_external    : 1
    <65e>   DW_AT_location    : 5 byte block: 3 8c 0 0 20 	(DW_OP_addr: 2000008c)
 <1><664>: Abbrev Number: 4 (DW_TAG_variable)
    <665>   DW_AT_name        : (indirect string, offset: 0x8d50): TLHandlerTask_attributes
    <669>   DW_AT_decl_file   : 1
    <669>   DW_AT_decl_line   : 66
    <66a>   DW_AT_decl_column : 22
    <66b>   DW_AT_type        : <0x5a9>
    <66f>   DW_AT_external    : 1
    <66f>   DW_AT_location    : 5 byte block: 3 18 73 0 8 	(DW_OP_addr: 8007318)
 <1><675>: Abbrev Number: 4 (DW_TAG_variable)
    <676>   DW_AT_name        : (indirect string, offset: 0xeca53): PLHandlerTaskHandle
    <67a>   DW_AT_decl_file   : 1
    <67a>   DW_AT_decl_line   : 72
    <67b>   DW_AT_decl_column : 14
    <67c>   DW_AT_type        : <0x50f>
    <680>   DW_AT_external    : 1
    <680>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><686>: Abbrev Number: 4 (DW_TAG_variable)
    <687>   DW_AT_name        : (indirect string, offset: 0xd3f87): PLHandlerTask_attributes
    <68b>   DW_AT_decl_file   : 1
    <68b>   DW_AT_decl_line   : 73
    <68c>   DW_AT_decl_column : 22
    <68d>   DW_AT_type        : <0x5a9>
    <691>   DW_AT_external    : 1
    <691>   DW_AT_location    : 5 byte block: 3 3c 73 0 8 	(DW_OP_addr: 800733c)
 <1><697>: Abbrev Number: 4 (DW_TAG_variable)
    <698>   DW_AT_name        : (indirect string, offset: 0x1cfbe): InHandlerTaskHandle
    <69c>   DW_AT_decl_file   : 1
    <69c>   DW_AT_decl_line   : 79
    <69d>   DW_AT_decl_column : 14
    <69e>   DW_AT_type        : <0x50f>
    <6a2>   DW_AT_external    : 1
    <6a2>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><6a8>: Abbrev Number: 4 (DW_TAG_variable)
    <6a9>   DW_AT_name        : (indirect string, offset: 0x89a85): InHandlerTask_attributes
    <6ad>   DW_AT_decl_file   : 1
    <6ad>   DW_AT_decl_line   : 80
    <6ae>   DW_AT_decl_column : 22
    <6af>   DW_AT_type        : <0x5a9>
    <6b3>   DW_AT_external    : 1
    <6b3>   DW_AT_location    : 5 byte block: 3 60 73 0 8 	(DW_OP_addr: 8007360)
 <1><6b9>: Abbrev Number: 4 (DW_TAG_variable)
    <6ba>   DW_AT_name        : (indirect string, offset: 0xd3653): blinkTaskHandleHandle
    <6be>   DW_AT_decl_file   : 1
    <6be>   DW_AT_decl_line   : 86
    <6bf>   DW_AT_decl_column : 14
    <6c0>   DW_AT_type        : <0x50f>
    <6c4>   DW_AT_external    : 1
    <6c4>   DW_AT_location    : 5 byte block: 3 98 0 0 20 	(DW_OP_addr: 20000098)
 <1><6ca>: Abbrev Number: 4 (DW_TAG_variable)
    <6cb>   DW_AT_name        : (indirect string, offset: 0xd8531): blinkTaskHandle_attributes
    <6cf>   DW_AT_decl_file   : 1
    <6cf>   DW_AT_decl_line   : 87
    <6d0>   DW_AT_decl_column : 22
    <6d1>   DW_AT_type        : <0x5a9>
    <6d5>   DW_AT_external    : 1
    <6d5>   DW_AT_location    : 5 byte block: 3 84 73 0 8 	(DW_OP_addr: 8007384)
 <1><6db>: Abbrev Number: 16 (DW_TAG_subprogram)
    <6dc>   DW_AT_external    : 1
    <6dc>   DW_AT_name        : (indirect string, offset: 0xa8ee8): HAL_GPIO_ReadPin
    <6e0>   DW_AT_decl_file   : 6
    <6e1>   DW_AT_decl_line   : 295
    <6e3>   DW_AT_decl_column : 19
    <6e4>   DW_AT_prototyped  : 1
    <6e4>   DW_AT_type        : <0x1bd>
    <6e8>   DW_AT_declaration : 1
    <6e8>   DW_AT_sibling     : <0x6f7>
 <2><6ec>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <6ed>   DW_AT_type        : <0x6f7>
 <2><6f1>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <6f2>   DW_AT_type        : <0x8f>
 <2><6f6>: Abbrev Number: 0
 <1><6f7>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <6f8>   DW_AT_byte_size   : 4
    <6f8>   DW_AT_type        : <0x195>
 <1><6fc>: Abbrev Number: 16 (DW_TAG_subprogram)
    <6fd>   DW_AT_external    : 1
    <6fd>   DW_AT_name        : (indirect string, offset: 0xa2b18): xEventGroupSetBits
    <701>   DW_AT_decl_file   : 9
    <702>   DW_AT_decl_line   : 485
    <704>   DW_AT_decl_column : 13
    <705>   DW_AT_prototyped  : 1
    <705>   DW_AT_type        : <0x5c4>
    <709>   DW_AT_declaration : 1
    <709>   DW_AT_sibling     : <0x718>
 <2><70d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <70e>   DW_AT_type        : <0x5ae>
 <2><712>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <713>   DW_AT_type        : <0x5d0>
 <2><717>: Abbrev Number: 0
 <1><718>: Abbrev Number: 35 (DW_TAG_subprogram)
    <719>   DW_AT_external    : 1
    <719>   DW_AT_name        : (indirect string, offset: 0x8f6b1): vTaskDelay
    <71d>   DW_AT_decl_file   : 11
    <71e>   DW_AT_decl_line   : 758
    <720>   DW_AT_decl_column : 6
    <721>   DW_AT_prototyped  : 1
    <721>   DW_AT_declaration : 1
    <721>   DW_AT_sibling     : <0x72b>
 <2><725>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <726>   DW_AT_type        : <0xdb>
 <2><72a>: Abbrev Number: 0
 <1><72b>: Abbrev Number: 16 (DW_TAG_subprogram)
    <72c>   DW_AT_external    : 1
    <72c>   DW_AT_name        : (indirect string, offset: 0x664bc): xEventGroupWaitBits
    <730>   DW_AT_decl_file   : 9
    <731>   DW_AT_decl_line   : 295
    <733>   DW_AT_decl_column : 13
    <734>   DW_AT_prototyped  : 1
    <734>   DW_AT_type        : <0x5c4>
    <738>   DW_AT_declaration : 1
    <738>   DW_AT_sibling     : <0x756>
 <2><73c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <73d>   DW_AT_type        : <0x5ae>
 <2><741>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <742>   DW_AT_type        : <0x5d0>
 <2><746>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <747>   DW_AT_type        : <0xca>
 <2><74b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <74c>   DW_AT_type        : <0xca>
 <2><750>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <751>   DW_AT_type        : <0xcf>
 <2><755>: Abbrev Number: 0
 <1><756>: Abbrev Number: 36 (DW_TAG_subprogram)
    <757>   DW_AT_external    : 1
    <757>   DW_AT_name        : (indirect string, offset: 0x7e23): xTaskGetTickCount
    <75b>   DW_AT_decl_file   : 11
    <75c>   DW_AT_decl_line   : 1356
    <75e>   DW_AT_decl_column : 12
    <75f>   DW_AT_prototyped  : 1
    <75f>   DW_AT_type        : <0xcf>
    <763>   DW_AT_declaration : 1
 <1><763>: Abbrev Number: 37 (DW_TAG_subprogram)
    <764>   DW_AT_external    : 1
    <764>   DW_AT_name        : (indirect string, offset: 0x71832): update_instruction
    <768>   DW_AT_decl_file   : 10
    <769>   DW_AT_decl_line   : 9
    <76a>   DW_AT_decl_column : 10
    <76b>   DW_AT_prototyped  : 1
    <76b>   DW_AT_type        : <0x9b>
    <76f>   DW_AT_declaration : 1
    <76f>   DW_AT_sibling     : <0x783>
 <2><773>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <774>   DW_AT_type        : <0x9b>
 <2><778>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <779>   DW_AT_type        : <0x9b>
 <2><77d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <77e>   DW_AT_type        : <0x27b>
 <2><782>: Abbrev Number: 0
 <1><783>: Abbrev Number: 16 (DW_TAG_subprogram)
    <784>   DW_AT_external    : 1
    <784>   DW_AT_name        : (indirect string, offset: 0xf150b): osDelay
    <788>   DW_AT_decl_file   : 8
    <789>   DW_AT_decl_line   : 459
    <78b>   DW_AT_decl_column : 12
    <78c>   DW_AT_prototyped  : 1
    <78c>   DW_AT_type        : <0x503>
    <790>   DW_AT_declaration : 1
    <790>   DW_AT_sibling     : <0x79a>
 <2><794>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <795>   DW_AT_type        : <0x9b>
 <2><799>: Abbrev Number: 0
 <1><79a>: Abbrev Number: 16 (DW_TAG_subprogram)
    <79b>   DW_AT_external    : 1
    <79b>   DW_AT_name        : (indirect string, offset: 0x87220): osThreadNew
    <79f>   DW_AT_decl_file   : 8
    <7a0>   DW_AT_decl_line   : 349
    <7a2>   DW_AT_decl_column : 14
    <7a3>   DW_AT_prototyped  : 1
    <7a3>   DW_AT_type        : <0x50f>
    <7a7>   DW_AT_declaration : 1
    <7a7>   DW_AT_sibling     : <0x7bb>
 <2><7ab>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7ac>   DW_AT_type        : <0x4b5>
 <2><7b0>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7b1>   DW_AT_type        : <0xbc>
 <2><7b5>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <7b6>   DW_AT_type        : <0x7bb>
 <2><7ba>: Abbrev Number: 0
 <1><7bb>: Abbrev Number: 13 (DW_TAG_pointer_type)
    <7bc>   DW_AT_byte_size   : 4
    <7bc>   DW_AT_type        : <0x5a9>
 <1><7c0>: Abbrev Number: 38 (DW_TAG_subprogram)
    <7c1>   DW_AT_external    : 1
    <7c1>   DW_AT_name        : (indirect string, offset: 0x1581a): xEventGroupCreate
    <7c5>   DW_AT_decl_file   : 9
    <7c6>   DW_AT_decl_line   : 147
    <7c7>   DW_AT_decl_column : 21
    <7c8>   DW_AT_prototyped  : 1
    <7c8>   DW_AT_type        : <0x5ae>
    <7cc>   DW_AT_declaration : 1
 <1><7cc>: Abbrev Number: 19 (DW_TAG_subprogram)
    <7cd>   DW_AT_external    : 1
    <7cd>   DW_AT_name        : (indirect string, offset: 0x60a77): blinkTask
    <7d1>   DW_AT_decl_file   : 1
    <7d1>   DW_AT_decl_line   : 350
    <7d3>   DW_AT_decl_column : 6
    <7d3>   DW_AT_prototyped  : 1
    <7d3>   DW_AT_low_pc      : 0x8000974
    <7d7>   DW_AT_high_pc     : 0xa4
    <7db>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7dd>   DW_AT_call_all_tail_calls: 1
    <7dd>   DW_AT_sibling     : <0x809>
 <2><7e1>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <7e2>   DW_AT_name        : (indirect string, offset: 0x3453a): argument
    <7e6>   DW_AT_decl_file   : 1
    <7e6>   DW_AT_decl_line   : 350
    <7e8>   DW_AT_decl_column : 22
    <7e8>   DW_AT_type        : <0xbc>
    <7ec>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><7ef>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <7f0>   DW_AT_low_pc      : 0x800098c
    <7f4>   DW_AT_high_pc     : 0x54
 <3><7f8>: Abbrev Number: 17 (DW_TAG_variable)
    <7f9>   DW_AT_name        : (indirect string, offset: 0x71839): instruction
    <7fd>   DW_AT_decl_file   : 1
    <7fd>   DW_AT_decl_line   : 357
    <7ff>   DW_AT_decl_column : 16
    <800>   DW_AT_type        : <0x9b>
    <804>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><807>: Abbrev Number: 0
 <2><808>: Abbrev Number: 0
 <1><809>: Abbrev Number: 19 (DW_TAG_subprogram)
    <80a>   DW_AT_external    : 1
    <80a>   DW_AT_name        : (indirect string, offset: 0xc884d): InHandler
    <80e>   DW_AT_decl_file   : 1
    <80e>   DW_AT_decl_line   : 314
    <810>   DW_AT_decl_column : 6
    <810>   DW_AT_prototyped  : 1
    <810>   DW_AT_low_pc      : 0x80008b0
    <814>   DW_AT_high_pc     : 0xc4
    <818>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <81a>   DW_AT_call_all_tail_calls: 1
    <81a>   DW_AT_sibling     : <0x82d>
 <2><81e>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <81f>   DW_AT_name        : (indirect string, offset: 0x3453a): argument
    <823>   DW_AT_decl_file   : 1
    <823>   DW_AT_decl_line   : 314
    <825>   DW_AT_decl_column : 22
    <825>   DW_AT_type        : <0xbc>
    <829>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><82c>: Abbrev Number: 0
 <1><82d>: Abbrev Number: 19 (DW_TAG_subprogram)
    <82e>   DW_AT_external    : 1
    <82e>   DW_AT_name        : (indirect string, offset: 0xd4ac4): PLHandler
    <832>   DW_AT_decl_file   : 1
    <832>   DW_AT_decl_line   : 282
    <834>   DW_AT_decl_column : 6
    <834>   DW_AT_prototyped  : 1
    <834>   DW_AT_low_pc      : 0x800083c
    <838>   DW_AT_high_pc     : 0x74
    <83c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <83e>   DW_AT_call_all_tail_calls: 1
    <83e>   DW_AT_sibling     : <0x893>
 <2><842>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <843>   DW_AT_name        : (indirect string, offset: 0x3453a): argument
    <847>   DW_AT_decl_file   : 1
    <847>   DW_AT_decl_line   : 282
    <849>   DW_AT_decl_column : 22
    <849>   DW_AT_type        : <0xbc>
    <84d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><850>: Abbrev Number: 17 (DW_TAG_variable)
    <851>   DW_AT_name        : (indirect string, offset: 0xf8f79): State
    <855>   DW_AT_decl_file   : 1
    <855>   DW_AT_decl_line   : 287
    <857>   DW_AT_decl_column : 20
    <858>   DW_AT_type        : <0x314>
    <85c>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <2><862>: Abbrev Number: 17 (DW_TAG_variable)
    <863>   DW_AT_name        : (indirect string, offset: 0xd224c): NextState
    <867>   DW_AT_decl_file   : 1
    <867>   DW_AT_decl_line   : 287
    <869>   DW_AT_decl_column : 27
    <86a>   DW_AT_type        : <0x314>
    <86e>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <2><874>: Abbrev Number: 17 (DW_TAG_variable)
    <875>   DW_AT_name        : (indirect string, offset: 0xdc55e): receivedBits
    <879>   DW_AT_decl_file   : 1
    <879>   DW_AT_decl_line   : 288
    <87b>   DW_AT_decl_column : 15
    <87c>   DW_AT_type        : <0x5c4>
    <880>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><883>: Abbrev Number: 17 (DW_TAG_variable)
    <884>   DW_AT_name        : (indirect string, offset: 0x71839): instruction
    <888>   DW_AT_decl_file   : 1
    <888>   DW_AT_decl_line   : 289
    <88a>   DW_AT_decl_column : 12
    <88b>   DW_AT_type        : <0x9b>
    <88f>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><892>: Abbrev Number: 0
 <1><893>: Abbrev Number: 23 (DW_TAG_subprogram)
    <894>   DW_AT_external    : 1
    <894>   DW_AT_name        : (indirect string, offset: 0xedbfb): TLHandler
    <898>   DW_AT_decl_file   : 1
    <898>   DW_AT_decl_line   : 186
    <899>   DW_AT_decl_column : 6
    <899>   DW_AT_prototyped  : 1
    <899>   DW_AT_low_pc      : 0x80005cc
    <89d>   DW_AT_high_pc     : 0x270
    <8a1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8a3>   DW_AT_call_all_tail_calls: 1
    <8a3>   DW_AT_sibling     : <0x942>
 <2><8a7>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <8a8>   DW_AT_name        : (indirect string, offset: 0x3453a): argument
    <8ac>   DW_AT_decl_file   : 1
    <8ac>   DW_AT_decl_line   : 186
    <8ad>   DW_AT_decl_column : 22
    <8ae>   DW_AT_type        : <0xbc>
    <8b2>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><8b5>: Abbrev Number: 10 (DW_TAG_variable)
    <8b6>   DW_AT_name        : (indirect string, offset: 0xf8f79): State
    <8ba>   DW_AT_decl_file   : 1
    <8ba>   DW_AT_decl_line   : 190
    <8bb>   DW_AT_decl_column : 16
    <8bc>   DW_AT_type        : <0x2ed>
    <8c0>   DW_AT_location    : 5 byte block: 3 9c 0 0 20 	(DW_OP_addr: 2000009c)
 <2><8c6>: Abbrev Number: 10 (DW_TAG_variable)
    <8c7>   DW_AT_name        : (indirect string, offset: 0xd224c): NextState
    <8cb>   DW_AT_decl_file   : 1
    <8cb>   DW_AT_decl_line   : 190
    <8cc>   DW_AT_decl_column : 23
    <8cd>   DW_AT_type        : <0x2ed>
    <8d1>   DW_AT_location    : 5 byte block: 3 9d 0 0 20 	(DW_OP_addr: 2000009d)
 <2><8d7>: Abbrev Number: 22 (DW_TAG_lexical_block)
    <8d8>   DW_AT_low_pc      : 0x80005d4
    <8dc>   DW_AT_high_pc     : 0x268
 <3><8e0>: Abbrev Number: 10 (DW_TAG_variable)
    <8e1>   DW_AT_name        : (indirect string, offset: 0x71839): instruction
    <8e5>   DW_AT_decl_file   : 1
    <8e5>   DW_AT_decl_line   : 195
    <8e6>   DW_AT_decl_column : 14
    <8e7>   DW_AT_type        : <0x9b>
    <8eb>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><8ee>: Abbrev Number: 10 (DW_TAG_variable)
    <8ef>   DW_AT_name        : (indirect string, offset: 0x4e924): elapsedTime
    <8f3>   DW_AT_decl_file   : 1
    <8f3>   DW_AT_decl_line   : 195
    <8f4>   DW_AT_decl_column : 27
    <8f5>   DW_AT_type        : <0x9b>
    <8f9>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><8fc>: Abbrev Number: 10 (DW_TAG_variable)
    <8fd>   DW_AT_name        : (indirect string, offset: 0x71b4d): toGreen
    <901>   DW_AT_decl_file   : 1
    <901>   DW_AT_decl_line   : 196
    <902>   DW_AT_decl_column : 10
    <903>   DW_AT_type        : <0x608>
    <907>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <3><90a>: Abbrev Number: 10 (DW_TAG_variable)
    <90b>   DW_AT_name        : (indirect string, offset: 0xdc55e): receivedBits
    <90f>   DW_AT_decl_file   : 1
    <90f>   DW_AT_decl_line   : 197
    <910>   DW_AT_decl_column : 17
    <911>   DW_AT_type        : <0x5c4>
    <915>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><918>: Abbrev Number: 10 (DW_TAG_variable)
    <919>   DW_AT_name        : (indirect string, offset: 0xde1be): xStartTimer
    <91d>   DW_AT_decl_file   : 1
    <91d>   DW_AT_decl_line   : 198
    <91e>   DW_AT_decl_column : 16
    <91f>   DW_AT_type        : <0xcf>
    <923>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><926>: Abbrev Number: 10 (DW_TAG_variable)
    <927>   DW_AT_name        : (indirect string, offset: 0x8cd79): xEndTimer
    <92b>   DW_AT_decl_file   : 1
    <92b>   DW_AT_decl_line   : 198
    <92c>   DW_AT_decl_column : 29
    <92d>   DW_AT_type        : <0xcf>
    <931>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><934>: Abbrev Number: 39 (DW_TAG_variable)
    <935>   DW_AT_name        : (indirect string, offset: 0xaeece): elapsedTicks
    <939>   DW_AT_decl_file   : 1
    <93a>   DW_AT_decl_line   : 198
    <93b>   DW_AT_decl_column : 40
    <93c>   DW_AT_type        : <0xcf>
 <3><940>: Abbrev Number: 0
 <2><941>: Abbrev Number: 0
 <1><942>: Abbrev Number: 23 (DW_TAG_subprogram)
    <943>   DW_AT_external    : 1
    <943>   DW_AT_name        : (indirect string, offset: 0x3603c): StartDefaultTask
    <947>   DW_AT_decl_file   : 1
    <947>   DW_AT_decl_line   : 168
    <948>   DW_AT_decl_column : 6
    <948>   DW_AT_prototyped  : 1
    <948>   DW_AT_low_pc      : 0x80005bc
    <94c>   DW_AT_high_pc     : 0x10
    <950>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <952>   DW_AT_call_all_tail_calls: 1
    <952>   DW_AT_sibling     : <0x965>
 <2><956>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <957>   DW_AT_name        : (indirect string, offset: 0x3453a): argument
    <95b>   DW_AT_decl_file   : 1
    <95b>   DW_AT_decl_line   : 168
    <95c>   DW_AT_decl_column : 29
    <95d>   DW_AT_type        : <0xbc>
    <961>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><964>: Abbrev Number: 0
 <1><965>: Abbrev Number: 40 (DW_TAG_subprogram)
    <966>   DW_AT_external    : 1
    <966>   DW_AT_name        : (indirect string, offset: 0xc442b): MX_FREERTOS_Init
    <96a>   DW_AT_decl_file   : 1
    <96b>   DW_AT_decl_line   : 111
    <96c>   DW_AT_decl_column : 6
    <96d>   DW_AT_prototyped  : 1
    <96d>   DW_AT_low_pc      : 0x80004fc
    <971>   DW_AT_high_pc     : 0xc0
    <975>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <977>   DW_AT_call_all_tail_calls: 1
 <1><977>: Abbrev Number: 0
  Compilation Unit @ offset 0x978:
   Length:        0x4a3 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x25f
   Pointer Size:  4
 <0><984>: Abbrev Number: 15 (DW_TAG_compile_unit)
    <985>   DW_AT_producer    : (indirect string, offset: 0xefb47): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <989>   DW_AT_language    : 29	(C11)
    <98a>   DW_AT_name        : (indirect string, offset: 0xf4c20): ../Core/Src/gpio.c
    <98e>   DW_AT_comp_dir    : (indirect string, offset: 0x2d503): /Users/isabellalopiano/STM32CubeIDE/workspace_1.19.0/IS1300Project/Debug
    <992>   DW_AT_ranges      : 0x41
    <996>   DW_AT_low_pc      : 0
    <99a>   DW_AT_stmt_list   : 0xc8f
    <99e>   DW_AT_macros      : 0x260df
 <1><9a2>: Abbrev Number: 2 (DW_TAG_base_type)
    <9a3>   DW_AT_byte_size   : 1
    <9a4>   DW_AT_encoding    : 6	(signed char)
    <9a5>   DW_AT_name        : (indirect string, offset: 0x7a840): signed char
 <1><9a9>: Abbrev Number: 3 (DW_TAG_typedef)
    <9aa>   DW_AT_name        : (indirect string, offset: 0xf4c54): __uint8_t
    <9ae>   DW_AT_decl_file   : 2
    <9af>   DW_AT_decl_line   : 43
    <9b0>   DW_AT_decl_column : 24
    <9b1>   DW_AT_type        : <0x9b5>
 <1><9b5>: Abbrev Number: 2 (DW_TAG_base_type)
    <9b6>   DW_AT_byte_size   : 1
    <9b7>   DW_AT_encoding    : 8	(unsigned char)
    <9b8>   DW_AT_name        : (indirect string, offset: 0xeb588): unsigned char
 <1><9bc>: Abbrev Number: 2 (DW_TAG_base_type)
    <9bd>   DW_AT_byte_size   : 2
    <9be>   DW_AT_encoding    : 5	(signed)
    <9bf>   DW_AT_name        : (indirect string, offset: 0xb50ea): short int
 <1><9c3>: Abbrev Number: 3 (DW_TAG_typedef)
    <9c4>   DW_AT_name        : (indirect string, offset: 0xc736f): __uint16_t
    <9c8>   DW_AT_decl_file   : 2
    <9c9>   DW_AT_decl_line   : 57
    <9ca>   DW_AT_decl_column : 25
    <9cb>   DW_AT_type        : <0x9cf>
 <1><9cf>: Abbrev Number: 2 (DW_TAG_base_type)
    <9d0>   DW_AT_byte_size   : 2
    <9d1>   DW_AT_encoding    : 7	(unsigned)
    <9d2>   DW_AT_name        : (indirect string, offset: 0xe9b0f): short unsigned int
 <1><9d6>: Abbrev Number: 2 (DW_TAG_base_type)
    <9d7>   DW_AT_byte_size   : 4
    <9d8>   DW_AT_encoding    : 5	(signed)
    <9d9>   DW_AT_name        : (indirect string, offset: 0x14780): long int
 <1><9dd>: Abbrev Number: 3 (DW_TAG_typedef)
    <9de>   DW_AT_name        : (indirect string, offset: 0x9b9ae): __uint32_t
    <9e2>   DW_AT_decl_file   : 2
    <9e3>   DW_AT_decl_line   : 79
    <9e4>   DW_AT_decl_column : 25
    <9e5>   DW_AT_type        : <0x9e9>
 <1><9e9>: Abbrev Number: 2 (DW_TAG_base_type)
    <9ea>   DW_AT_byte_size   : 4
    <9eb>   DW_AT_encoding    : 7	(unsigned)
    <9ec>   DW_AT_name        : (indirect string, offset: 0x5cccb): long unsigned int
 <1><9f0>: Abbrev Number: 2 (DW_TAG_base_type)
    <9f1>   DW_AT_byte_size   : 8
    <9f2>   DW_AT_encoding    : 5	(signed)
    <9f3>   DW_AT_name        : (indirect string, offset: 0x6f1bd): long long int
 <1><9f7>: Abbrev Number: 2 (DW_TAG_base_type)
    <9f8>   DW_AT_byte_size   : 8
    <9f9>   DW_AT_encoding    : 7	(unsigned)
    <9fa>   DW_AT_name        : (indirect string, offset: 0x32a4c): long long unsigned int
 <1><9fe>: Abbrev Number: 16 (DW_TAG_base_type)
    <9ff>   DW_AT_byte_size   : 4
    <a00>   DW_AT_encoding    : 5	(signed)
    <a01>   DW_AT_name        : int
 <1><a05>: Abbrev Number: 2 (DW_TAG_base_type)
    <a06>   DW_AT_byte_size   : 4
    <a07>   DW_AT_encoding    : 7	(unsigned)
    <a08>   DW_AT_name        : (indirect string, offset: 0x13cd7): unsigned int
 <1><a0c>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0d>   DW_AT_name        : (indirect string, offset: 0xf4c56): uint8_t
    <a11>   DW_AT_decl_file   : 3
    <a12>   DW_AT_decl_line   : 24
    <a13>   DW_AT_decl_column : 19
    <a14>   DW_AT_type        : <0x9a9>
 <1><a18>: Abbrev Number: 3 (DW_TAG_typedef)
    <a19>   DW_AT_name        : (indirect string, offset: 0xfcd2): uint16_t
    <a1d>   DW_AT_decl_file   : 3
    <a1e>   DW_AT_decl_line   : 36
    <a1f>   DW_AT_decl_column : 20
    <a20>   DW_AT_type        : <0x9c3>
 <1><a24>: Abbrev Number: 3 (DW_TAG_typedef)
    <a25>   DW_AT_name        : (indirect string, offset: 0xb0ff0): uint32_t
    <a29>   DW_AT_decl_file   : 3
    <a2a>   DW_AT_decl_line   : 48
    <a2b>   DW_AT_decl_column : 20
    <a2c>   DW_AT_type        : <0x9dd>
 <1><a30>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <a31>   DW_AT_type        : <0xa24>
 <1><a35>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a36>   DW_AT_byte_size   : 48
    <a37>   DW_AT_decl_file   : 4
    <a37>   DW_AT_decl_line   : 531
    <a39>   DW_AT_decl_column : 9
    <a39>   DW_AT_sibling     : <0xac2>
 <2><a3d>: Abbrev Number: 1 (DW_TAG_member)
    <a3e>   DW_AT_name        : (indirect string, offset: 0x1851): MODER
    <a42>   DW_AT_decl_file   : 4
    <a42>   DW_AT_decl_line   : 533
    <a44>   DW_AT_decl_column : 17
    <a44>   DW_AT_type        : <0xa30>
    <a48>   DW_AT_data_member_location: 0
 <2><a49>: Abbrev Number: 1 (DW_TAG_member)
    <a4a>   DW_AT_name        : (indirect string, offset: 0xbc9fe): OTYPER
    <a4e>   DW_AT_decl_file   : 4
    <a4e>   DW_AT_decl_line   : 534
    <a50>   DW_AT_decl_column : 17
    <a50>   DW_AT_type        : <0xa30>
    <a54>   DW_AT_data_member_location: 4
 <2><a55>: Abbrev Number: 1 (DW_TAG_member)
    <a56>   DW_AT_name        : (indirect string, offset: 0xd42e5): OSPEEDR
    <a5a>   DW_AT_decl_file   : 4
    <a5a>   DW_AT_decl_line   : 535
    <a5c>   DW_AT_decl_column : 17
    <a5c>   DW_AT_type        : <0xa30>
    <a60>   DW_AT_data_member_location: 8
 <2><a61>: Abbrev Number: 1 (DW_TAG_member)
    <a62>   DW_AT_name        : (indirect string, offset: 0x9e107): PUPDR
    <a66>   DW_AT_decl_file   : 4
    <a66>   DW_AT_decl_line   : 536
    <a68>   DW_AT_decl_column : 17
    <a68>   DW_AT_type        : <0xa30>
    <a6c>   DW_AT_data_member_location: 12
 <2><a6d>: Abbrev Number: 4 (DW_TAG_member)
    <a6e>   DW_AT_name        : IDR
    <a72>   DW_AT_decl_file   : 4
    <a72>   DW_AT_decl_line   : 537
    <a74>   DW_AT_decl_column : 17
    <a74>   DW_AT_type        : <0xa30>
    <a78>   DW_AT_data_member_location: 16
 <2><a79>: Abbrev Number: 4 (DW_TAG_member)
    <a7a>   DW_AT_name        : ODR
    <a7e>   DW_AT_decl_file   : 4
    <a7e>   DW_AT_decl_line   : 538
    <a80>   DW_AT_decl_column : 17
    <a80>   DW_AT_type        : <0xa30>
    <a84>   DW_AT_data_member_location: 20
 <2><a85>: Abbrev Number: 1 (DW_TAG_member)
    <a86>   DW_AT_name        : (indirect string, offset: 0x9d3ba): BSRR
    <a8a>   DW_AT_decl_file   : 4
    <a8a>   DW_AT_decl_line   : 539
    <a8c>   DW_AT_decl_column : 17
    <a8c>   DW_AT_type        : <0xa30>
    <a90>   DW_AT_data_member_location: 24
 <2><a91>: Abbrev Number: 1 (DW_TAG_member)
    <a92>   DW_AT_name        : (indirect string, offset: 0xd13dc): LCKR
    <a96>   DW_AT_decl_file   : 4
    <a96>   DW_AT_decl_line   : 540
    <a98>   DW_AT_decl_column : 17
    <a98>   DW_AT_type        : <0xa30>
    <a9c>   DW_AT_data_member_location: 28
 <2><a9d>: Abbrev Number: 4 (DW_TAG_member)
    <a9e>   DW_AT_name        : AFR
    <aa2>   DW_AT_decl_file   : 4
    <aa2>   DW_AT_decl_line   : 541
    <aa4>   DW_AT_decl_column : 17
    <aa4>   DW_AT_type        : <0xad2>
    <aa8>   DW_AT_data_member_location: 32
 <2><aa9>: Abbrev Number: 4 (DW_TAG_member)
    <aaa>   DW_AT_name        : BRR
    <aae>   DW_AT_decl_file   : 4
    <aae>   DW_AT_decl_line   : 542
    <ab0>   DW_AT_decl_column : 17
    <ab0>   DW_AT_type        : <0xa30>
    <ab4>   DW_AT_data_member_location: 40
 <2><ab5>: Abbrev Number: 1 (DW_TAG_member)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x2a58): ASCR
    <aba>   DW_AT_decl_file   : 4
    <aba>   DW_AT_decl_line   : 543
    <abc>   DW_AT_decl_column : 17
    <abc>   DW_AT_type        : <0xa30>
    <ac0>   DW_AT_data_member_location: 44
 <2><ac1>: Abbrev Number: 0
 <1><ac2>: Abbrev Number: 17 (DW_TAG_array_type)
    <ac3>   DW_AT_type        : <0xa30>
    <ac7>   DW_AT_sibling     : <0xad2>
 <2><acb>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <acc>   DW_AT_type        : <0xa05>
    <ad0>   DW_AT_upper_bound : 1
 <2><ad1>: Abbrev Number: 0
 <1><ad2>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <ad3>   DW_AT_type        : <0xac2>
 <1><ad7>: Abbrev Number: 11 (DW_TAG_typedef)
    <ad8>   DW_AT_name        : (indirect string, offset: 0xecb85): GPIO_TypeDef
    <adc>   DW_AT_decl_file   : 4
    <adc>   DW_AT_decl_line   : 545
    <ade>   DW_AT_decl_column : 3
    <ade>   DW_AT_type        : <0xa35>
 <1><ae2>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ae3>   DW_AT_byte_size   : 152
    <ae4>   DW_AT_decl_file   : 4
    <ae4>   DW_AT_decl_line   : 685
    <ae6>   DW_AT_decl_column : 9
    <ae6>   DW_AT_sibling     : <0xcb2>
 <2><aea>: Abbrev Number: 4 (DW_TAG_member)
    <aeb>   DW_AT_name        : CR
    <aee>   DW_AT_decl_file   : 4
    <aee>   DW_AT_decl_line   : 687
    <af0>   DW_AT_decl_column : 17
    <af0>   DW_AT_type        : <0xa30>
    <af4>   DW_AT_data_member_location: 0
 <2><af5>: Abbrev Number: 1 (DW_TAG_member)
    <af6>   DW_AT_name        : (indirect string, offset: 0xf4cf0): ICSCR
    <afa>   DW_AT_decl_file   : 4
    <afa>   DW_AT_decl_line   : 688
    <afc>   DW_AT_decl_column : 17
    <afc>   DW_AT_type        : <0xa30>
    <b00>   DW_AT_data_member_location: 4
 <2><b01>: Abbrev Number: 1 (DW_TAG_member)
    <b02>   DW_AT_name        : (indirect string, offset: 0xf4c74): CFGR
    <b06>   DW_AT_decl_file   : 4
    <b06>   DW_AT_decl_line   : 689
    <b08>   DW_AT_decl_column : 17
    <b08>   DW_AT_type        : <0xa30>
    <b0c>   DW_AT_data_member_location: 8
 <2><b0d>: Abbrev Number: 1 (DW_TAG_member)
    <b0e>   DW_AT_name        : (indirect string, offset: 0xf4cf6): PLLCFGR
    <b12>   DW_AT_decl_file   : 4
    <b12>   DW_AT_decl_line   : 690
    <b14>   DW_AT_decl_column : 17
    <b14>   DW_AT_type        : <0xa30>
    <b18>   DW_AT_data_member_location: 12
 <2><b19>: Abbrev Number: 1 (DW_TAG_member)
    <b1a>   DW_AT_name        : (indirect string, offset: 0xf4c6d): PLLSAI1CFGR
    <b1e>   DW_AT_decl_file   : 4
    <b1e>   DW_AT_decl_line   : 691
    <b20>   DW_AT_decl_column : 17
    <b20>   DW_AT_type        : <0xa30>
    <b24>   DW_AT_data_member_location: 16
 <2><b25>: Abbrev Number: 1 (DW_TAG_member)
    <b26>   DW_AT_name        : (indirect string, offset: 0xf4cd7): PLLSAI2CFGR
    <b2a>   DW_AT_decl_file   : 4
    <b2a>   DW_AT_decl_line   : 692
    <b2c>   DW_AT_decl_column : 17
    <b2c>   DW_AT_type        : <0xa30>
    <b30>   DW_AT_data_member_location: 20
 <2><b31>: Abbrev Number: 1 (DW_TAG_member)
    <b32>   DW_AT_name        : (indirect string, offset: 0xf4bc3): CIER
    <b36>   DW_AT_decl_file   : 4
    <b36>   DW_AT_decl_line   : 693
    <b38>   DW_AT_decl_column : 17
    <b38>   DW_AT_type        : <0xa30>
    <b3c>   DW_AT_data_member_location: 24
 <2><b3d>: Abbrev Number: 1 (DW_TAG_member)
    <b3e>   DW_AT_name        : (indirect string, offset: 0xf4bc8): CIFR
    <b42>   DW_AT_decl_file   : 4
    <b42>   DW_AT_decl_line   : 694
    <b44>   DW_AT_decl_column : 17
    <b44>   DW_AT_type        : <0xa30>
    <b48>   DW_AT_data_member_location: 28
 <2><b49>: Abbrev Number: 1 (DW_TAG_member)
    <b4a>   DW_AT_name        : (indirect string, offset: 0xf4bbe): CICR
    <b4e>   DW_AT_decl_file   : 4
    <b4e>   DW_AT_decl_line   : 695
    <b50>   DW_AT_decl_column : 17
    <b50>   DW_AT_type        : <0xa30>
    <b54>   DW_AT_data_member_location: 32
 <2><b55>: Abbrev Number: 1 (DW_TAG_member)
    <b56>   DW_AT_name        : (indirect string, offset: 0xf4d4f): RESERVED0
    <b5a>   DW_AT_decl_file   : 4
    <b5a>   DW_AT_decl_line   : 696
    <b5c>   DW_AT_decl_column : 17
    <b5c>   DW_AT_type        : <0xa24>
    <b60>   DW_AT_data_member_location: 36
 <2><b61>: Abbrev Number: 1 (DW_TAG_member)
    <b62>   DW_AT_name        : (indirect string, offset: 0xf4d0f): AHB1RSTR
    <b66>   DW_AT_decl_file   : 4
    <b66>   DW_AT_decl_line   : 697
    <b68>   DW_AT_decl_column : 17
    <b68>   DW_AT_type        : <0xa30>
    <b6c>   DW_AT_data_member_location: 40
 <2><b6d>: Abbrev Number: 1 (DW_TAG_member)
    <b6e>   DW_AT_name        : (indirect string, offset: 0xf4c17): AHB2RSTR
    <b72>   DW_AT_decl_file   : 4
    <b72>   DW_AT_decl_line   : 698
    <b74>   DW_AT_decl_column : 17
    <b74>   DW_AT_type        : <0xa30>
    <b78>   DW_AT_data_member_location: 44
 <2><b79>: Abbrev Number: 1 (DW_TAG_member)
    <b7a>   DW_AT_name        : (indirect string, offset: 0xf4c64): AHB3RSTR
    <b7e>   DW_AT_decl_file   : 4
    <b7e>   DW_AT_decl_line   : 699
    <b80>   DW_AT_decl_column : 17
    <b80>   DW_AT_type        : <0xa30>
    <b84>   DW_AT_data_member_location: 48
 <2><b85>: Abbrev Number: 1 (DW_TAG_member)
    <b86>   DW_AT_name        : (indirect string, offset: 0xf4d59): RESERVED1
    <b8a>   DW_AT_decl_file   : 4
    <b8a>   DW_AT_decl_line   : 700
    <b8c>   DW_AT_decl_column : 17
    <b8c>   DW_AT_type        : <0xa24>
    <b90>   DW_AT_data_member_location: 52
 <2><b91>: Abbrev Number: 1 (DW_TAG_member)
    <b92>   DW_AT_name        : (indirect string, offset: 0xf4c33): APB1RSTR1
    <b96>   DW_AT_decl_file   : 4
    <b96>   DW_AT_decl_line   : 701
    <b98>   DW_AT_decl_column : 17
    <b98>   DW_AT_type        : <0xa30>
    <b9c>   DW_AT_data_member_location: 56
 <2><b9d>: Abbrev Number: 1 (DW_TAG_member)
    <b9e>   DW_AT_name        : (indirect string, offset: 0xf4c3d): APB1RSTR2
    <ba2>   DW_AT_decl_file   : 4
    <ba2>   DW_AT_decl_line   : 702
    <ba4>   DW_AT_decl_column : 17
    <ba4>   DW_AT_type        : <0xa30>
    <ba8>   DW_AT_data_member_location: 60
 <2><ba9>: Abbrev Number: 1 (DW_TAG_member)
    <baa>   DW_AT_name        : (indirect string, offset: 0xf4c83): APB2RSTR
    <bae>   DW_AT_decl_file   : 4
    <bae>   DW_AT_decl_line   : 703
    <bb0>   DW_AT_decl_column : 17
    <bb0>   DW_AT_type        : <0xa30>
    <bb4>   DW_AT_data_member_location: 64
 <2><bb5>: Abbrev Number: 1 (DW_TAG_member)
    <bb6>   DW_AT_name        : (indirect string, offset: 0xf4d63): RESERVED2
    <bba>   DW_AT_decl_file   : 4
    <bba>   DW_AT_decl_line   : 704
    <bbc>   DW_AT_decl_column : 17
    <bbc>   DW_AT_type        : <0xa24>
    <bc0>   DW_AT_data_member_location: 68
 <2><bc1>: Abbrev Number: 1 (DW_TAG_member)
    <bc2>   DW_AT_name        : (indirect string, offset: 0xf4bf5): AHB1ENR
    <bc6>   DW_AT_decl_file   : 4
    <bc6>   DW_AT_decl_line   : 705
    <bc8>   DW_AT_decl_column : 17
    <bc8>   DW_AT_type        : <0xa30>
    <bcc>   DW_AT_data_member_location: 72
 <2><bcd>: Abbrev Number: 1 (DW_TAG_member)
    <bce>   DW_AT_name        : (indirect string, offset: 0xf4c4c): AHB2ENR
    <bd2>   DW_AT_decl_file   : 4
    <bd2>   DW_AT_decl_line   : 706
    <bd4>   DW_AT_decl_column : 17
    <bd4>   DW_AT_type        : <0xa30>
    <bd8>   DW_AT_data_member_location: 76
 <2><bd9>: Abbrev Number: 1 (DW_TAG_member)
    <bda>   DW_AT_name        : (indirect string, offset: 0xf4c8c): AHB3ENR
    <bde>   DW_AT_decl_file   : 4
    <bde>   DW_AT_decl_line   : 707
    <be0>   DW_AT_decl_column : 17
    <be0>   DW_AT_type        : <0xa30>
    <be4>   DW_AT_data_member_location: 80
 <2><be5>: Abbrev Number: 1 (DW_TAG_member)
    <be6>   DW_AT_name        : (indirect string, offset: 0xf4d6d): RESERVED3
    <bea>   DW_AT_decl_file   : 4
    <bea>   DW_AT_decl_line   : 708
    <bec>   DW_AT_decl_column : 17
    <bec>   DW_AT_type        : <0xa24>
    <bf0>   DW_AT_data_member_location: 84
 <2><bf1>: Abbrev Number: 1 (DW_TAG_member)
    <bf2>   DW_AT_name        : (indirect string, offset: 0xf4bcd): APB1ENR1
    <bf6>   DW_AT_decl_file   : 4
    <bf6>   DW_AT_decl_line   : 709
    <bf8>   DW_AT_decl_column : 17
    <bf8>   DW_AT_type        : <0xa30>
    <bfc>   DW_AT_data_member_location: 88
 <2><bfd>: Abbrev Number: 1 (DW_TAG_member)
    <bfe>   DW_AT_name        : (indirect string, offset: 0xf4bd6): APB1ENR2
    <c02>   DW_AT_decl_file   : 4
    <c02>   DW_AT_decl_line   : 710
    <c04>   DW_AT_decl_column : 17
    <c04>   DW_AT_type        : <0xa30>
    <c08>   DW_AT_data_member_location: 92
 <2><c09>: Abbrev Number: 1 (DW_TAG_member)
    <c0a>   DW_AT_name        : (indirect string, offset: 0xf4bfd): APB2ENR
    <c0e>   DW_AT_decl_file   : 4
    <c0e>   DW_AT_decl_line   : 711
    <c10>   DW_AT_decl_column : 17
    <c10>   DW_AT_type        : <0xa30>
    <c14>   DW_AT_data_member_location: 96
 <2><c15>: Abbrev Number: 1 (DW_TAG_member)
    <c16>   DW_AT_name        : (indirect string, offset: 0xf4cb9): RESERVED4
    <c1a>   DW_AT_decl_file   : 4
    <c1a>   DW_AT_decl_line   : 712
    <c1c>   DW_AT_decl_column : 17
    <c1c>   DW_AT_type        : <0xa24>
    <c20>   DW_AT_data_member_location: 100
 <2><c21>: Abbrev Number: 1 (DW_TAG_member)
    <c22>   DW_AT_name        : (indirect string, offset: 0xf4c9e): AHB1SMENR
    <c26>   DW_AT_decl_file   : 4
    <c26>   DW_AT_decl_line   : 713
    <c28>   DW_AT_decl_column : 17
    <c28>   DW_AT_type        : <0xa30>
    <c2c>   DW_AT_data_member_location: 104
 <2><c2d>: Abbrev Number: 1 (DW_TAG_member)
    <c2e>   DW_AT_name        : (indirect string, offset: 0xf4d39): AHB2SMENR
    <c32>   DW_AT_decl_file   : 4
    <c32>   DW_AT_decl_line   : 714
    <c34>   DW_AT_decl_column : 17
    <c34>   DW_AT_type        : <0xa30>
    <c38>   DW_AT_data_member_location: 108
 <2><c39>: Abbrev Number: 1 (DW_TAG_member)
    <c3a>   DW_AT_name        : (indirect string, offset: 0xf4c79): AHB3SMENR
    <c3e>   DW_AT_decl_file   : 4
    <c3e>   DW_AT_decl_line   : 715
    <c40>   DW_AT_decl_column : 17
    <c40>   DW_AT_type        : <0xa30>
    <c44>   DW_AT_data_member_location: 112
 <2><c45>: Abbrev Number: 1 (DW_TAG_member)
    <c46>   DW_AT_name        : (indirect string, offset: 0xf4d77): RESERVED5
    <c4a>   DW_AT_decl_file   : 4
    <c4a>   DW_AT_decl_line   : 716
    <c4c>   DW_AT_decl_column : 17
    <c4c>   DW_AT_type        : <0xa24>
    <c50>   DW_AT_data_member_location: 116
 <2><c51>: Abbrev Number: 1 (DW_TAG_member)
    <c52>   DW_AT_name        : (indirect string, offset: 0xf4bdf): APB1SMENR1
    <c56>   DW_AT_decl_file   : 4
    <c56>   DW_AT_decl_line   : 717
    <c58>   DW_AT_decl_column : 17
    <c58>   DW_AT_type        : <0xa30>
    <c5c>   DW_AT_data_member_location: 120
 <2><c5d>: Abbrev Number: 1 (DW_TAG_member)
    <c5e>   DW_AT_name        : (indirect string, offset: 0xf4bea): APB1SMENR2
    <c62>   DW_AT_decl_file   : 4
    <c62>   DW_AT_decl_line   : 718
    <c64>   DW_AT_decl_column : 17
    <c64>   DW_AT_type        : <0xa30>
    <c68>   DW_AT_data_member_location: 124
 <2><c69>: Abbrev Number: 1 (DW_TAG_member)
    <c6a>   DW_AT_name        : (indirect string, offset: 0xf4d28): APB2SMENR
    <c6e>   DW_AT_decl_file   : 4
    <c6e>   DW_AT_decl_line   : 719
    <c70>   DW_AT_decl_column : 17
    <c70>   DW_AT_type        : <0xa30>
    <c74>   DW_AT_data_member_location: 128
 <2><c75>: Abbrev Number: 1 (DW_TAG_member)
    <c76>   DW_AT_name        : (indirect string, offset: 0xf4d81): RESERVED6
    <c7a>   DW_AT_decl_file   : 4
    <c7a>   DW_AT_decl_line   : 720
    <c7c>   DW_AT_decl_column : 17
    <c7c>   DW_AT_type        : <0xa24>
    <c80>   DW_AT_data_member_location: 132
 <2><c81>: Abbrev Number: 1 (DW_TAG_member)
    <c82>   DW_AT_name        : (indirect string, offset: 0xf4c5e): CCIPR
    <c86>   DW_AT_decl_file   : 4
    <c86>   DW_AT_decl_line   : 721
    <c88>   DW_AT_decl_column : 17
    <c88>   DW_AT_type        : <0xa30>
    <c8c>   DW_AT_data_member_location: 136
 <2><c8d>: Abbrev Number: 1 (DW_TAG_member)
    <c8e>   DW_AT_name        : (indirect string, offset: 0xf4d8b): RESERVED7
    <c92>   DW_AT_decl_file   : 4
    <c92>   DW_AT_decl_line   : 722
    <c94>   DW_AT_decl_column : 17
    <c94>   DW_AT_type        : <0xa24>
    <c98>   DW_AT_data_member_location: 140
 <2><c99>: Abbrev Number: 1 (DW_TAG_member)
    <c9a>   DW_AT_name        : (indirect string, offset: 0xf4c47): BDCR
    <c9e>   DW_AT_decl_file   : 4
    <c9e>   DW_AT_decl_line   : 723
    <ca0>   DW_AT_decl_column : 17
    <ca0>   DW_AT_type        : <0xa30>
    <ca4>   DW_AT_data_member_location: 144
 <2><ca5>: Abbrev Number: 4 (DW_TAG_member)
    <ca6>   DW_AT_name        : CSR
    <caa>   DW_AT_decl_file   : 4
    <caa>   DW_AT_decl_line   : 724
    <cac>   DW_AT_decl_column : 17
    <cac>   DW_AT_type        : <0xa30>
    <cb0>   DW_AT_data_member_location: 148
 <2><cb1>: Abbrev Number: 0
 <1><cb2>: Abbrev Number: 11 (DW_TAG_typedef)
    <cb3>   DW_AT_name        : (indirect string, offset: 0xf4ca8): RCC_TypeDef
    <cb7>   DW_AT_decl_file   : 4
    <cb7>   DW_AT_decl_line   : 725
    <cb9>   DW_AT_decl_column : 3
    <cb9>   DW_AT_type        : <0xae2>
 <1><cbd>: Abbrev Number: 2 (DW_TAG_base_type)
    <cbe>   DW_AT_byte_size   : 8
    <cbf>   DW_AT_encoding    : 4	(float)
    <cc0>   DW_AT_name        : (indirect string, offset: 0x16408): long double
 <1><cc4>: Abbrev Number: 19 (DW_TAG_structure_type)
    <cc5>   DW_AT_byte_size   : 20
    <cc6>   DW_AT_decl_file   : 5
    <cc7>   DW_AT_decl_line   : 46
    <cc8>   DW_AT_decl_column : 9
    <cc9>   DW_AT_sibling     : <0xd07>
 <2><ccd>: Abbrev Number: 20 (DW_TAG_member)
    <cce>   DW_AT_name        : Pin
    <cd2>   DW_AT_decl_file   : 5
    <cd3>   DW_AT_decl_line   : 48
    <cd4>   DW_AT_decl_column : 12
    <cd5>   DW_AT_type        : <0xa24>
    <cd9>   DW_AT_data_member_location: 0
 <2><cda>: Abbrev Number: 7 (DW_TAG_member)
    <cdb>   DW_AT_name        : (indirect string, offset: 0xf71f9): Mode
    <cdf>   DW_AT_decl_file   : 5
    <cdf>   DW_AT_decl_line   : 51
    <ce0>   DW_AT_decl_column : 12
    <ce0>   DW_AT_type        : <0xa24>
    <ce4>   DW_AT_data_member_location: 4
 <2><ce5>: Abbrev Number: 7 (DW_TAG_member)
    <ce6>   DW_AT_name        : (indirect string, offset: 0xf4cb4): Pull
    <cea>   DW_AT_decl_file   : 5
    <cea>   DW_AT_decl_line   : 54
    <ceb>   DW_AT_decl_column : 12
    <ceb>   DW_AT_type        : <0xa24>
    <cef>   DW_AT_data_member_location: 8
 <2><cf0>: Abbrev Number: 7 (DW_TAG_member)
    <cf1>   DW_AT_name        : (indirect string, offset: 0xf4cc3): Speed
    <cf5>   DW_AT_decl_file   : 5
    <cf5>   DW_AT_decl_line   : 57
    <cf6>   DW_AT_decl_column : 12
    <cf6>   DW_AT_type        : <0xa24>
    <cfa>   DW_AT_data_member_location: 12
 <2><cfb>: Abbrev Number: 7 (DW_TAG_member)
    <cfc>   DW_AT_name        : (indirect string, offset: 0xf4c94): Alternate
    <d00>   DW_AT_decl_file   : 5
    <d00>   DW_AT_decl_line   : 60
    <d01>   DW_AT_decl_column : 12
    <d01>   DW_AT_type        : <0xa24>
    <d05>   DW_AT_data_member_location: 16
 <2><d06>: Abbrev Number: 0
 <1><d07>: Abbrev Number: 3 (DW_TAG_typedef)
    <d08>   DW_AT_name        : (indirect string, offset: 0xf4cfe): GPIO_InitTypeDef
    <d0c>   DW_AT_decl_file   : 5
    <d0d>   DW_AT_decl_line   : 62
    <d0e>   DW_AT_decl_column : 3
    <d0f>   DW_AT_type        : <0xcc4>
 <1><d13>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <d14>   DW_AT_encoding    : 7	(unsigned)
    <d15>   DW_AT_byte_size   : 1
    <d16>   DW_AT_type        : <0x9b5>
    <d1a>   DW_AT_decl_file   : 5
    <d1b>   DW_AT_decl_line   : 68
    <d1c>   DW_AT_decl_column : 1
    <d1d>   DW_AT_sibling     : <0xd2e>
 <2><d21>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d22>   DW_AT_name        : (indirect string, offset: 0x324d5): GPIO_PIN_RESET
    <d26>   DW_AT_const_value : 0
 <2><d27>: Abbrev Number: 12 (DW_TAG_enumerator)
    <d28>   DW_AT_name        : (indirect string, offset: 0x3d1ce): GPIO_PIN_SET
    <d2c>   DW_AT_const_value : 1
 <2><d2d>: Abbrev Number: 0
 <1><d2e>: Abbrev Number: 3 (DW_TAG_typedef)
    <d2f>   DW_AT_name        : (indirect string, offset: 0xef981): GPIO_PinState
    <d33>   DW_AT_decl_file   : 5
    <d34>   DW_AT_decl_line   : 71
    <d35>   DW_AT_decl_column : 3
    <d36>   DW_AT_type        : <0xd13>
 <1><d3a>: Abbrev Number: 13 (DW_TAG_subprogram)
    <d3b>   DW_AT_external    : 1
    <d3b>   DW_AT_name        : (indirect string, offset: 0xf4cc9): HAL_GPIO_Init
    <d3f>   DW_AT_decl_file   : 5
    <d3f>   DW_AT_decl_line   : 283
    <d41>   DW_AT_decl_column : 19
    <d41>   DW_AT_prototyped  : 1
    <d41>   DW_AT_declaration : 1
    <d41>   DW_AT_sibling     : <0xd50>
 <2><d45>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <d46>   DW_AT_type        : <0xd50>
 <2><d4a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <d4b>   DW_AT_type        : <0xd55>
 <2><d4f>: Abbrev Number: 0
 <1><d50>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <d51>   DW_AT_byte_size   : 4
    <d51>   DW_AT_type        : <0xad7>
 <1><d55>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <d56>   DW_AT_byte_size   : 4
    <d56>   DW_AT_type        : <0xd07>
 <1><d5a>: Abbrev Number: 13 (DW_TAG_subprogram)
    <d5b>   DW_AT_external    : 1
    <d5b>   DW_AT_name        : (indirect string, offset: 0xf4c05): HAL_GPIO_WritePin
    <d5f>   DW_AT_decl_file   : 5
    <d5f>   DW_AT_decl_line   : 296
    <d61>   DW_AT_decl_column : 19
    <d61>   DW_AT_prototyped  : 1
    <d61>   DW_AT_declaration : 1
    <d61>   DW_AT_sibling     : <0xd75>
 <2><d65>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <d66>   DW_AT_type        : <0xd50>
 <2><d6a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <d6b>   DW_AT_type        : <0xa18>
 <2><d6f>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <d70>   DW_AT_type        : <0xd2e>
 <2><d74>: Abbrev Number: 0
 <1><d75>: Abbrev Number: 22 (DW_TAG_subprogram)
    <d76>   DW_AT_external    : 1
    <d76>   DW_AT_name        : (indirect string, offset: 0xf4ce3): MX_GPIO_Init
    <d7a>   DW_AT_decl_file   : 1
    <d7b>   DW_AT_decl_line   : 45
    <d7c>   DW_AT_decl_column : 6
    <d7d>   DW_AT_prototyped  : 1
    <d7d>   DW_AT_low_pc      : 0x8000a18
    <d81>   DW_AT_high_pc     : 0x20c
    <d85>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d87>   DW_AT_call_all_tail_calls: 1
 <2><d87>: Abbrev Number: 5 (DW_TAG_variable)
    <d88>   DW_AT_name        : (indirect string, offset: 0xf4d18): GPIO_InitStruct
    <d8c>   DW_AT_decl_file   : 1
    <d8c>   DW_AT_decl_line   : 48
    <d8d>   DW_AT_decl_column : 20
    <d8e>   DW_AT_type        : <0xd07>
    <d92>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><d95>: Abbrev Number: 8 (DW_TAG_lexical_block)
    <d96>   DW_AT_low_pc      : 0x8000a2e
    <d9a>   DW_AT_high_pc     : 0x18
    <d9e>   DW_AT_sibling     : <0xdb1>
 <3><da2>: Abbrev Number: 5 (DW_TAG_variable)
    <da3>   DW_AT_name        : (indirect string, offset: 0xf4d32): tmpreg
    <da7>   DW_AT_decl_file   : 1
    <da7>   DW_AT_decl_line   : 51
    <da8>   DW_AT_decl_column : 3
    <da9>   DW_AT_type        : <0xa30>
    <dad>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><db0>: Abbrev Number: 0
 <2><db1>: Abbrev Number: 8 (DW_TAG_lexical_block)
    <db2>   DW_AT_low_pc      : 0x8000a46
    <db6>   DW_AT_high_pc     : 0x18
    <dba>   DW_AT_sibling     : <0xdcd>
 <3><dbe>: Abbrev Number: 5 (DW_TAG_variable)
    <dbf>   DW_AT_name        : (indirect string, offset: 0xf4d32): tmpreg
    <dc3>   DW_AT_decl_file   : 1
    <dc3>   DW_AT_decl_line   : 52
    <dc4>   DW_AT_decl_column : 3
    <dc5>   DW_AT_type        : <0xa30>
    <dc9>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><dcc>: Abbrev Number: 0
 <2><dcd>: Abbrev Number: 8 (DW_TAG_lexical_block)
    <dce>   DW_AT_low_pc      : 0x8000a5e
    <dd2>   DW_AT_high_pc     : 0x18
    <dd6>   DW_AT_sibling     : <0xde9>
 <3><dda>: Abbrev Number: 5 (DW_TAG_variable)
    <ddb>   DW_AT_name        : (indirect string, offset: 0xf4d32): tmpreg
    <ddf>   DW_AT_decl_file   : 1
    <ddf>   DW_AT_decl_line   : 53
    <de0>   DW_AT_decl_column : 3
    <de1>   DW_AT_type        : <0xa30>
    <de5>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><de8>: Abbrev Number: 0
 <2><de9>: Abbrev Number: 8 (DW_TAG_lexical_block)
    <dea>   DW_AT_low_pc      : 0x8000a76
    <dee>   DW_AT_high_pc     : 0x18
    <df2>   DW_AT_sibling     : <0xe05>
 <3><df6>: Abbrev Number: 5 (DW_TAG_variable)
    <df7>   DW_AT_name        : (indirect string, offset: 0xf4d32): tmpreg
    <dfb>   DW_AT_decl_file   : 1
    <dfb>   DW_AT_decl_line   : 54
    <dfc>   DW_AT_decl_column : 3
    <dfd>   DW_AT_type        : <0xa30>
    <e01>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <3><e04>: Abbrev Number: 0
 <2><e05>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <e06>   DW_AT_low_pc      : 0x8000a8e
    <e0a>   DW_AT_high_pc     : 0x18
 <3><e0e>: Abbrev Number: 5 (DW_TAG_variable)
    <e0f>   DW_AT_name        : (indirect string, offset: 0xf4d32): tmpreg
    <e13>   DW_AT_decl_file   : 1
    <e13>   DW_AT_decl_line   : 55
    <e14>   DW_AT_decl_column : 3
    <e15>   DW_AT_type        : <0xa30>
    <e19>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <3><e1c>: Abbrev Number: 0
 <2><e1d>: Abbrev Number: 0
 <1><e1e>: Abbrev Number: 0
  Compilation Unit @ offset 0xe1f:
   Length:        0x96e (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x3b1
   Pointer Size:  4
 <0><e2b>: Abbrev Number: 23 (DW_TAG_compile_unit)
    <e2c>   DW_AT_producer    : (indirect string, offset: 0xefb47): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <e30>   DW_AT_language    : 29	(C11)
    <e31>   DW_AT_name        : (indirect string, offset: 0xf53c8): ../Core/Src/main.c
    <e35>   DW_AT_comp_dir    : (indirect string, offset: 0x2d503): /Users/isabellalopiano/STM32CubeIDE/workspace_1.19.0/IS1300Project/Debug
    <e39>   DW_AT_ranges      : 0x55
    <e3d>   DW_AT_low_pc      : 0
    <e41>   DW_AT_stmt_list   : 0x1438
    <e45>   DW_AT_macros      : 0x26333
 <1><e49>: Abbrev Number: 6 (DW_TAG_base_type)
    <e4a>   DW_AT_byte_size   : 1
    <e4b>   DW_AT_encoding    : 6	(signed char)
    <e4c>   DW_AT_name        : (indirect string, offset: 0x7a840): signed char
 <1><e50>: Abbrev Number: 6 (DW_TAG_base_type)
    <e51>   DW_AT_byte_size   : 1
    <e52>   DW_AT_encoding    : 8	(unsigned char)
    <e53>   DW_AT_name        : (indirect string, offset: 0xeb588): unsigned char
 <1><e57>: Abbrev Number: 6 (DW_TAG_base_type)
    <e58>   DW_AT_byte_size   : 2
    <e59>   DW_AT_encoding    : 5	(signed)
    <e5a>   DW_AT_name        : (indirect string, offset: 0xb50ea): short int
 <1><e5e>: Abbrev Number: 6 (DW_TAG_base_type)
    <e5f>   DW_AT_byte_size   : 2
    <e60>   DW_AT_encoding    : 7	(unsigned)
    <e61>   DW_AT_name        : (indirect string, offset: 0xe9b0f): short unsigned int
 <1><e65>: Abbrev Number: 6 (DW_TAG_base_type)
    <e66>   DW_AT_byte_size   : 4
    <e67>   DW_AT_encoding    : 5	(signed)
    <e68>   DW_AT_name        : (indirect string, offset: 0x14780): long int
 <1><e6c>: Abbrev Number: 5 (DW_TAG_typedef)
    <e6d>   DW_AT_name        : (indirect string, offset: 0x9b9ae): __uint32_t
    <e71>   DW_AT_decl_file   : 3
    <e72>   DW_AT_decl_line   : 79
    <e73>   DW_AT_decl_column : 25
    <e74>   DW_AT_type        : <0xe78>
 <1><e78>: Abbrev Number: 6 (DW_TAG_base_type)
    <e79>   DW_AT_byte_size   : 4
    <e7a>   DW_AT_encoding    : 7	(unsigned)
    <e7b>   DW_AT_name        : (indirect string, offset: 0x5cccb): long unsigned int
 <1><e7f>: Abbrev Number: 6 (DW_TAG_base_type)
    <e80>   DW_AT_byte_size   : 8
    <e81>   DW_AT_encoding    : 5	(signed)
    <e82>   DW_AT_name        : (indirect string, offset: 0x6f1bd): long long int
 <1><e86>: Abbrev Number: 6 (DW_TAG_base_type)
    <e87>   DW_AT_byte_size   : 8
    <e88>   DW_AT_encoding    : 7	(unsigned)
    <e89>   DW_AT_name        : (indirect string, offset: 0x32a4c): long long unsigned int
 <1><e8d>: Abbrev Number: 24 (DW_TAG_base_type)
    <e8e>   DW_AT_byte_size   : 4
    <e8f>   DW_AT_encoding    : 5	(signed)
    <e90>   DW_AT_name        : int
 <1><e94>: Abbrev Number: 6 (DW_TAG_base_type)
    <e95>   DW_AT_byte_size   : 4
    <e96>   DW_AT_encoding    : 7	(unsigned)
    <e97>   DW_AT_name        : (indirect string, offset: 0x13cd7): unsigned int
 <1><e9b>: Abbrev Number: 5 (DW_TAG_typedef)
    <e9c>   DW_AT_name        : (indirect string, offset: 0xb0ff0): uint32_t
    <ea0>   DW_AT_decl_file   : 4
    <ea1>   DW_AT_decl_line   : 48
    <ea2>   DW_AT_decl_column : 20
    <ea3>   DW_AT_type        : <0xe6c>
 <1><ea7>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <ea8>   DW_AT_type        : <0xe9b>
 <1><eac>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ead>   DW_AT_byte_size   : 16
    <eae>   DW_AT_decl_file   : 5
    <eaf>   DW_AT_decl_line   : 404
    <eb1>   DW_AT_decl_column : 9
    <eb1>   DW_AT_sibling     : <0xeec>
 <2><eb5>: Abbrev Number: 4 (DW_TAG_member)
    <eb6>   DW_AT_name        : CCR
    <eba>   DW_AT_decl_file   : 5
    <eba>   DW_AT_decl_line   : 406
    <ebc>   DW_AT_decl_column : 17
    <ebc>   DW_AT_type        : <0xea7>
    <ec0>   DW_AT_data_member_location: 0
 <2><ec1>: Abbrev Number: 3 (DW_TAG_member)
    <ec2>   DW_AT_name        : (indirect string, offset: 0xf51eb): CNDTR
    <ec6>   DW_AT_decl_file   : 5
    <ec7>   DW_AT_decl_line   : 407
    <ec9>   DW_AT_decl_column : 17
    <eca>   DW_AT_type        : <0xea7>
    <ece>   DW_AT_data_member_location: 4
 <2><ecf>: Abbrev Number: 3 (DW_TAG_member)
    <ed0>   DW_AT_name        : (indirect string, offset: 0xf543b): CPAR
    <ed4>   DW_AT_decl_file   : 5
    <ed5>   DW_AT_decl_line   : 408
    <ed7>   DW_AT_decl_column : 17
    <ed8>   DW_AT_type        : <0xea7>
    <edc>   DW_AT_data_member_location: 8
 <2><edd>: Abbrev Number: 3 (DW_TAG_member)
    <ede>   DW_AT_name        : (indirect string, offset: 0xf50ec): CMAR
    <ee2>   DW_AT_decl_file   : 5
    <ee3>   DW_AT_decl_line   : 409
    <ee5>   DW_AT_decl_column : 17
    <ee6>   DW_AT_type        : <0xea7>
    <eea>   DW_AT_data_member_location: 12
 <2><eeb>: Abbrev Number: 0
 <1><eec>: Abbrev Number: 8 (DW_TAG_typedef)
    <eed>   DW_AT_name        : (indirect string, offset: 0xf541b): DMA_Channel_TypeDef
    <ef1>   DW_AT_decl_file   : 5
    <ef2>   DW_AT_decl_line   : 410
    <ef4>   DW_AT_decl_column : 3
    <ef4>   DW_AT_type        : <0xeac>
 <1><ef8>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ef9>   DW_AT_byte_size   : 8
    <efa>   DW_AT_decl_file   : 5
    <efb>   DW_AT_decl_line   : 412
    <efd>   DW_AT_decl_column : 9
    <efd>   DW_AT_sibling     : <0xf1c>
 <2><f01>: Abbrev Number: 4 (DW_TAG_member)
    <f02>   DW_AT_name        : ISR
    <f06>   DW_AT_decl_file   : 5
    <f06>   DW_AT_decl_line   : 414
    <f08>   DW_AT_decl_column : 17
    <f08>   DW_AT_type        : <0xea7>
    <f0c>   DW_AT_data_member_location: 0
 <2><f0d>: Abbrev Number: 3 (DW_TAG_member)
    <f0e>   DW_AT_name        : (indirect string, offset: 0xf525c): IFCR
    <f12>   DW_AT_decl_file   : 5
    <f13>   DW_AT_decl_line   : 415
    <f15>   DW_AT_decl_column : 17
    <f16>   DW_AT_type        : <0xea7>
    <f1a>   DW_AT_data_member_location: 4
 <2><f1b>: Abbrev Number: 0
 <1><f1c>: Abbrev Number: 8 (DW_TAG_typedef)
    <f1d>   DW_AT_name        : (indirect string, offset: 0xf4fa5): DMA_TypeDef
    <f21>   DW_AT_decl_file   : 5
    <f22>   DW_AT_decl_line   : 416
    <f24>   DW_AT_decl_column : 3
    <f24>   DW_AT_type        : <0xef8>
 <1><f28>: Abbrev Number: 13 (DW_TAG_structure_type)
    <f29>   DW_AT_byte_size   : 104
    <f2a>   DW_AT_decl_file   : 5
    <f2b>   DW_AT_decl_line   : 893
    <f2d>   DW_AT_decl_column : 9
    <f2d>   DW_AT_sibling     : <0x1085>
 <2><f31>: Abbrev Number: 4 (DW_TAG_member)
    <f32>   DW_AT_name        : CR1
    <f36>   DW_AT_decl_file   : 5
    <f36>   DW_AT_decl_line   : 895
    <f38>   DW_AT_decl_column : 17
    <f38>   DW_AT_type        : <0xea7>
    <f3c>   DW_AT_data_member_location: 0
 <2><f3d>: Abbrev Number: 4 (DW_TAG_member)
    <f3e>   DW_AT_name        : CR2
    <f42>   DW_AT_decl_file   : 5
    <f42>   DW_AT_decl_line   : 896
    <f44>   DW_AT_decl_column : 17
    <f44>   DW_AT_type        : <0xea7>
    <f48>   DW_AT_data_member_location: 4
 <2><f49>: Abbrev Number: 3 (DW_TAG_member)
    <f4a>   DW_AT_name        : (indirect string, offset: 0x60e8): SMCR
    <f4e>   DW_AT_decl_file   : 5
    <f4f>   DW_AT_decl_line   : 897
    <f51>   DW_AT_decl_column : 17
    <f52>   DW_AT_type        : <0xea7>
    <f56>   DW_AT_data_member_location: 8
 <2><f57>: Abbrev Number: 3 (DW_TAG_member)
    <f58>   DW_AT_name        : (indirect string, offset: 0x4e43a): DIER
    <f5c>   DW_AT_decl_file   : 5
    <f5d>   DW_AT_decl_line   : 898
    <f5f>   DW_AT_decl_column : 17
    <f60>   DW_AT_type        : <0xea7>
    <f64>   DW_AT_data_member_location: 12
 <2><f65>: Abbrev Number: 4 (DW_TAG_member)
    <f66>   DW_AT_name        : SR
    <f69>   DW_AT_decl_file   : 5
    <f69>   DW_AT_decl_line   : 899
    <f6b>   DW_AT_decl_column : 17
    <f6b>   DW_AT_type        : <0xea7>
    <f6f>   DW_AT_data_member_location: 16
 <2><f70>: Abbrev Number: 4 (DW_TAG_member)
    <f71>   DW_AT_name        : EGR
    <f75>   DW_AT_decl_file   : 5
    <f75>   DW_AT_decl_line   : 900
    <f77>   DW_AT_decl_column : 17
    <f77>   DW_AT_type        : <0xea7>
    <f7b>   DW_AT_data_member_location: 20
 <2><f7c>: Abbrev Number: 3 (DW_TAG_member)
    <f7d>   DW_AT_name        : (indirect string, offset: 0x863b9): CCMR1
    <f81>   DW_AT_decl_file   : 5
    <f82>   DW_AT_decl_line   : 901
    <f84>   DW_AT_decl_column : 17
    <f85>   DW_AT_type        : <0xea7>
    <f89>   DW_AT_data_member_location: 24
 <2><f8a>: Abbrev Number: 3 (DW_TAG_member)
    <f8b>   DW_AT_name        : (indirect string, offset: 0x61067): CCMR2
    <f8f>   DW_AT_decl_file   : 5
    <f90>   DW_AT_decl_line   : 902
    <f92>   DW_AT_decl_column : 17
    <f93>   DW_AT_type        : <0xea7>
    <f97>   DW_AT_data_member_location: 28
 <2><f98>: Abbrev Number: 3 (DW_TAG_member)
    <f99>   DW_AT_name        : (indirect string, offset: 0x3aed2): CCER
    <f9d>   DW_AT_decl_file   : 5
    <f9e>   DW_AT_decl_line   : 903
    <fa0>   DW_AT_decl_column : 17
    <fa1>   DW_AT_type        : <0xea7>
    <fa5>   DW_AT_data_member_location: 32
 <2><fa6>: Abbrev Number: 4 (DW_TAG_member)
    <fa7>   DW_AT_name        : CNT
    <fab>   DW_AT_decl_file   : 5
    <fab>   DW_AT_decl_line   : 904
    <fad>   DW_AT_decl_column : 17
    <fad>   DW_AT_type        : <0xea7>
    <fb1>   DW_AT_data_member_location: 36
 <2><fb2>: Abbrev Number: 4 (DW_TAG_member)
    <fb3>   DW_AT_name        : PSC
    <fb7>   DW_AT_decl_file   : 5
    <fb7>   DW_AT_decl_line   : 905
    <fb9>   DW_AT_decl_column : 17
    <fb9>   DW_AT_type        : <0xea7>
    <fbd>   DW_AT_data_member_location: 40
 <2><fbe>: Abbrev Number: 4 (DW_TAG_member)
    <fbf>   DW_AT_name        : ARR
    <fc3>   DW_AT_decl_file   : 5
    <fc3>   DW_AT_decl_line   : 906
    <fc5>   DW_AT_decl_column : 17
    <fc5>   DW_AT_type        : <0xea7>
    <fc9>   DW_AT_data_member_location: 44
 <2><fca>: Abbrev Number: 4 (DW_TAG_member)
    <fcb>   DW_AT_name        : RCR
    <fcf>   DW_AT_decl_file   : 5
    <fcf>   DW_AT_decl_line   : 907
    <fd1>   DW_AT_decl_column : 17
    <fd1>   DW_AT_type        : <0xea7>
    <fd5>   DW_AT_data_member_location: 48
 <2><fd6>: Abbrev Number: 3 (DW_TAG_member)
    <fd7>   DW_AT_name        : (indirect string, offset: 0x1cd7e): CCR1
    <fdb>   DW_AT_decl_file   : 5
    <fdc>   DW_AT_decl_line   : 908
    <fde>   DW_AT_decl_column : 17
    <fdf>   DW_AT_type        : <0xea7>
    <fe3>   DW_AT_data_member_location: 52
 <2><fe4>: Abbrev Number: 3 (DW_TAG_member)
    <fe5>   DW_AT_name        : (indirect string, offset: 0x65f93): CCR2
    <fe9>   DW_AT_decl_file   : 5
    <fea>   DW_AT_decl_line   : 909
    <fec>   DW_AT_decl_column : 17
    <fed>   DW_AT_type        : <0xea7>
    <ff1>   DW_AT_data_member_location: 56
 <2><ff2>: Abbrev Number: 3 (DW_TAG_member)
    <ff3>   DW_AT_name        : (indirect string, offset: 0x45315): CCR3
    <ff7>   DW_AT_decl_file   : 5
    <ff8>   DW_AT_decl_line   : 910
    <ffa>   DW_AT_decl_column : 17
    <ffb>   DW_AT_type        : <0xea7>
    <fff>   DW_AT_data_member_location: 60
 <2><1000>: Abbrev Number: 3 (DW_TAG_member)
    <1001>   DW_AT_name        : (indirect string, offset: 0xf865): CCR4
    <1005>   DW_AT_decl_file   : 5
    <1006>   DW_AT_decl_line   : 911
    <1008>   DW_AT_decl_column : 17
    <1009>   DW_AT_type        : <0xea7>
    <100d>   DW_AT_data_member_location: 64
 <2><100e>: Abbrev Number: 3 (DW_TAG_member)
    <100f>   DW_AT_name        : (indirect string, offset: 0x1eabb): BDTR
    <1013>   DW_AT_decl_file   : 5
    <1014>   DW_AT_decl_line   : 912
    <1016>   DW_AT_decl_column : 17
    <1017>   DW_AT_type        : <0xea7>
    <101b>   DW_AT_data_member_location: 68
 <2><101c>: Abbrev Number: 4 (DW_TAG_member)
    <101d>   DW_AT_name        : DCR
    <1021>   DW_AT_decl_file   : 5
    <1021>   DW_AT_decl_line   : 913
    <1023>   DW_AT_decl_column : 17
    <1023>   DW_AT_type        : <0xea7>
